[
  {
    "source": "17.Again.2009.1080p.BrRip.x264.YIFY.mp4",
    "year": 2009,
    "title": "17 Again",
    "runtime": 102,
    "rating": 6.4,
    "description": "37 year old Mike O'Donnell is extremely disappointed with his life because of some of the choices he made when he was 17. His wife threw him out of the house his kids think that he's a loser and want nothing to do with him, he lost his job. One small action gave him a another shot at his senior year in high school. For his kids he goes from a loser of a dad to an amazing friend that gives them great advice. He also realizes the things that he didn't realize when he was actually 17. Seeing senior year from a different point of view makes him realize that doing your life over isn't as fun as it seems.",
    "categories": [
      "Action",
      "Comedy",
      "Drama",
      "Family",
      "Fantasy",
      "Romance",
      "Sport"
    ],
    "cast": [
      "Zac Efron",
      "Margaret Cho",
      "Leslie Mann",
      "Jesse Heiman"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "21.Jump.Street.2012.1080p.BluRay.x264.YIFY.mp4",
    "year": 2012,
    "title": "21 Jump Street",
    "runtime": 109,
    "rating": 7.2,
    "description": "In 2005, Schmidt and Jenko are high school students, one an honor roll geek, the other a cool, athletic underachiever. By 2012, they are rookie cops, paired together, on bike patrol yearning to make arrests. After a screw up, they're sent undercover back to high school to find the source of a dangerous synthetic drug. They mix up their names, and Schmidt gets the no-brainer classes where he auditions for Peter Pan and falls in love with Wendy; Jenko gets AP classes where he falls in with high-achieving dweebs. This second chance at high school gives Schmidt delusions of grandeur, which threaten the operation. Can they sort out their relationship as they stumble onto the bad guys?—",
    "categories": [
      "Action",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Johnny Depp",
      "Dakota Johnson",
      "Dave Franco",
      "Channing Tatum"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "22.Jump.Street.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "22 Jump Street",
    "runtime": 112,
    "rating": 7,
    "description": "After making their way through high school (twice), big changes are in store for officers Schmidt (Jonah Hill) and Jenko (Channing Tatum) when they go deep undercover at a local college. But when Jenko meets a kindred spirit on the football team, and Schmidt infiltrates the bohemian art major scene, they begin to question their partnership. Now they don't have to just crack the case - they have to figure out if they can have a mature relationship. If these two overgrown adolescents can grow from freshmen into real men, college might be the best thing that ever happened to them.—Sony Pictures Entertainment",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Mystery"
    ],
    "cast": [
      "Dave Franco",
      "Channing Tatum",
      "Anna Faris",
      "Peter Stormare"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "A.Bad.Moms.Christmas.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "A Bad Moms Christmas",
    "runtime": 104,
    "rating": 5.6,
    "description": "A Bad Moms Christmas follows our three under-appreciated and over-burdened women as they rebel against the challenges and expectations of the Super Bowl for moms: Christmas. And as if creating a more perfect holiday for their families wasn't hard enough, they must do all of that while hosting and entertaining their own mothers. By the end of the journey, our moms will redefine how to make the holidays special for all and discover a closer relationship with their mothers.",
    "categories": [
      "Action",
      "Adventure",
      "Comedy"
    ],
    "cast": [
      "Kristen Bell",
      "Susan Sarandon",
      "Mila Kunis",
      "Cheryl Hines"
    ],
    "subtitles": []
  },
  {
    "source": "A.Million.Ways.to.Die.in.the.West.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "A Million Ways to Die in the West",
    "runtime": 116,
    "rating": 6.1,
    "description": "Set in 1882 in the American west, Albert is a lowly farmer with a nice girlfriend. But when she leaves him for the more successful and handsome owner of a moustachery store, Albert returns to his lonely daily life of trying to avoid death. Then the mysterious Anna rides into town and captures Albert's interest and heart, but with her deadly husband in town, Albert is going to have to become the western gun-slinging hero he never was. It won't be easy because there are a million ways to die in the west.—Anne Campbell",
    "categories": [
      "Action",
      "Comedy",
      "Romance",
      "Western"
    ],
    "cast": [
      "Liam Neeson",
      "Amanda Seyfried",
      "John Aylward",
      "Charlize Theron"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "A.Minecraft.Movie.2025.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2025,
    "title": "A Minecraft Movie",
    "runtime": 101,
    "rating": 5.6,
    "description": "Four misfits find themselves struggling with ordinary problems when they are suddenly pulled through a mysterious portal into the Overworld: a bizarre, cubic wonderland that thrives on imagination. To get back home, they'll have to master this world while embarking on a magical quest with an unexpected, expert crafter, Steve.",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Family",
      "Fantasy"
    ],
    "cast": [
      "Emma Myers",
      "Jason Momoa",
      "Jack Black",
      "Jennifer Coolidge"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "A.Simple.Favor.2018.1080p.BluRay.x264-[YTS.AM].mp4",
    "year": 2018,
    "title": "A Simple Favor",
    "runtime": 117,
    "rating": 6.7,
    "description": "Stephanie, a widowed mother, who also runs a cooking vlog, befriends Emily, an upper-class secretive woman whose child goes to same elementary school as of Stephanie's. Suddenly Emily goes missing and Stephanie starts investigating, only to find dark secrets, which changes the life of Stephanie forever.—kuntal_ghosh2002",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Drama",
      "Mystery",
      "Thriller"
    ],
    "cast": [
      "Linda Cardellini",
      "Bashir Salahuddin",
      "Blake Lively",
      "Melissa O'Neil"
    ],
    "subtitles": []
  },
  {
    "source": "Absolutely.Anything.2015.1080p.BluRay.x264.[YTS.AG].mp4",
    "year": 2015,
    "title": "Absolutely Anything",
    "runtime": 85,
    "rating": 6,
    "description": "Some aliens, who travel from planet to planet to see what kind of species inhabit them, come to Earth. And if humans are, according to their standards, decent, they are welcomed to be their friend. And if not, the planet is destroyed. To find out, they choose one inhabitant and give that person the power to do whatever he or she wants. And they choose Neil Clarke (Simon Pegg), a teacher who teaches the special kids. He is constantly being berated by the headmaster and is attracted to his neighbor, Catherine (Kate Beckinsale), but doesn't have the guts to approach her. But now he can do anything he wants, but has to be careful.—rcs0411@yahoo.com",
    "categories": [
      "Action",
      "Comedy",
      "Sci-Fi"
    ],
    "cast": [
      "Kate Beckinsale",
      "Robin Williams",
      "Simon Pegg",
      "Joanna Lumley"
    ],
    "subtitles": []
  },
  {
    "source": "Alexander.and.the.Terrible,.Horrible,.No.Good,.Very.Bad.Day.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "Alexander and the Terrible, Horrible, No Good, Very Bad Day",
    "runtime": 81,
    "rating": 6.2,
    "description": "For 12 year old Alexander Cooper, everyday is a bad day. And his family thinks he's being silly because they never have a bad day. On the day before his 12th birthday party, he learns that another boy is having a party of his own and everyone is going to it. And another kid punks him online. So at midnight of his birthday, he wishes that his whole family can have a bad day. And things for the whole family go bad, his mom's car is broken so they have to share a car, his sister has a cold and has to go on stage, his older brother, who's hoping to get his driver's license and to bring his girlfriend to the prom, has to deal with his girlfriend's snootiness and fails to get his license, his mom has a crisis at work which could cost her her job, and his dad who has a job interview has to bring his younger brother with him but because his pacifier is broken he can't stop crying. Alex feels responsible.—rcs0411@yahoo.com",
    "categories": [
      "Action",
      "Comedy",
      "Drama",
      "Family",
      "Fantasy"
    ],
    "cast": [
      "Rizwan Manji",
      "Dylan Minnette",
      "Steve Carell",
      "Jennifer Coolidge"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Aliens.in.the.Attic.2009.1080p.BrRip.x264.YIFY.mp4",
    "year": 2009,
    "title": "Aliens in the Attic",
    "runtime": 86,
    "rating": 5.4,
    "description": "Stuart Pearson heads with his family to spend a summer vacation in Creek Landing, Michigan, with his brother Nathan Pearson and his sons and their mother Rose in an old lake house they had rented. When the television has trouble with the image, Stuart's son Tom and the arrogant boyfriend of his sister Ricky Dillman go to the attic and then to the roof, where Tom meets his cousin Jake and they find the antenna dish totally destroyed. Sooner they discover four alien invaders that are preparing an invasion of the Earth that use a mind control weapon that only affects adults and they lock the quartet in the attic. Now they need to a find a way to force the adults to leave the house and discover the vulnerability of the invaders to plot a defense plan to save our planet.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Kevin Nealon",
      "Austin Butler",
      "Antonio Banderas",
      "J.K. Simmons"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "American.Pie.1999.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 1999,
    "title": "American Pie",
    "runtime": 95,
    "rating": 7,
    "description": "Jim, Oz, Finch and Kevin are four friends who make a pact that before they graduate they will all lose their virginity. The hard job now is how to reach that goal by prom night. Whilst Oz begins singing to grab attention and Kevin tries to persuade his girlfriend, Finch tries any easy route of spreading rumors and Jim fails miserably. Whether it is being caught on top of a pie or on the Internet, Jim always ends up with his trusty sex advice from his father. Will they achieve their goal of getting laid by prom night? Or will they learn something much different?—Film_Fan",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Tara Reid",
      "Eugene Levy",
      "Seann William Scott",
      "Natasha Lyonne"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "American.Pie.2.2001.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2001,
    "title": "American Pie 2",
    "runtime": 108,
    "rating": 6.5,
    "description": "The whole gang are back and as close as ever. They decide to get even closer by spending the summer together at a beach house. They decide to hold the biggest party ever to be seen, even if the preparation doesn't always go to plan. Especially when Stifler, Finch and Jim become more close to each other than they ever want to be and when Jim mistakes super glue for lubricant.—FilmFanUK",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Adam Brody",
      "Nigel Gibbs",
      "Larry Drake",
      "Tara Reid"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "American.Pie.Presents.Beta.House.2007.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2007,
    "title": "American Pie Presents: Beta House",
    "runtime": 85,
    "rating": 5.3,
    "description": "Erik, and Cooze start college and pledge the Beta House fraternity, presided over by none other than legendary Dwight Stifler. But chaos ensues when a fraternity of geeks threatens to stop the debauchery and the Betas have to make a stand for their right to party.—Anonymous",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Robbie Amell",
      "Eugene Levy",
      "Dan Petronijevic",
      "Meghan Heffern"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "American.Pie.Reunion.2012.Unrated.1080p.BluRay.x264.YIFY.mp4",
    "year": 2012,
    "title": "American Reunion",
    "runtime": 113,
    "rating": 6.7,
    "description": "Over a decade has passed and the gang return to East Great Falls, Michigan, for the weekend. They will discover how their lives have developed as they gather for their high school reunion. How has life treated Michelle, Jim, Heather, Oz, Kevin, Vicky, Finch, Stifler, and Stifler's mom? In the summer of 1999, it was four boys on a quest to lose their virginity. Now Kara is a cute high school senior looking for the perfect guy to lose her virginity to.—Kad",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Charlene Amoia",
      "Tara Reid",
      "Eugene Levy",
      "Seann William Scott"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "American.Wedding.2003.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2003,
    "title": "American Wedding",
    "runtime": 96,
    "rating": 6.3,
    "description": "Jim Levenstein has finally found the courage to ask his girlfriend, Michelle Flaherty to marry him. She agrees to get married, but the problems don't stop there for Jim. Now along with Paul Finch and Kevin Myers, Jim must plan the wedding. Unfortunately Steve Stifler is in town and won't let the wedding go past without having some fun himself, which includes setting up a secret bachelor party.—FilmFanUK",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Reynaldo Gallegos",
      "Alexis Thorpe",
      "Eugene Levy",
      "Seann William Scott"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Ant-Man.2015.1080p.BluRay.x264.[YTS.AG].mp4",
    "year": 2015,
    "title": "Ant-Man",
    "runtime": 117,
    "rating": 7.2,
    "description": "Armed with the astonishing ability to shrink in scale but increase in strength, con-man Scott Lang must embrace his inner-hero and help his mentor, Dr. Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Pym and Lang must plan and pull off a heist that will save the world.—@PtotheSmizzo",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Crime",
      "Sci-Fi"
    ],
    "cast": [
      "Chris Evans",
      "Michael Peña",
      "Judy Greer",
      "Paul Rudd"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Arrival.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Arrival",
    "runtime": 116,
    "rating": 7.9,
    "description": "Linguistics professor Louise Banks leads an elite team of investigators when gigantic spaceships touchdown in 12 locations around the world. As nations teeter on the verge of global war, Banks and her crew must race against time to find a way to communicate with the extraterrestrial visitors. Hoping to unravel the mystery, she takes a chance that could threaten her life and quite possibly all of mankind.—Jwelch5742",
    "categories": [
      "Drama",
      "Mystery",
      "Sci-Fi",
      "Thriller"
    ],
    "cast": [
      "Mark Camacho",
      "Amy Adams",
      "Jeremy Renner",
      "Forest Whitaker"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Arthur.Christmas.2011.1080p.BRrip.x264.YIFY.mp4",
    "year": 2011,
    "title": "Arthur Christmas",
    "runtime": 97,
    "rating": 7.1,
    "description": "This movie reveals the incredible, never-before seen answer to every child's question: \"So how does Santa deliver all those presents in one night?\" The answer: Santa's (Jim Broadbent's) exhilarating, ultra-high-tech operation hidden beneath the North Pole. But at the center of this movie is a story about a family in a state of comic dysfunction and an unlikely hero, Arthur (James McAvoy), with an urgent mission that must be completed before Christmas morning dawns.—Sony Pictures Animation",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Drama",
      "Family",
      "Fantasy"
    ],
    "cast": [
      "Bill Nighy",
      "James McAvoy",
      "Joan Cusack",
      "Jane Horrocks"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Avatar.2009.EXTENDED.REPACK.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2009,
    "title": "Avatar",
    "runtime": 162,
    "rating": 7.9,
    "description": "When his brother is killed in a robbery, paraplegic Marine Jake Sully decides to take his place in a mission on the distant world of Pandora. There he learns of greedy corporate figurehead Parker Selfridge's intentions of driving off the native humanoid \"Na'vi\" in order to mine for the precious material scattered throughout their rich woodland. In exchange for the spinal surgery that will fix his legs, Jake gathers knowledge, of the Indigenous Race and their Culture, for the cooperating military unit spearheaded by gung-ho Colonel Quaritch, while simultaneously attempting to infiltrate the Na'vi people with the use of an \"avatar\" identity. While Jake begins to bond with the native tribe and quickly falls in love with the beautiful alien Neytiri, the restless Colonel moves forward with his ruthless extermination tactics, forcing the soldier to take a stand - and fight back in an epic battle for the fate of Pandora.—The Massie Twins",
    "categories": [
      "Action",
      "Adventure",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Zoe Saldana",
      "Scott Lawrence",
      "Sigourney Weaver",
      "Sam Worthington"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Avatar.The.Way.Of.Water.2022.BLURAY.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2022,
    "title": "Avatar: The Way of Water",
    "runtime": 192,
    "rating": 7.5,
    "description": "Several years after the Na'vi repelled the RDA invasion Jake Sully and his family are living on Pandora. Things seem peaceful but the RDA has other plans, invading and capturing Pandora. Sully forms a guerrilla group to try to expel the invaders.—grantss",
    "categories": [
      "Action",
      "Adventure",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Kate Winslet",
      "Zoe Saldana",
      "Sigourney Weaver",
      "Sam Worthington"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Bad.Moms.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Bad Moms",
    "runtime": 100,
    "rating": 6.2,
    "description": "Amy has a seemingly perfect life - a great marriage, over-achieving kids, a beautiful home and a career. However, she's overworked, over-committed and exhausted to the point that she's about to snap. Fed up, she joins forces with two other over-stressed moms on a quest to liberate themselves from conventional responsibilities - going on a wild, un-mom-like binge of long overdue freedom, fun and self-indulgence - putting them on a collision course with PTA Queen Bee Gwendolyn and her clique of devoted perfect moms.—STX Entertainment.com",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Kristen Bell",
      "Mila Kunis",
      "Megan Ferguson",
      "Kathryn Hahn"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Bad.Teacher.2011.1080p.BluRay.x264-[YTS.AM].mp4",
    "year": 2011,
    "title": "Bad Teacher",
    "runtime": 92,
    "rating": 5.7,
    "description": "When her wealthy fiancé breaks it off, gold digger Elizabeth Halsey returns to middle school: she's an awful teacher but wants to save for breast-implant surgery. She brightens when Scott, a new teacher, turns out to be rich, and she stops showing films and sleeping in class when told there's a bonus for the teacher whose class scores highest on the state exam. Her competition for Scott and the bonus is cheery and tightly wound Amy. Amy digs for dirt on Elizabeth who cheats her way toward Scott's bed and the money. Honesty with students seems to be her only skill. She ignores Russell, a droll gym teacher, who looks on. Will she succeed with Scott and get those new breasts?—",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Dot-Marie Jones",
      "Andra Nechita",
      "Kathryn Newton",
      "Rick Overton"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Barbie.2023.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2023,
    "title": "Barbie",
    "runtime": 114,
    "rating": 6.8,
    "description": "Barbie the Doll lives in bliss in the matriarchal society of Barbieland feeling good about her role in the world in the various iterations of Barbies over the years showing girls that play with her that they can be whatever and whoever they want. On the flip side, Ken, who also lives in Barbieland, is unnoticed except in relation to Barbie, which is however one step above any other doll in Barbieland, such as Allan. One day, Stereotypical Barbie begins to have feelings which she's never experienced which leads to her world seemingly falling apart. Weird Barbie determines that there is something happening in the real world with someone playing with her being unhappy leading to Stereotypical Barbie reluctantly heading to the real world to rectify what is happening with that person, she first needing to find this person. Much to Barbie's chagrin, the original Ken, Beach Ken, tags along with her to the real world in he needing to survive in her presence. Beyond their mission to find this person, Barbie and Ken will find the real world unlike anything they know in Barbieland, especially in it being a male dominated society. While Barbie still has to find out what's going on that made her come to the real world, Ken is finding a newfound control which he wants to bring back to Barbieland. If he is able to do so, the role of Barbie in the real world may be forever changed. On top of everything, executives at Mattel, primarily white men, discover that a \"real life\" Barbie and Ken doll have infiltrated the real world, their mission to capture the pair, but especially Barbie, to put them/her back in their/her place, namely in a manufacturer's sealed box.—Huggo",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Fantasy"
    ],
    "cast": [
      "Margot Robbie",
      "Ryan Gosling",
      "Helen Mirren",
      "Rob Brydon"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Baywatch.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "Baywatch",
    "runtime": 116,
    "rating": 5.5,
    "description": "In sun-kissed Emerald Bay, the vigorous Lieutenant Mitch Buchannon and Baywatch, his elite team of hand-picked and perfectly tanned lifeguards, protect the bay, keeping both sunbathers and beach lovers safe. However, this summer, two new eager trainees will join the demanding life-saving program, as well as an insubordinate former Olympic swimmer, who are all called to prove their worth on the lifeguard towers just on time when a new synthetic street drug begins to infest the Emerald Bay: the flakka. Without a doubt, this calls for some serious undercover teamwork action, as the badgeless heroes in spandex comb the beach for shady newcomers and nefarious entrepreneurs with hidden agendas of their own. Can Mitch's band save the bay?—Nick Riganas",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Drama"
    ],
    "cast": [
      "Alexandra Daddario",
      "Rob Huebel",
      "Dwayne Johnson",
      "Samantha Harris"
    ],
    "subtitles": []
  },
  {
    "source": "Big.Hero.6.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "Big Hero 6",
    "runtime": 102,
    "rating": 7.8,
    "description": "When a devastating event befalls the city of San Fransokyo and catapults Hiro into the midst of danger, he turns to Baymax and his close friends adrenaline junkie Go Go Tomago, neatnik Wasabi, chemistry whiz Honey Lemon and fanboy Fred. Determined to uncover the mystery, Hiro transforms his friends into a band of high-tech heroes called \"Big Hero 6.\"—Walt Disney Animation Studios",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Crime",
      "Drama",
      "Family",
      "Fantasy",
      "Mystery",
      "Sci-Fi"
    ],
    "cast": [
      "Frank Welker",
      "Jamie Chung",
      "Alan Tudyk",
      "James Cromwell"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Blade.Runner.2049.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "Blade Runner 2049",
    "runtime": 164,
    "rating": 8,
    "description": "Thirty years after the events of Blade Runner (1982), a new Blade Runner, L.A.P.D. Officer \"K\" (Ryan Gosling), unearths a long-buried secret that has the potential to plunge what's left of society into chaos. K's discovery leads him on a quest to find Rick Deckard (Harrison Ford), a former L.A.P.D. Blade Runner, who has been missing for thirty years.—Warner Bros. Pictures",
    "categories": [
      "Action",
      "Drama",
      "Mystery",
      "Sci-Fi",
      "Thriller"
    ],
    "cast": [
      "Ana de Armas",
      "Ryan Gosling",
      "Harrison Ford",
      "Dave Bautista"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Brave.2012.1080p.BRrip.x264.YIFY.mp4",
    "year": 2012,
    "title": "Brave",
    "runtime": 93,
    "rating": 7.1,
    "description": "Set in Scotland in a rugged and mythical time, this movie features Princess Merida (Kelly Macdonald), an aspiring archer and impetuous daughter of Queen Elinor (Dame Emma Thompson). Merida makes a reckless choice that unleashes unintended peril and forces her to spring into action to set things right.—Walt Disney Pictures",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Drama",
      "Family",
      "Fantasy",
      "History",
      "Mystery",
      "Thriller"
    ],
    "cast": [
      "Emma Thompson",
      "Julie Walters",
      "Kelly Macdonald",
      "Steven Cree"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Bullet.Train.2022.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2022,
    "title": "Bullet Train",
    "runtime": 127,
    "rating": 7.3,
    "description": "Unlucky assassin Ladybug (Brad Pitt) is determined to do his job peacefully after one too many gigs has gone off the rails. Fate has other plans, however: Ladybug's latest mission puts him on a collision course with lethal adversaries from around the globe--all with connected, yet conflicting, objectives--on the world's fastest train. The end of the line is just the beginning in this non-stop thrill-ride through modern-day Japan.",
    "categories": [
      "Action",
      "Comedy",
      "Thriller"
    ],
    "cast": [
      "Brad Pitt",
      "Joey King",
      "Sandra Bullock",
      "Brian Tyree Henry"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Bumblebee.2018.1080p.BluRay.x264-[YTS.AM].mp4",
    "year": 2018,
    "title": "Bumblebee",
    "runtime": 114,
    "rating": 6.7,
    "description": "On Cybertron, the Autobots, led by Optimus Prime, are on the verge of losing the Great Cybertronian War to their enemies, the Decepticons, had begin making preparations to leave the planet. The Decepticons led by Shockwave, Soundwave and Starscream ambush them during the evacuation, and Optimus sends a young scout, B-127, to Earth in order to set up a base of operations where the Autobots can regroup. B-127 reaches Earth alone in 1987, crash-landing in California and disrupting a training exercise being conducted by Sector 7, a secret government agency that monitors extraterrestrial activity on Earth. Sector 7 agent Colonel Jack Burns presumes B-127 to be a hostile invader and attacks, driving B-127 into the forest, where he is then ambushed by the Decepticon Blitzwing. When B-127 refuses to reveal Optimus' whereabouts, Blitzwing spitefully tears out his voice-box and damages his memory core. B-127 manages to destroy Blitzwing before collapsing from his wounds. Before entering stasis, B-127 scans and transforms into a yellow 1967 Volkswagen Beetle.—Paramount Pictures",
    "categories": [
      "Action",
      "Adventure",
      "Sci-Fi"
    ],
    "cast": [
      "Hailee Steinfeld",
      "Gracie Dzienny",
      "Dylan O'Brien",
      "David Sobolov"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Central.Intelligence.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Central Intelligence",
    "runtime": 107,
    "rating": 6.3,
    "description": "Calvin Joyner was voted in high school the guy most likely to succeed. 20 years later he's an accountant. As his high school reunion approaches, he tries to make contact with his old schoolmates. And someone named Bob Stone contacts him. He says that he was known as Robbie Weirdicht in school. Calvin remembers that he was picked on, as a matter of fact after an extremely nasty prank he left school. They agree to meet and Calvin is surprised by how much he has changed. Bob asks Calvin to help him out. He says yes and the next thing he knows some men burst into his home. They're CIA, the one in charge is looking for Stone, she says he's a rogue agent. When they can't find Bob they leave. Later he approaches Calvin telling him, he is not a rogue agent, he's trying to find a person known as the Black Badger who is planning to sell some information that in the wrong hands can be disastrous. so he needs Calvin's help to stop him. Calvin's not sure whom he should believe.—rcs0411@yahoo.com",
    "categories": [
      "Action",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Jason Bateman",
      "Dwayne Johnson",
      "Kevin Hart",
      "Aaron Paul"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Chicken.Run.2000.1080p.BrRip.x264.Deceit.YIFY.mp4",
    "year": 2000,
    "title": "Chicken Run",
    "runtime": 84,
    "rating": 7.1,
    "description": "Ginger, Bunty, Babs and Fowler are chickens who are trapped on their farm and desperately want to escape. If they don't produce any eggs for the week, Mr. and Ms. Tweedy will have their heads. After every attempt, they fail and their time is running out. When it seems like all their attempts have failed, an American rooster called Rocky falls into the farm. Seeing Rocky flying, Ginger now realizes that the only way out now, is by flying. The chickens must learn the trade of flying before time runs outs.—simon",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Drama",
      "Family"
    ],
    "cast": [
      "Mel Gibson",
      "Olivia Hack",
      "Danny Mann",
      "Jane Horrocks"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Chicken.Run.Dawn.Of.The.Nugget.2023.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2023,
    "title": "Chicken Run: Dawn of the Nugget",
    "runtime": 98,
    "rating": 6.3,
    "description": "Having pulled off a death-defying escape from Tweedy's farm, Ginger has finally found her dream - a peaceful island sanctuary for the whole flock, far from the dangers of the human world. When she and Rocky hatch a little girl called Molly, Ginger's happy ending seems complete. But back on the mainland the whole of chicken-kind faces a new and terrible threat. For Ginger and her team, even if it means putting their own hard-won freedom at risk - this time, they're breaking in.—Aardman Animations",
    "categories": [
      "Adventure",
      "Animation",
      "Comedy",
      "Family"
    ],
    "cast": [
      "Romesh Ranganathan",
      "David Bradley",
      "Bella Ramsey",
      "Nick Mohammed"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Chinese.Zodiac.2012.1080p.BluRay.x264.YIFY.mp4",
    "year": 2012,
    "title": "Chinese Zodiac",
    "runtime": 109,
    "rating": 6,
    "description": "Asian Hawk (Jackie Chan) leads a mercenary team to recover several lost artifacts from the Old Summer Palace, the bronze heads of the 12 Chinese Zodiac animals which was looted by foreigners in the 1800s. Assisted by a Chinese student and a Parisian lady, Hawk stops at nothing to accomplish the mission.—Immanuel Ambhara",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Crime",
      "Family"
    ],
    "cast": [
      "Jackie Chan",
      "Ken Lo",
      "Daniel Wu",
      "Oliver Platt"
    ],
    "subtitles": [
      "en",
      "si"
    ]
  },
  {
    "source": "Cinderella.2015.1080p.BluRay.x264.YIFY.mp4",
    "year": 2015,
    "title": "Cinderella",
    "runtime": 105,
    "rating": 6.9,
    "description": "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella becomes one with her pure heart when she meets the Prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
    "categories": [
      "Action",
      "Adventure",
      "Drama",
      "Family",
      "Fantasy",
      "Romance"
    ],
    "cast": [
      "Lily James",
      "Cate Blanchett",
      "Rob Brydon",
      "João Costa Menezes"
    ],
    "subtitles": [
      "en",
      "si"
    ]
  },
  {
    "source": "Cloudy.with.a.Chance.of.Meatballs.2.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "Cloudy with a Chance of Meatballs 2",
    "runtime": 95,
    "rating": 6.3,
    "description": "After the disastrous food storm in the first film, Flint and his friends are forced to leave the town. Flint accepts the invitation from his idol Chester V to join The Live Corp Company, which has been tasked to clean the island, and where the best inventors in the world create technologies for the betterment of mankind. When Flint discovers that his machine still operates and now creates mutant food beasts like living pickles, hungry tacodiles, shrimpanzees and apple pie-thons, he and his friends must return to save the world.—Reese Sara Eversting",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Anna Faris",
      "Andy Samberg",
      "Scott Menville",
      "Benjamin Bratt"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Cloudy.With.A.Chance.Of.Meatballs.2009.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2009,
    "title": "Cloudy with a Chance of Meatballs",
    "runtime": 90,
    "rating": 6.9,
    "description": "Flint Lockwood thinks he's a genius. But none of the things he invented are things that make sense or are useful. However, he has the support of his mother but when she dies, he's left alone with his father who thinks he should give it up. When the community that he lives in is in an economic crisis because their primary source of income, a sardine cannery, was shut down, Flint decides to try his latest invention, a machine that can turn water into food. But something goes wrong and the machine ends up in the atmosphere. Later it starts raining food. The shifty mayor tries to use this as a way to help their community, but when Flint senses something wrong with the machine, the mayor convinces him to ignore it. However, as Flint predicts, chaos ensues.—rcs0411@yahoo.com",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "News",
      "Romance",
      "Sci-Fi"
    ],
    "cast": [
      "Anna Faris",
      "Andy Samberg",
      "Michael Bell",
      "Danny Mann"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Code.3.2025.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2025,
    "title": "Code 3",
    "runtime": 104,
    "rating": 7.2,
    "description": "A burned-out paramedic tries to survive his last 24 hours on the job while training a new recruit.",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Eric Jungmann",
      "Andy Milder",
      "Michael Monks",
      "Treisa Gary"
    ],
    "subtitles": []
  },
  {
    "source": "Crazy.Stupid.Love.2011.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2011,
    "title": "Crazy, Stupid, Love.",
    "runtime": 118,
    "rating": 7.4,
    "description": "Cal (Steve Carell) and Emily (Julianne Moore) have the perfect life together living the American dream... until Emily asks for a divorce. Now Cal, Mr Husband, has to navigate the single scene with a little help from his professional bachelor friend Jacob Palmer (Ryan Gosling). Make that a lot of help...—Anonymous",
    "categories": [
      "Action",
      "Comedy",
      "Drama",
      "Romance"
    ],
    "cast": [
      "Emma Stone",
      "Joey King",
      "Ryan Gosling",
      "Kevin Bacon"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Daddy_s.Home.2.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "Daddy's Home 2",
    "runtime": 100,
    "rating": 6,
    "description": "After burying the hatchet in Daddy's Home (2015), the stepfather with a heart of gold, Brad, and the kids' biological dad with the perfect six-pack, Dusty, are now proud co-dads, working in unison to care for Megan and Dylan. This year, with Christmas just around the corner, the once-incompatible parents and their families decide to spend the holidays together; however, things will take a turn for the unexpected when Dusty's alpha-dad, Kurt, and Brad's touchy-feely father, Don, decide to pay a visit. Now--as the merry holidaymakers end up in a snow-capped cabin for a week--it seems that there's no escape from an impending Yuletide disaster unless the two pairs of fathers learn how to coexist and work together for the sake of the kids. Will things work out in the end? Can the four daddies save Christmas?—Nick Riganas",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Mark Wahlberg",
      "Liam Neeson",
      "Mel Gibson",
      "Linda Cardellini"
    ],
    "subtitles": []
  },
  {
    "source": "Daddy_s.Home.2015.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2015,
    "title": "Daddy's Home",
    "runtime": 96,
    "rating": 6.2,
    "description": "Stepfather Brad Whitaker is hoping for his stepchildren to love him and treat him like a dad. All is going well until the biological father, Dusty Mayron, shows up, then everything takes a toll. His stepchildren start putting him second and their father first, and now Dusty will have to learn that being a good dad is about pains and struggles. Brad will also experience once again what it's like to be a stepdad.",
    "categories": [
      "Action",
      "Comedy",
      "Family"
    ],
    "cast": [
      "Mark Wahlberg",
      "Linda Cardellini",
      "John Cena",
      "Jamie Denbo"
    ],
    "subtitles": []
  },
  {
    "source": "Date.Night.2010.1080p.BrRip.x264.BOKUTOX.YIFY.mp4",
    "year": 2010,
    "title": "Date Night",
    "runtime": 88,
    "rating": 6.3,
    "description": "Phil and Claire Foster are a couple who have been married for several years. Their days consists of them taking care of their children and going to work and coming home and going to bed. But they find time to have a date night wherein they go out and spend some time together. When another couple they know announce that they're separating because they're in a rut, Phil feels that he and Claire could be too. So when date night comes Phil decides to do something different. So they go into the city and try to get into a new popular restaurant. But when it's full and still wanting to do this, Phil decides to take the reservation of a couple who doesn't show up. While they're having dinner two men approach them and instructs them to stand up and go with them. They think the men are with the restaurant and want to talk to them about taking someone else's reservation. But it appears the couple whose reservation they took crossed someone and the two men work for this person. The men are after something, but whatever it is they don't have it.—rcs0411@yahoo.com",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Romance",
      "Thriller"
    ],
    "cast": [
      "Mark Wahlberg",
      "Will.i.am",
      "Jon Bernthal",
      "Mark Ruffalo"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Deadpool.2.2018.1080p.BluRay.x264-[YTS.AM].mp4",
    "year": 2018,
    "title": "Deadpool 2",
    "runtime": 119,
    "rating": 7.6,
    "description": "After losing Vanessa (Morena Baccarin), the love of his life, fourth-wall-breaking mercenary Wade Wilson, aka Deadpool (Ryan Reynolds), must assemble a team and protect a young mutant Russell Collins, aka Firefist (Julian Dennison), from Cable (Josh Brolin), a no-nonsense, dangerous cyborg from the future, and must also learn the most important lesson of all: to be part of a family again.—ahmetkozan",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Sci-Fi"
    ],
    "cast": [
      "Matt Damon",
      "Bill Skarsgård",
      "Brad Pitt",
      "Morena Baccarin"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Deadpool.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Deadpool",
    "runtime": 108,
    "rating": 8,
    "description": "This is the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.—20th Century Fox",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Romance",
      "Sci-Fi"
    ],
    "cast": [
      "Morena Baccarin",
      "Jed Rees",
      "Ryan Reynolds",
      "Paul Lazenby"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Despicable.Me.2.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "Despicable Me 2",
    "runtime": 98,
    "rating": 7.3,
    "description": "While Gru, the ex-supervillain is adjusting to family life and an attempted honest living in the jam business, a secret Arctic laboratory is stolen. The Anti-Villain League decides it needs an insider's help and recruits Gru in the investigation. Together with the eccentric AVL agent, Lucy Wilde, Gru concludes that his prime suspect is the presumed dead supervillain, El Macho, whose his teenage son is also making the moves on his eldest daughter, Margo. Seemingly blinded by his overprotectiveness of his children and his growing mutual attraction to Lucy, Gru seems on the wrong track even as his minions are being quietly kidnapped en masse for some malevolent purpose.—Kenneth Chisholm (kchishol@rogers.com)",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Crime",
      "Family",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Danny Mann",
      "Vanessa Bayer",
      "Rob Tinkler",
      "Miranda Cosgrove"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Despicable.Me.2010.1080p.BluRay.x264.YIFY.mp4",
    "year": 2010,
    "title": "Despicable Me",
    "runtime": 0,
    "rating": 7.6,
    "description": "In a happy suburban neighborhood surrounded by white picket fences with flowering rose bushes, sits a black house with a dead lawn. Unbeknownst to the neighbors, hidden beneath this house is a vast secret hideout. Surrounded by a small army of minions, we discover Gru (Steve Carell), planning the biggest heist in the history of the world. He is going to steal the moon. Gru delights in all things wicked. Armed with his arsenal of shrink rays, freeze rays, and battle-ready vehicles for land and air, he vanquishes all who stand in his way. Until the day he encounters the immense will of three little orphaned girls who look at him and see something that no one else has ever seen: a potential Dad. The world's greatest villain has just met his greatest challenge: three little girls named Margo (Miranda Cosgrove), Edith (Dana Gaier), and Agnes (Elsie Fisher).—Universal Pictures",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Crime",
      "Family",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Rob Huebel",
      "Danny Mann",
      "Rob Tinkler",
      "Miranda Cosgrove"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Despicable.Me.3.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "Despicable Me 3",
    "runtime": 89,
    "rating": 6.3,
    "description": "After he is fired from the Anti-Villain League for failing to take down the latest bad guy to threaten humanity, Gru (Steve Carell) finds himself in the midst of a major identity crisis. But when a mysterious stranger shows up to inform Gru that he has a long-lost twin brother - a brother who desperately wishes to follow in his twin's despicable footsteps - one former supervillain will rediscover just how good it feels to be bad.",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Crime",
      "Family",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Danny Mann",
      "Miranda Cosgrove",
      "Steve Carell",
      "Jessica DiCicco"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Diary.Of.A.Wimpy.Kid.2010.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2010,
    "title": "Diary of a Wimpy Kid",
    "runtime": 94,
    "rating": 6.2,
    "description": "To Greg Heffley, middle school is the dumbest idea ever invented. It's a place rigged with hundreds of social landmines, not the least of which are morons, wedgies, swirlies, bullies, lunchtime banishment to the cafeteria floor - and a festering piece of cheese with nuclear cooties. To survive the never-ending ordeal and attain the recognition and status he feels he so richly deserves, Greg devises an endless series of can't-miss schemes, all of which, of course, go awry. And he's getting it all down on paper, via a diary - \"it's NOT a diary, it's a journal!\" Greg insists, preferring the less-sissyfied designation - filled with his opinions, thoughts, tales of family trials and tribulations, and (would-be) schoolyard triumphs. \"One day when I'm famous,\" writes Greg, \"I'll have better things to do than answer people's stupid questions all day.\" So was born the Wimpy Kid's diary.—Twentieth Century Fox",
    "categories": [
      "Action",
      "Animation",
      "Comedy",
      "Drama",
      "Family"
    ],
    "cast": [
      "Chloë Grace Moretz",
      "Devon Bostick",
      "Alistair Abell",
      "Steve Zahn"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Diary.of.a.Wimpy.Kid.Dog.Days.2012.1080p.BrRip.x264.YIFY.mp4",
    "year": 2012,
    "title": "Diary of a Wimpy Kid: Dog Days",
    "runtime": 94,
    "rating": 6.3,
    "description": "Summer vacation started, and Greg has his own way to enjoy it with video games. However, his father wants him to go outside and stop playing video games, and his mother has her own plans, including a reading club. In addition, Greg can't get along with his father. The only thing they have in common is the hatred for the Lil Cutie Comics. Things only get worse after the stay at the beachside cabin goes totally wrong. Will anything go right? At least there's Holly Hills.—gamergcfan",
    "categories": [
      "Action",
      "Animation",
      "Comedy",
      "Family"
    ],
    "cast": [
      "Devon Bostick",
      "Steve Zahn",
      "Emily Holmes",
      "Rachael Harris"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Diary.Of.A.Wimpy.Kid.Rodrick.Rules.2011.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2011,
    "title": "Diary of a Wimpy Kid: Rodrick Rules",
    "runtime": 99,
    "rating": 6.6,
    "description": "Greg and Rodrick don't get along, and his parents are fully aware of that. In order to help them get along, Greg's mother introduces Mom Bucks, which rewards them for getting along. But Rodrick isn't the only problem. He has to deal with any conflicts involving Holly Hills, as well as other embarrassing situations. Will Greg and Rodrick get along?—gamergcfan",
    "categories": [
      "Action",
      "Animation",
      "Comedy",
      "Family"
    ],
    "cast": [
      "Devon Bostick",
      "Steve Zahn",
      "Rachael Harris",
      "John Shaw"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Dinner.for.Schmucks.2010.1080p.BluRay.x264.YIFY.mp4",
    "year": 2010,
    "title": "Dinner for Schmucks",
    "runtime": 114,
    "rating": 5.9,
    "description": "Tim (Rudd) is a rising executive who \"succeeds\" in finding the perfect guest, IRS employee Barry (Carell), for his boss's monthly event, a so-called \"dinner for idiots,\" which offers certain advantages to the exec who shows up with the biggest buffoon.—Anonymous",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Paul Rudd",
      "Zach Galifianakis",
      "Jeff Dunham",
      "Rick Overton"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Dirty.Grandpa.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Dirty Grandpa",
    "runtime": 102,
    "rating": 5.9,
    "description": "Jason Kelly, the grandson of Dick Kelly, loses his grandmother about two weeks before his wedding to Meredith. He tries to assist his grandfather and console him for his loss, but was rather tricked into a spring break road trip; chasing youth once again. with the help of Shadia and Lenore, the two men go on an adventure they'll never forget.—itzgodwinhenry",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Robert De Niro",
      "Zac Efron",
      "Aubrey Plaza",
      "Dermot Mulroney"
    ],
    "subtitles": []
  },
  {
    "source": "Doctor.Strange.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Doctor Strange",
    "runtime": 115,
    "rating": 7.5,
    "description": "Marvel's \"Doctor Strange\" follows the story of the talented neurosurgeon Doctor Stephen Strange who, after a tragic car accident, must put ego aside and learn the secrets of a hidden world of mysticism and alternate dimensions. Based in New York City's Greenwich Village, Doctor Strange must act as an intermediary between the real world and what lies beyond, utilising a vast array of metaphysical abilities and artifacts to protect the Marvel Cinematic Universe.—Marvel",
    "categories": [
      "Action",
      "Adventure",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Scott Adkins",
      "Benedict Cumberbatch",
      "Mads Mikkelsen",
      "Benedict Wong"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Dora.And.The.Lost.City.Of.Gold.2019.1080p.BluRay.x264-[YTS.LT].mp4",
    "year": 2019,
    "title": "Dora and the Lost City of Gold",
    "runtime": 102,
    "rating": 6.1,
    "description": "Dora has spent most of her life exploring the jungle with her parents, but nothing could prepare her for her most dangerous adventure ever: high school. Always the explorer, Dora quickly finds herself leading Boots, Diego, a mysterious jungle inhabitant, and a ragtag group of teens on a live-action adventure to save her parents and solve the impossible mystery behind a lost Inca civilization.—Nick Moreau",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Horror",
      "Mystery"
    ],
    "cast": [
      "Malachi Barton",
      "Isabela Moner",
      "Sasha Toro",
      "Benicio Del Toro"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Dracula.Untold.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "Dracula Untold",
    "runtime": 92,
    "rating": 6.2,
    "description": "At the turn of the century, the young lord Vlad and his family live a peaceful life ruling over their small kingdom, but when a Turk warlord demands from Vlad a thousand boys and his son to create an army Vlad seeks a terrible power that will allow him to protect his kingdom and family from the Turks at a terrible cost.—Blue_EagleUK",
    "categories": [
      "Action",
      "Drama",
      "Fantasy",
      "Horror",
      "War"
    ],
    "cast": [
      "Charles Dance",
      "Sarah Gadon",
      "Luke Evans",
      "Joseph Long"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Due.Date.2010.1080p.BrRip.x264.YIFY.mp4",
    "year": 2010,
    "title": "Due Date",
    "runtime": 95,
    "rating": 6.5,
    "description": "Businessman and first time father (to-be), Peter Highman, is in Atlanta heading home to LA, where his wife is about to give birth, but after getting kicked off a plane, due to his seat mate, the pair end up trying to hitch a ride to the west coast.—Huggo",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Crime",
      "Drama",
      "Western"
    ],
    "cast": [
      "Robert Downey Jr.",
      "Zach Galifianakis",
      "Aaron Lustig",
      "Juliette Lewis"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Dungeons.Dragons.Honor.Among.Thieves.2023.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2023,
    "title": "Dungeons & Dragons: Honor Among Thieves",
    "runtime": 134,
    "rating": 7.2,
    "description": "A charming thief and a band of unlikely adventurers undertake an epic heist to retrieve a lost relic, but things go dangerously awry when they run afoul of the wrong people. Dungeons and Dragons: Honor Among Thieves brings the rich world and playful spirit of the legendary roleplaying game to the big screen in a hilarious and action-packed adventure.—Official synopsis",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Fantasy"
    ],
    "cast": [
      "Jude Hill",
      "Sophia Lillis",
      "David Sobolov",
      "Bradley Cooper"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Easy.A.2010.BrRip.1080p.x264.YIFY.mp4",
    "year": 2010,
    "title": "Easy A",
    "runtime": 92,
    "rating": 7,
    "description": "After a little white lie about losing her virginity gets out, a clean cut high school girl sees her life paralleling Hester Prynne's in \"The Scarlet Letter,\" which she is currently studying in school - until she decides to use the rumor mill to advance her social and financial standing.—Sony Pictures",
    "categories": [
      "Action",
      "Comedy",
      "Drama",
      "Romance"
    ],
    "cast": [
      "Emma Stone",
      "Stanley Tucci",
      "Yolanda Snowball",
      "Lalaine"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "EuroTrip.2004.UNRATED.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2004,
    "title": "EuroTrip",
    "runtime": 92,
    "rating": 6.6,
    "description": "Ohio high school student Scott Thomas is a good student and nice guy - albeit a little predictable - who is about to graduate and go into pre-med. He is unceremoniously dumped by his whorish girlfriend Fiona on graduation day. Among the people he turns to in his hour of despair is his German pen pal, Mike. Scott and Mike seem to have a special connection. After Mike makes advances to Scott now that he and Fiona are not seeing each other, Scott abruptly sends Mike a message saying he never wants to hear from him again. However, Scott learns shorty thereafter that Mike is actually a beautiful girl named Mieke. By this time, Mieke has blocked his messages. Thinking that Mieke is actually who he was meant to be with, Scott, impulsively for a change, decides to go to Berlin to be with her. Along for the ride is Scott's best friend, the girl crazy Cooper Harris. They manage only to get a flight into London, and thus have to make their way from London to Berlin. Along the way in Paris, they run into their high school friends, twins Jenny and Jamie, who are backpacking through Europe. Scott and Cooper consider them the most mismatched twins ever, Jamie who is a walking encyclopedia, and Jenny a girl who they treat as just one of the guys. As the four try to make their way to Berlin, they run into a few obstacles and few adventures. Scott hopes that all these problems are worth it when he has his much hyped in his mind meeting with Mieke.—Huggo",
    "categories": [
      "Action",
      "Adventure",
      "Comedy"
    ],
    "cast": [
      "Miroslav Táborský",
      "Matt Damon",
      "Jana Pallaske",
      "Petr Jákl"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Evan.Almighty.2007.1080p.BluRay.x264.YIFY.mp4",
    "year": 2007,
    "title": "Evan Almighty",
    "runtime": 96,
    "rating": 5.4,
    "description": "Buffalo newsman Evan Baxter is elected to Congress with the slogan, \"Change the world.\" He lucks into a huge house in a new Virginia suburb. His Capitol office is also fantastic, but there's a catch: he's tapped by the powerful Congressman Long to co-sponsor a bill to allow development in national parks. In steps God, who appears to a disbelieving Evan and gently commands him to build an ark. Tools and wood arrive in Evan's yard, animal pairs follow, his beard and hair grow wildly, nomad's clothes and a staff appear. Long grows impatient, Evan starts building, his family leaves him, reporters gather, and drought grips D.C. Still, Evan believes. But will he change the world?—",
    "categories": [
      "Action",
      "Comedy",
      "Family",
      "Fantasy"
    ],
    "cast": [
      "Morgan Freeman",
      "Arden Myrin",
      "Brian Howe",
      "Lillian Lehman"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Fast.X.2023.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2023,
    "title": "Fast X",
    "runtime": 141,
    "rating": 5.7,
    "description": "The end of the road begins. Fast X, the tenth film in the Fast and Furious Saga, launches the final chapters of one of cinema's most storied and popular global franchises, now in its third decade and still going strong with the same core cast and characters as when it began. Over many missions and against impossible odds, Dom Toretto (Vin Diesel) and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything-and everyone-that Dom loves, forever. In 2011's Fast Five, Dom and his crew took out nefarious Brazilian drug kingpin Hernan Reyes and decapitated his empire on a bridge in Rio De Janeiro. What they didn't know was that Reyes' son, Dante (Aquaman's Jason Momoa), witnessed it all and has spent the last 12 years masterminding a plan to make Dom pay the ultimate price. Dante's plot will scatter Dom's family from Los Angeles to the catacombs of Rome, from Brazil to London and from Portugal to Antarctica. New allies will be forged and old enemies will resurface. But everything changes when Dom discovers that his own 8-year-old son (Leo Abelo Perry, Black-ish) is the ultimate target of Dante's vengeance. Directed by Louis Leterrier (Clash of the Titans, The Incredible Hulk), Fast X stars returning cast members Michelle Rodriguez, Tyrese Gibson, Chris \"Ludacris\" Bridges, Nathalie Emmanuel, Jordana Brewster, Sung Kang, Jason Statham, John Cena and Scott Eastwood, with Oscar® winner Helen Mirren and Oscar® winner Charlize Theron. The film also features an extraordinary new cast including Oscar® winner Brie Larson as Tess, a rogue representative from the Agency; Alan Richtson (Reacher) as Aimes, the new head of the Agency who doesn't hold the same fondness for Dom's crew as his predecessor, Mr. Nobody; Daniela Melchior (The Suicide Squad) as a Brazilian street racer with a powerful tie to Dom's past; and legendary Oscar® winner Rita Moreno as Dom and Mia's Abuelita Toretto. Fast X is produced by Neal H. Moritz, Vin Diesel, Justin Lin, Jeff Kirschenbaum and Samantha Vincent. The executive producers are Joseph M. Caracciolo, Jr., David Cain, Chris Morgan, Amanda Lewis and Mark Bomback.—www.thefastsaga.com",
    "categories": [
      "Action",
      "Adventure",
      "Crime",
      "Mystery",
      "Thriller"
    ],
    "cast": [
      "Vin Diesel",
      "Jason Statham",
      "Jason Momoa",
      "Dwayne Johnson"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Fifty.Shades.Darker.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "Fifty Shades Darker",
    "runtime": 118,
    "rating": 4.6,
    "description": "Christian and Ana decide to rekindle their relationship, except this time there are no more rules or punishments. As they begin to get used to their newfound relationship, Christian's past begins to haunt Ana as Christian struggles with his innermost thoughts.",
    "categories": [
      "Action",
      "Drama",
      "Mystery",
      "Romance",
      "Thriller"
    ],
    "cast": [
      "Dakota Johnson",
      "Mark DeCarlo",
      "Bella Heathcote",
      "Kim Basinger"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Fifty.Shades.Freed.2018.1080p.BluRay.x264-[YTS.AM].mp4",
    "year": 2018,
    "title": "Fifty Shades Freed",
    "runtime": 105,
    "rating": 4.6,
    "description": "Believing they have left behind shadowy figures from their past, newlyweds Christian (Jamie Dornan) and Ana (Dakota Johnson) fully embrace an inextricable connection and shared life of luxury. But just as she steps into her role as Mrs. Grey and he relaxes into an unfamiliar stability, new threats could jeopardize their happy ending before it even begins.—Official Synopsis",
    "categories": [
      "Action",
      "Drama",
      "Mystery",
      "Romance",
      "Thriller"
    ],
    "cast": [
      "Dakota Johnson",
      "Jennifer Ehle",
      "Catherine Lough Haggquist",
      "Callum Keith Rennie"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Fifty.Shades.of.Grey.2015.1080p.BluRay.x264.YIFY.mp4",
    "year": 2015,
    "title": "Fifty Shades of Grey",
    "runtime": 125,
    "rating": 4.2,
    "description": "Anastasia Steele, an English literature major at Washington State University, agrees to interview for the college newspaper a billionaire, Christian Grey, as a favour to her roommate, Kate Kavanagh. During the interview, Christian Grey takes an interest in Anastasia. Soon after it, he visits the hardware store where Anastasia works and offers her to do a photo shoot to accompany the article for which Anastasia had interviewed him. Later, Grey invites her to a cafe and also sends her first edition copies of two Thomas Hardy novels, including Tess of the d'Urbervilles, with a quote from the latter book about the dangers of relationships, on an accompanying card. His pursuing eventually brings a result - Anastasia and Grey start dating. In the course of their troubled relationship Anastasia slowly comes to uncover Grey's troubled past and realises that he is not good for any woman, let alone for himself. Although, she enjoys the bondage sex with Grey, she feels that she has to make a step that will take her all her strength and courage, for Christian Grey is a very dangerous man.—MischaLeCroix",
    "categories": [
      "Action",
      "Drama",
      "Romance",
      "Thriller"
    ],
    "cast": [
      "Dakota Johnson",
      "Jennifer Ehle",
      "Callum Keith Rennie",
      "Reese Alexander"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Fist.Fight.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "Fist Fight",
    "runtime": 91,
    "rating": 5.6,
    "description": "On the last day of school, right on Senior Prank Day in Roosevelt High, things don't look good for meek English teacher Andy Campbell, who feels exceptionally expendable facing a bleak future in front of severe job cuts, just before the year's new school season. But soon, things will go from bad to worse when feeble Campbell will infuriate the scary hot-headed history teacher Ron Strickland, who in turn, he will challenge him in an old-school, no-holds-barred, mano-a-mano throwdown in front of everybody, in the parking lot after school. Inevitably, now that the fight is on, no excuses, no regrets, and certainly no talking sense into Strickland, is going to save Campbell who needs to face the consequences of his actions and pay the heavy price. After all, snitches get stitches.—Nick Riganas",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Dean Norris",
      "Alexa Nisenson",
      "Robert Pralgo",
      "Michael Beasley"
    ],
    "subtitles": []
  },
  {
    "source": "Free.Guy.2021.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2021,
    "title": "Free Guy",
    "runtime": 115,
    "rating": 7.1,
    "description": "In the extremely popular video game, Free City, a NPC named Guy learns the true nature of his existence when he meets the girl of his dreams, a human player. This player's interactions with Guy has massive affects on him, the game, and real world as they play it.",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Fantasy",
      "Romance",
      "Sci-Fi"
    ],
    "cast": [
      "Chris Evans",
      "Dwayne Johnson",
      "Joe Keery",
      "Hugh Jackman"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Freelance.2023.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2023,
    "title": "Freelance",
    "runtime": 108,
    "rating": 5.6,
    "description": "Ex-special forces operative Mason Pettits (John Cena) is stuck in a dead-end desk job when he reluctantly takes on a freelance gig to provide private security for washed-up journalist Claire Wellington (Alison Brie) as she interviews the ruthless - but impeccably dressed - dictator, Juan Venegas (Juan Pablo Raba). When a military coup breaks out just as she's about to get the scoop of a lifetime, the unlikely trio must figure out how to survive the jungle AND each other in order to make it out alive. From Pierre Morel, the dynamic director of TAKEN and PEPPERMINT, FREELANCE is",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Marton Csokas",
      "Alice Eve",
      "Christian Slater",
      "John Cena"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Friends.With.Benefits.2011.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2011,
    "title": "Friends with Benefits",
    "runtime": 109,
    "rating": 6.5,
    "description": "Jamie Rellis (Mila Kunis) is a New York City head-hunter trying to sign Los Angeles-based art director Dylan Harper (Justin Timberlake) for her client. When he takes the job and makes the move, they quickly become friends. Their friendship turns into a friendship with benefits, but with Jamie's emotionally damaged past and Dylan's history of being emotionally unavailable, they have to try to not fall for each other the way Hollywood romantic comedies dictate.—napierslogs",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Emma Stone",
      "Mila Kunis",
      "Woody Harrelson",
      "Andy Samberg"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Frozen.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "Frozen",
    "runtime": 102,
    "rating": 7.4,
    "description": "Fearless optimist Anna teams up with rugged mountain man Kristoff and his loyal reindeer Sven and sets off on an epic journey to find her sister Elsa, whose icy powers have trapped the kingdom of Arendelle in eternal winter. Encountering Everest-like conditions, mystical trolls and a hilarious snowman named Olaf, Anna and Kristoff battle the elements in a race to save the kingdom. From the outside Elsa looks poised, regal and reserved, but in reality she lives in fear as she wrestles with a mighty secret: she was born with the power to create ice and snow. It's a beautiful ability, but also extremely dangerous. Haunted by the moment her magic nearly killed her younger sister Anna, Elsa has isolated herself, spending every waking minute trying to suppress her growing powers. Her mounting emotions trigger the magic, accidentally setting off an eternal winter that she can't stop. She fears she's becoming a monster and that no one, not even her sister, can help her.—DeAlan Wilson for ComedyE.com",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Musical"
    ],
    "cast": [
      "Kristen Bell",
      "Frank Welker",
      "Pierre Taki",
      "Nick Jameson"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Frozen.II.2019.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2019,
    "title": "Frozen II",
    "runtime": 103,
    "rating": 6.8,
    "description": "Having harnessed her ever-growing power after lifting the dreadful curse of eternal winter in Frozen (2013), Queen Elsa, the grand conjurer of snow and ice, and her sister, Princess Anna, now enjoy a happy life in the peaceful kingdom of Arendelle. However, a melodious, insistent voice only Elsa can hear keeps her awake, inviting the Snow Queen to a fabled mystical forest. As a result, unable to block the thrilling call of the secret siren, Elsa follows the voice into the perpetually misty realm in the woods to find answers. But, more and more, an inexplicable imbalance hurts her kingdom and the neighboring tribe of Northuldra. Is Queen Elsa's legendary magic enough to restore peace and stability?—Nick Riganas",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Drama",
      "Family",
      "Fantasy",
      "Musical"
    ],
    "cast": [
      "Kristen Bell",
      "Scott Menville",
      "Ciarán Hinds",
      "Jessica DiCicco"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Game.Over,.Man!.2018.1080p.WEBRip.x264-[YTS.AM].mp4",
    "year": 2018,
    "title": "Game Over, Man!",
    "runtime": 101,
    "rating": 5.5,
    "description": "Alexxx, Darren, and Joel are three losers who work as maids at a hotel and all have problems. Alexxx is an impulsive and immature manchild. Darren constantly vapes to avoid the world around. Joel is a closeted gay man whose sexuality is obvious to everyone except himself. When word gets out that social media influencer Bae Awadi is coming to their hotel, the three try to pitch their game idea to him. But when terrorists arrive and take hostages, including Bae, the three must man up and save the day.",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Neal McDonough",
      "Jere Burns",
      "Sam Richardson",
      "Mark Cuban"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Get.Hard.2015.1080p.BluRay.x264.YIFY.mp4",
    "year": 2015,
    "title": "Get Hard",
    "runtime": 100,
    "rating": 6,
    "description": "Kevin Hart plays the role of Darnell--a family man desperate to get enough money to buy a house in a better area to benefit his family's well-being. He is hired by James (Will Ferrell), a wimpy stock trader who is about to go to prison for 10 years, to prepare him for life behind bars. The catch is that James thinks Darnell is an ex-con--not because Darnell told him that, but because James just assumed.—The Twiz",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Drama"
    ],
    "cast": [
      "Kevin Hart",
      "Alison Brie",
      "James Moses Black",
      "Dan Bakkedahl"
    ],
    "subtitles": []
  },
  {
    "source": "Get.Smart.2008.1080p.BRrip.x264.YIFY.mp4",
    "year": 2008,
    "title": "Get Smart",
    "runtime": 110,
    "rating": 6.5,
    "description": "CONTROL agents Maxwell Smart and 99 travel around the globe to save the world from a plot of terrorism from KAOS. Along the way, both agents learn about life and other things from each other that could them in the future. They also meet other people along the way that could help them save the world.—RECB3",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Romance",
      "Thriller"
    ],
    "cast": [
      "Kevin Nealon",
      "Anne Hathaway",
      "Dwayne Johnson",
      "Geoff Pierson"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Ghosted.2023.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2023,
    "title": "Ghosted",
    "runtime": 116,
    "rating": 5.8,
    "description": "Salt-of-the-earth Cole falls head over heels for enigmatic Sadie -- but then makes the shocking discovery that she's a secret agent. Before they can decide on a second date, Cole and Sadie are swept away on an international adventure to save the world.—Apple TV",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Ana de Armas",
      "Chris Evans",
      "Ryan Reynolds",
      "Sebastian Stan"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Good.Fortune.2025.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2025,
    "title": "Good Fortune",
    "runtime": 97,
    "rating": 6.7,
    "description": "A well-meaning but rather inept angel named Gabriel meddles in the lives of a struggling gig worker and a wealthy capitalist.",
    "categories": [
      "Action",
      "Comedy",
      "Fantasy",
      "Romance"
    ],
    "cast": [],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Guardians.of.the.Galaxy.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "Guardians of the Galaxy",
    "runtime": 121,
    "rating": 8,
    "description": "After stealing a mysterious orb in the far reaches of outer space, Peter Quill from Earth is now the main target of a manhunt led by the villain known as Ronan the Accuser. To help fight Ronan and his team and save the galaxy from his power, Quill creates a team of space heroes known as the \"Guardians of the Galaxy\" to save the galaxy.—James Hake",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Sci-Fi"
    ],
    "cast": [
      "Vin Diesel",
      "Zoe Saldana",
      "Nathan Fillion",
      "Melia Kreiling"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Guardians.Of.The.Galaxy.Vol..2.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "Guardians of the Galaxy Vol. 2",
    "runtime": 136,
    "rating": 7.6,
    "description": "After saving Xandar from Ronan's wrath, the Guardians are now recognized as heroes. Now the team must help their leader, Star Lord, uncover the truth behind his true heritage. Along the way, old foes turn to allies and betrayal is blooming. And the Guardians find they are up against a devastating new menace who is out to rule the galaxy.—Blazer346",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Sci-Fi"
    ],
    "cast": [
      "Vin Diesel",
      "Sylvester Stallone",
      "Zoe Saldana",
      "Jeff Goldblum"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Guardians.Of.The.Galaxy.Vol3.2023.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2023,
    "title": "Guardians of the Galaxy Vol. 3",
    "runtime": 150,
    "rating": 7.9,
    "description": "In Marvel Studios \"Guardians of the Galaxy Vol. 3\" our beloved band of misfits are looking a bit different these days. Peter Quill, still reeling from the loss of Gamora, must rally his team around him to defend the universe along with protecting one of their own. A mission that, if not completed successfully, could quite possibly lead to the end of the Guardians as we know them.—Marvel Studios",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Sci-Fi"
    ],
    "cast": [
      "Vin Diesel",
      "Sylvester Stallone",
      "Zoe Saldana",
      "Linda Cardellini"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Hall.Pass.2011.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2011,
    "title": "Hall Pass",
    "runtime": 105,
    "rating": 5.9,
    "description": "A couple of married men are always looking at other women. Their wives are fed up with their behavior, and grant them a 'hall pass': a week off their marriage allowing them to do anything. But the guys take their time and their week is almost up. What they don't realize is that at the same time their wives make connections of their own.—rcso411@yahoo.com",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Alexandra Daddario",
      "Derek Waters",
      "Owen Wilson",
      "Jason Sudeikis"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Harold.Kumar.Go.To.White.Castle.2004.UNRATED.REPACK.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2004,
    "title": "Harold & Kumar Go to White Castle",
    "runtime": 88,
    "rating": 7,
    "description": "Harold Lee and Kumar Patel are two stoners who end up getting the munchies. What they crave the most after seeing a TV advertisement, is a trip to White Castle. So from here, follows a journey for the burgers they require. On their way they will encounter many obstacles including a raccoon, a racist officer, and a horny Neil Patrick Harris.—Film_Fan",
    "categories": [
      "Action",
      "Adventure",
      "Comedy"
    ],
    "cast": [
      "Ryan Reynolds",
      "Malin Akerman",
      "Rob Tinkler",
      "Ethan Embry"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Horrible.Bosses.2.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "Horrible Bosses 2",
    "runtime": 108,
    "rating": 6.3,
    "description": "Fed up with answering to higher-ups, Nick, Dale and Kurt decide to become their own bosses by launching their own business. But a slick investor soon pulls the rug out from under them. Outplayed and desperate, and with no legal recourse, the three would-be entrepreneurs hatch a misguided plan to kidnap the investor's adult son and ransom him to regain control of their company.—SantaClaus",
    "categories": [
      "Action",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Rob Huebel",
      "Lindsay Sloane",
      "Jason Bateman",
      "Christoph Waltz"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Horrible.Bosses.2011.1080p.BluRay.x264.YIFY.mp4",
    "year": 2011,
    "title": "Horrible Bosses",
    "runtime": 98,
    "rating": 6.9,
    "description": "Nick hates his boss, mostly because he's expected to work from before sunrise to after sunset and his boss, Mr. Harken, calls him out for being a minute late and blackmails him so he can't quit. Dale hates his boss, Dr. Julia Harris, because she makes unwelcome sexual advances when he's about to get married. But Dale is on that pesky list of child-offenders so he can't quit. Kurt actually likes his job and his boss--well, up until his boss dies and the boss's coked-out, psychopathic son takes over. But who would be crazy enough to quit their jobs in such poor economic times? Instead, Nick, Dale, and Kurt drunkenly and hypothetically discuss how to kill their bosses, and before they know it, they've hired a murder consultant to help them pull off the three deeds.—napierslogs",
    "categories": [
      "Action",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Colin Farrell",
      "Ryan Gosling",
      "Lindsay Sloane",
      "Jason Bateman"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Hot.Fuzz.2007.1080p.BRrip.x264.GAZ.YIFY.mp4",
    "year": 2007,
    "title": "Hot Fuzz",
    "runtime": 121,
    "rating": 7.8,
    "description": "Top London cop PC Nicholas Angel is good. Too good. To stop the rest of his team looking bad, he is reassigned to the quiet town of Sandford. He is paired with Danny Butterman, who endlessly questions him on the action lifestyle. Everything seems quiet for Angel until two actors are found decapitated. It is called an accident, but Angel won't accept that, especially when more and more people turn up dead. Angel and Danny clash with everyone while they try to uncover the truth behind the mystery of the apparent \"accidents\".—Film_Fan",
    "categories": [
      "Action",
      "Comedy",
      "Mystery",
      "Thriller"
    ],
    "cast": [
      "Olivia Colman",
      "Cate Blanchett",
      "Bill Nighy",
      "David Bradley"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Hot.Tub.Time.Machine.2.2015.1080p.BluRay.x264.YIFY.mp4",
    "year": 2015,
    "title": "Hot Tub Time Machine 2",
    "runtime": 93,
    "rating": 5,
    "description": "When Lou gets killed, Nick and Jacob fire up the hot tub time machine to get back to the past, but they inadvertently land in the future with Adam Jr. Now they have to alter the future in order to save the past, which is really the present.—Movie Guy",
    "categories": [
      "Action",
      "Comedy",
      "Mystery",
      "Sci-Fi"
    ],
    "cast": [
      "Christian Slater",
      "Kellee Stewart",
      "John Cusack",
      "Adam Scott"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Hot.Tub.Time.Machine.2010.1080p.BrRip.x264.BOKUTOX.YIFY.mp4",
    "year": 2010,
    "title": "Hot Tub Time Machine",
    "runtime": 99,
    "rating": 6.4,
    "description": "Three friends on losing streaks: Adam, whose girlfriend dumped him, Nick, with a dead-end job and a cheating wife, and Lou, a suicidal alcoholic. To help Lou recover from car-exhaust poisoning, Adam and Nick, with Adam's nephew Jacob, go to a winter resort that was their old party place. It's now a dump, but the lads rally for a night of drinking in the hot tub. Somehow, the hot tub takes them back to 1986, on a fateful night for each of them. Maybe if they do everything the same way they did that night, they'll get back to the future so Jacob can be born. There are serious temptations to do things differently. Will they make it back to their sorry lives? And what about Jacob?—",
    "categories": [
      "Action",
      "Comedy",
      "Sci-Fi"
    ],
    "cast": [
      "Eddie Murphy",
      "Sebastian Stan",
      "Kellee Stewart",
      "Lizzy Caplan"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Ice.Age.2002.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2002,
    "title": "Ice Age",
    "runtime": 81,
    "rating": 7.5,
    "description": "Back when the Earth was being overrun by glaciers, and animals were scurrying to save themselves from the upcoming Ice Age, a sloth named Sid, a woolly mammoth named Manny, and a saber-toothed tiger named Diego are forced to become unlikely heroes. The three reluctantly come together when they have to return a human child to its father while braving the deadly elements of the impending Ice Age.—Anna",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "History"
    ],
    "cast": [
      "Jack Black",
      "Dann Fink",
      "Michael Bell",
      "Danny Mann"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Ice.Age.Continental.Drift.2012.1080p.BluRay.x264.YIFY.mp4",
    "year": 2012,
    "title": "Ice Age: Continental Drift",
    "runtime": 88,
    "rating": 6.5,
    "description": "When Scrat accidentally provokes a continental cataclysm with a storm, Manny is separated from Ellie and Peaches on an iceberg with Diego, Sid and Granny but he promises that he will find a way to return home. While crossing the ocean, they are captured by the cruel pirate Captain Gutt and his crew. However they escape and Manny plots a plan to steal Captain Gutt's ship and return to his homeland in a dangerous voyage through the sea. But the cruel pirates seek revenge against Manny and his family and friends.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Drama",
      "Family",
      "Fantasy",
      "History"
    ],
    "cast": [
      "Keke Palmer",
      "Peter Dinklage",
      "Seann William Scott",
      "Alan Tudyk"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Ice.Age.Dawn.Of.The.Dinosaurs.2009.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2009,
    "title": "Ice Age: Dawn of the Dinosaurs",
    "runtime": 0,
    "rating": 6.6,
    "description": "Times are changing for Manny the moody mammoth, Sid the motor mouthed sloth and Diego the crafty saber-toothed tiger. Life heats up for our heroes when they meet some new and none-too-friendly neighbors – the mighty dinosaurs.",
    "categories": [
      "Action",
      "Adventure",
      "Family"
    ],
    "cast": [
      "James Arnold Taylor",
      "John Leguizamo",
      "Nolan North",
      "Queen Latifah"
    ],
    "subtitles": []
  },
  {
    "source": "Ice.Age.The.Meltdown.2006.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2006,
    "title": "Ice Age: The Meltdown",
    "runtime": 91,
    "rating": 6.8,
    "description": "Manny the woolly mammoth, Sid the sloth, Diego the saber-toothed tiger, and the hapless prehistoric squirrel/rat known as Scrat are still together and enjoying the perks of their now melting world. Manny may be ready to start a family, but nobody has seen another mammoth for a long time; Manny thinks he may be the last one. That is, until he miraculously finds Ellie, the only female mammoth left in the world. Their only problems: They can't stand each other--and Ellie somehow thinks she's a possum! Ellie comes with some excess baggage in the form of her two possum \"brothers\"-- Crash and Eddie, a couple of daredevil pranksters and cocky, loud-mouthed troublemakers. Manny, Sid and Diego quickly learn that the warming climate has one major drawback: A huge glacial dam holding off oceans of water is about to break, threatening the entire valley. The only chance of survival lies at the other end of the valley. So our three heroes, along with Ellie, Crash and Eddie, form the most unlikely family--in any \"Age\"-- as they embark on a mission across an ever-changing, increasingly dangerous landscape towards their salvation.—gavin (gunmasterM@hotmail.com)",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "History"
    ],
    "cast": [
      "Frank Welker",
      "Danny Mann",
      "Madeleine Martin",
      "Seann William Scott"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Identity.Thief.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "Identity Thief",
    "runtime": 111,
    "rating": 5.7,
    "description": "Sandy Patterson (Jason Bateman) gets a nice call confirming his name and other identifying information. The next thing he knows, a spa in Florida is reminding him of his appointment and his credit cards are maxed out. With his identity stolen, Sandy leaves his wife, kids and job to literally bring the thief to justice in Colorado. Keeping tabs on the other Sandy (Melissa McCarthy) and run-ins with bounty hunters is harder than he was expecting, and ultimately the cross-country trip is going to find both Sandys learning life tips from one another.—napierslogs",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Crime",
      "Drama",
      "Thriller"
    ],
    "cast": [
      "Jason Bateman",
      "Robert Patrick",
      "Jon Favreau",
      "Jonathan Banks"
    ],
    "subtitles": []
  },
  {
    "source": "Inception.2010.1080p.BrRip.x264.YIFY.mp4",
    "year": 2010,
    "title": "Inception",
    "runtime": 148,
    "rating": 8.8,
    "description": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible, inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea, but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming.—Warner Bros. Pictures",
    "categories": [
      "Action",
      "Adventure",
      "Crime",
      "Mystery",
      "Sci-Fi",
      "Thriller"
    ],
    "cast": [
      "Tom Hardy",
      "Leonardo DiCaprio",
      "Michael Caine",
      "Cillian Murphy"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Incredibles.2.2018.1080p.BluRay.x264-[YTS.AM].mp4",
    "year": 2018,
    "title": "Incredibles 2",
    "runtime": 118,
    "rating": 7.5,
    "description": "While the Parr family has accepted its collective calling as superheroes, the fact remains that their special heroism is still illegal. After they are arrested after unsuccessfully trying to stop the Underminer, their future seems bleak. However, the wealthy Deavor siblings of Devtech offer new hope with a bold project to rehabilitate the public image and legal status of Supers, with Elastigirl being assigned on point to be the shining example. Having agreed for now to stay home to look after the kids, Mr. Incredible finds domestic life a daunting challenge, especially when baby Jack-Jack's newly-emerged powers make him almost impossible to manage. However, Elastigirl has her own concerns dealing with the menace of a new supervillain, Screenslaver, who is wreaking havoc with his mind-control abilities. Elastigirl must solve the mystery of this enemy who has malevolent designs on the world, with the Parr family and friends key targets of this evil.—Kenneth Chisholm (kchishol@rogers.com)",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Sci-Fi",
      "Thriller"
    ],
    "cast": [
      "Samuel L. Jackson",
      "Jere Burns",
      "Jonathan Banks",
      "Danny Mann"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Interstellar.2014.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "Interstellar",
    "runtime": 169,
    "rating": 8.7,
    "description": "Earth's future has been riddled by disasters, famines, and droughts. There is only one way to ensure mankind's survival: Interstellar travel. A newly discovered wormhole in the far reaches of our solar system allows a team of astronauts to go where no man has gone before, a planet that may have the right environment to sustain human life.—ahmetkozan",
    "categories": [
      "Action",
      "Adventure",
      "Drama",
      "Sci-Fi",
      "Thriller"
    ],
    "cast": [
      "Matt Damon",
      "Michael Caine",
      "Anne Hathaway",
      "Jessica Chastain"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Iron.Man.2.2010.1080p.BrRip.x264.YIFY.mp4",
    "year": 2010,
    "title": "Iron Man 2",
    "runtime": 0,
    "rating": 6.9,
    "description": "With the world now aware of his dual life as the armored superhero Iron Man, billionaire inventor Tony Stark faces pressure from the government, the press, and the public to share his technology with the military. Unwilling to let go of his invention, Stark, along with Pepper Potts, and James \"Rhodey\" Rhodes at his side, must forge new alliances - and confront powerful enemies.—Anonymous",
    "categories": [
      "Action",
      "Adventure",
      "Sci-Fi"
    ],
    "cast": [
      "Scarlett Johansson",
      "Samuel L. Jackson",
      "Robert Downey Jr.",
      "Kate Mara"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Iron.Man.2008.1080p.BrRip.x264.YIFY.mp4",
    "year": 2008,
    "title": "Iron Man",
    "runtime": 126,
    "rating": 7.9,
    "description": "Tony Stark. Genius, billionaire, playboy, philanthropist. Son of legendary inventor and weapons contractor Howard Stark. When Tony Stark is assigned to give a weapons presentation to an Iraqi unit led by Lt. Col. James Rhodes, he's given a ride on enemy lines. That ride ends badly when Stark's Humvee that he's riding in is attacked by enemy combatants. He survives - barely - with a chest full of shrapnel and a car battery attached to his heart. In order to survive he comes up with a way to miniaturize the battery and figures out that the battery can power something else. Thus Iron Man is born. He uses the primitive device to escape from the cave in Iraq. Once back home, he then begins work on perfecting the Iron Man suit. But the man who was put in charge of Stark Industries has plans of his own to take over Tony's technology for other matters.—halo1k",
    "categories": [
      "Action",
      "Adventure",
      "Sci-Fi"
    ],
    "cast": [
      "Samuel L. Jackson",
      "Robert Downey Jr.",
      "Jeff Bridges",
      "Jon Favreau"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Iron.Man.3.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "Iron Man 3",
    "runtime": 130,
    "rating": 7.1,
    "description": "Marvel's \"Iron Man 3\" pits brash-but-brilliant industrialist Tony Stark/Iron Man against an enemy whose reach knows no bounds. When Stark finds his personal world destroyed at his enemy's hands, he embarks on a harrowing quest to find those responsible. This journey, at every turn, will test his mettle. With his back against the wall, Stark is left to survive by his own devices, relying on his ingenuity and instincts to protect those closest to him. As he fights his way back, Stark discovers the answer to the question that has secretly haunted him: does the man make the suit or does the suit make the man?—Jawadjee",
    "categories": [
      "Action",
      "Adventure",
      "Sci-Fi"
    ],
    "cast": [
      "Jenna Ortega",
      "Bingbing Fan",
      "Robert Downey Jr.",
      "Mark Ruffalo"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "John.Wick.2014.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2014,
    "title": "John Wick",
    "runtime": 101,
    "rating": 7.5,
    "description": "With the untimely death of his beloved wife still bitter in his mouth, John Wick, the expert former assassin, receives one final gift from her--a precious keepsake to help John find a new meaning in life now that she is gone. But when the arrogant Russian mob prince, Iosef Tarasov, and his men pay Wick a rather unwelcome visit to rob him of his prized 1969 Mustang and his wife's present, the legendary hitman will be forced to unearth his meticulously concealed identity. Blind with revenge, John will immediately unleash a carefully orchestrated maelstrom of destruction against the sophisticated kingpin, Viggo Tarasov, and his family, who are fully aware of his lethal capacity. Now, only blood can quench the boogeyman's thirst for retribution.—Nick Riganas",
    "categories": [
      "Action",
      "Crime",
      "Thriller"
    ],
    "cast": [
      "Keanu Reeves",
      "Elizabeth Saint",
      "Willem Dafoe",
      "Ian McShane"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "John.Wick.Chapter.2.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "John Wick: Chapter 2",
    "runtime": 122,
    "rating": 7.4,
    "description": "Bound by an inescapable blood debt to the Italian crime lord, Santino D'Antonio, and with his precious 1969 Mustang stolen, John Wick--the taciturn and pitiless assassin who thirsts for seclusion--is forced to visit Italy to honour his promise. But, soon, the Bogeyman will find himself dragged into an impossible task in the heart of Rome's secret criminal society, as every killer in the business dreams of cornering the legendary Wick who now has an enormous price on his head. Drenched in blood and mercilessly hunted down, John Wick can surely forget a peaceful retirement as no one can make it out in one piece.—Nick Riganas",
    "categories": [
      "Action",
      "Crime",
      "Thriller"
    ],
    "cast": [
      "Keanu Reeves",
      "Ian McShane",
      "David Patrick Kelly",
      "Peter Stormare"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "John.Wick.Chapter.3.-.Parabellum.2019.1080p.BluRay.x264-[YTS.LT].mp4",
    "year": 2019,
    "title": "John Wick: Chapter 3 - Parabellum",
    "runtime": 130,
    "rating": 7.4,
    "description": "In this third installment of the adrenaline-fueled action franchise, skilled assassin John Wick (Keanu Reeves) returns with a $14 million price tag on his head and an army of bounty-hunting killers on his trail. After killing a member of the shadowy international assassin's guild, the High Table, John Wick is excommunicado, but the world's most ruthless hit men and women await his every turn.",
    "categories": [
      "Action",
      "Crime",
      "Drama",
      "Thriller"
    ],
    "cast": [
      "Keanu Reeves",
      "Halle Berry",
      "Ian McShane",
      "Laurence Fishburne"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "John.Wick.Chapter.4.2023.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2023,
    "title": "John Wick: Chapter 4",
    "runtime": 169,
    "rating": 7.6,
    "description": "Condemned by the tyrannical High Table to be on the run for the rest of his life, deadly assassin maestro John Wick (2014) embarks on a Sisyphean mission of suicidal fury to decide his fate after the merciless carnage in John Wick: Chapter 3 - Parabellum (2019). At last, John's violent journey, fuelled by vengeance and grief, ultimately leads him to a fateful confrontation with his former employers, the crime masters that forced him into exile. And as the blood-stained vendetta to destroy those who pull the strings continues, old companions face the brutal consequences of friendship, and all-powerful, well-connected adversaries emerge to bring Wick's head on a platter. But talk is cheap--now guns have the final say. Baba Yaga, the grim messiah of death, must make every bullet count in this bloody, once-and-for-all struggle for freedom.—Nick Riganas",
    "categories": [
      "Action",
      "Crime",
      "Thriller"
    ],
    "cast": [
      "Keanu Reeves",
      "Bill Skarsgård",
      "Clancy Brown",
      "Scott Adkins"
    ],
    "subtitles": []
  },
  {
    "source": "Johnny.English.2003.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2003,
    "title": "Johnny English",
    "runtime": 87,
    "rating": 6.3,
    "description": "When a funeral of a British spy is attacked, all of the remaining spies are killed. Only one spy is left and is now Britain's last hope. Johnny English and his sidekick, Bough have been assigned the case of investigating the theft of the British Crown Jewels. The prime suspect is a mysterious French entrepreneur, known as Pascal Sauvage. English and Bough soon find out the horrifying truth behind the theft and Sauvage, but it's not going to be an easy job to bring him to justice.—FilmFanUK",
    "categories": [
      "Action",
      "Adventure",
      "Comedy"
    ],
    "cast": [
      "Prunella Scales",
      "Peter Howitt",
      "Ben Miller",
      "John Malkovich"
    ],
    "subtitles": []
  },
  {
    "source": "Johnny.English.Reborn.2011.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2011,
    "title": "Johnny English Reborn",
    "runtime": 101,
    "rating": 6.3,
    "description": "Johnny English, the accidental secret agent who doesn't know fear or danger and the most unlikely intelligence officer in Her Majesty's Secret Service, must stop a group of international assassins before they eliminate a world leader and cause global chaos. In the years since MI7's top spy vanished off the grid, he has been honing his unique skills in a remote region of Asia. But when his agency superiors learn of an attempt against the Chinese Premier's life, they must hunt down the highly unorthodox agent. Now that the world needs him once again, Johnny English is back in action. With one shot at redemption, he must employ the latest in hi-tech gadgets to unravel a web of conspiracy that runs throughout the K.G.B., C.I.A., and even MI7. With a mere few days until a heads of state conference, one man must use every trick in his playbook to protect us all. For Johnny English, disaster may be an option, but failure never is.—Universal Pictures",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Crime",
      "Drama"
    ],
    "cast": [
      "Rosamund Pike",
      "Courtney Wu",
      "Benedict Wong",
      "Stephen Campbell Moore"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Johnny.English.Strikes.Again.2018.1080p.BluRay.x264-[YTS.AM].mp4",
    "year": 2018,
    "title": "Johnny English Strikes Again",
    "runtime": 89,
    "rating": 6.2,
    "description": "A cyber-attack reveals the identity of all active undercover agents in Britain, leaving Johnny English (Rowan Atkinson) as the Secret Service's last hope. Called out of retirement, English dives head first into action with the mission to find the mastermind hacker. As a man with few skills and analogue methods, Johnny English must overcome the challenges of modern technology to make this mission a success.",
    "categories": [
      "Action",
      "Adventure",
      "Comedy"
    ],
    "cast": [
      "Emma Thompson",
      "Charles Dance",
      "Olga Kurylenko",
      "Ben Miller"
    ],
    "subtitles": []
  },
  {
    "source": "Jumanji.The.Next.Level.2019.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2019,
    "title": "Jumanji: The Next Level",
    "runtime": 123,
    "rating": 6.6,
    "description": "The gang is back but the game has changed. As they return to Jumanji to rescue one of their own, they discover that nothing is as they expect. The players will have to brave parts unknown and unexplored, from the arid deserts to the snowy mountains, in order to escape the world's most dangerous game.",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Fantasy"
    ],
    "cast": [
      "Jack Black",
      "Dwayne Johnson",
      "Kevin Hart",
      "Colin Hanks"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Jumanji.Welcome.To.The.Jungle.2017.1080p.BluRay.x264-[YTS.AM].mp4",
    "year": 2017,
    "title": "Jumanji: Welcome to the Jungle",
    "runtime": 119,
    "rating": 7,
    "description": "In a brand-new Jumanji adventure, four high-school kids discover an old video-game console and are drawn into the game's jungle setting, literally becoming the adult avatars they chose. What they discover is that you don't just play Jumanji--you must survive it. To beat the game and return to the real world, they must go on the most dangerous adventure of their lives, discover what Alan Parrish left 20 years ago, and change the way they think about themselves --or they'll be stuck in the game forever, to be played by others without break.—Sony Pictures",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Fantasy"
    ],
    "cast": [
      "Jack Black",
      "Dwayne Johnson",
      "Kevin Hart",
      "Tim Matheson"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Just.Go.With.It.2011.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2011,
    "title": "Just Go with It",
    "runtime": 117,
    "rating": 6.4,
    "description": "Danny (Adam Sandler) must engage Katherine (Jennifer Aniston), his faithful assistant, to pretend to be his soon to be ex-wife. Danny must pretend that he is married, because he lied to his dream girl, Palmer (Brooklyn Decker) the most gorgeous woman in the world. To keep the woman he loves, covering up one lie soon turns into many lies.—Douglas Young (the-movie-guy)",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Nicole Kidman",
      "Kevin Nealon",
      "Minka Kelly",
      "Vanessa Eichholz"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Karate.Kid.Legends.2025.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2025,
    "title": "Karate Kid: Legends",
    "runtime": 94,
    "rating": 6.3,
    "description": "After a family tragedy, kung fu prodigy Li Fong is uprooted from his home in Beijing and forced to move to New York City with his mother. When a new friend needs his help, Li enters a karate competition - but his skills alone aren't enough. Li's kung fu teacher Mr. Han enlists original Karate Kid Daniel LaRusso for help, and Li learns a new way to fight, merging their two styles into one for the ultimate martial arts showdown.",
    "categories": [
      "Action",
      "Drama",
      "Family",
      "Sport"
    ],
    "cast": [
      "Jackie Chan",
      "Joshua Jackson",
      "Marcus Aurelio",
      "William Zabka"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Keeping.Up.With.The.Joneses.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Keeping Up with the Joneses",
    "runtime": 105,
    "rating": 5.9,
    "description": "Jeff Gaffney (Zach Galifianakis) works at the McDowell-Burton International (MBI) as Human Resources and lives with his wife, Karen (Isla Fisher) and two children, who are away at sleep-away camp. After the couple buys a new house, located at the Cul-De-Sac under the proprietors of Dan & Meg Craverston (Matt Walsh and Maribeth Monroe), Karen alerts Jeff of the new neighbors, the Joneses couple, Tim and Natalie (Jon Hamm and Gal Gadot), and invites them over to her house to introduce themselves, surprising Jeff upon arriving home from the office.Karen learns that Tim is an accomplished travel writer whose hobbies include blowing glass and Natalie is a social media consultant, cooking blogger and heroine to Sri Lankan orphans. Feeling unconvinced about Natalie, Karen follows her to the mall hoping to discover what she's doing, but Natalie catches Karen in the dressing room. Here, Natalie confronts her, realizing that Karen must be following her. Meanwhile, Tim invites Jeff to the Chinese restaurant to eat, but Jeff feels that getting drunk with a snake wine and being bitten by a severed snake head is not the way to make a friend and that true friendship is having an indoor skydiving experience together.Meanwhile Tim and Natalia break into MBI HQ & find that a suspicious email has been sent using Jeff's computer to an international arms dealer called scorpion.\nBack at their house, Jeff accidentally breaks the glass sculpture made by Tim that was given to them, revealing a bug among the shards. The couple now realize that they have been spied upon the whole time and they decide to sneak to the Joneses' house to find the spying device. Inside the room, they discover that Jeff and the MBI employees are being targeted by the Joneses. However, Jeff, mistaking an item for a pen, accidentally stuns Karen with the pen gun and they narrowly escape just as the Joneses arrive at the house. Natalie notices the pen gun on the floor and that it has been used, suspecting that Gaffneys might have broken into their house.The Gaffneys arrange a meeting with MBI advisor Carl Pronger (Kevin Dunn) to explain the details about the Joneses. But before Carl can disclose further details, he is killed by a sniper who also attacks the Gaffneys. They are rescued by the Joneses and a chase and shootout ensues, killing the masked motorcycle riders. The Gaffneys now learn that the Joneses are the secret agents. Upon entering the house, the Joneses narrowly escape just as a bomb blows up the house. It is revealed that the international arms dealer calling himself \"the Scorpion\" (Patton Oswalt) is trying to take down the Joneses and then kidnap the Craverstons, who are planning to sell the microchips - which could be used to weaken the U.S. missile defense system. Dan reveals that he is the one who used Jeff's computer to email the arms dealer. Jeff then accepts the offer through the Scorpion's phone call, arranging the meeting with his wife at the hotel and takes Dan's cover name, \"Rascal Flatts\", to deliver the microchips.With the Joneses at their back, the Scorpion, whom Jeff helped to relieve the stress by letting him hold the small red ball at the MBI years ago, blows Jeff's cover. With their cover blown, Tim radios for back-up but they pull out due to collateral damage that will be done to the public. Jeff also blows the Scorpion's cover, whose real name is Bruce Springstine. When the Gaffneys and the Joneses are held captive, Karen is able to pass a knife to Natalie by making out with her as a distraction, giving the Joneses an opportunity to kill Bruce's men. They all escape by jumping off the window just as Bruce opens the briefcase containing the chips that blows the bomb, killing him.One summer later, Jeff and Karen visit the Hazim's Cafe in Marrakesh, where the Joneses used to date. They meet the Joneses, who reveal that they have left the agency. However, when four men, who might be working for another agency to track them down wearing fezzes, are seen looking at them, the Joneses engage in a gunfight with the four men, not showing the actual occurrence.",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Isla Fisher",
      "Gal Gadot",
      "Jon Hamm",
      "Zach Galifianakis"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Kick-Ass.2.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "Kick-Ass 2",
    "runtime": 103,
    "rating": 6.5,
    "description": "After Kick-Ass' insane bravery inspires a new wave of self-made masked crusaders, led by the badass Colonel Stars and Stripes, our hero joins them on patrol. When these amateur superheroes are hunted down by Red Mist -- reborn as The Mother F%&*^r -- only the blade-wielding Hit Girl can prevent their annihilation. When we last saw junior assassin Hit Girl and young vigilante Kick-Ass, they were trying to live as normal teenagers Mindy and Dave. With graduation looming and uncertain what to do, Dave decides to start the world's first superhero team with Mindy. Unfortunately, when Mindy is busted for sneaking out as Hit Girl, she's forced to retire, leaving her to navigate the terrifying world of high-school mean girls on her own. With no one left to turn to, Dave joins forces with Justice Forever, run by a born-again ex-mobster named Colonel Stars and Stripes. Just as they start to make a real difference on the streets, the world's first super villain, The Mother F%&*^r, assembles his own evil league and puts a plan in motion to make Kick-Ass and Hit Girl pay for what they did to his dad. There's only one problem with his scheme: If you mess with one member of Justice Forever, you mess with them all.—Universal Pictures",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Crime",
      "Drama",
      "Thriller"
    ],
    "cast": [
      "Jim Carrey",
      "Chloë Grace Moretz",
      "Ella Purnell",
      "Benedict Wong"
    ],
    "subtitles": []
  },
  {
    "source": "Kick-Ass.2010.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2010,
    "title": "Kick-Ass",
    "runtime": 117,
    "rating": 7.6,
    "description": "Dave Lizewski is an unnoticed high school student and comic book fan with a few friends and who lives alone with his father. His life is not very difficult and his personal trials not that overwhelming; however, one day he makes the simple decision to become a super-hero, even though he has no powers or training.—Daniel J. Leary",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Chloë Grace Moretz",
      "Evan Peters",
      "Nicolas Cage",
      "Johnny Hopkins"
    ],
    "subtitles": []
  },
  {
    "source": "Killers.2010.1080p.BrRip.x264.YIFY.mp4",
    "year": 2010,
    "title": "Killers",
    "runtime": 100,
    "rating": 5.5,
    "description": "Spencer Aimes is just your average, undercover, government-hired super-assassin accustomed to a life of exotic European locales, flashy sports cars and even flashier women. But when he meets Jen Kornfeldt, a beautiful, fun-loving computer tech recovering from a bad break-up, he finds true love...and happily trades international intrigue for domestic bliss. Three years later, Spencer and Jen are still enjoying a picture-perfect marriage - that is, until the morning after Spencer's 30th birthday. That's when Spencer and Jen learn he's the target of a multi-million dollar hit. Even worse, the hired killers have been stalking the happy couple for years, and could be anyone: friends, neighbors, the grocery store clerk, even that crabby old guy shuffling across the street. Now Spencer and Jen are on the run for their lives. As their suburban paradise turns into a paranoid game of dodge-the-bullet, they must find out who wants Spencer dead and why, all the while trying to save their marriage, manage his in-laws, keep up neighborly appearances ... and just plain survive.—Lionsgate",
    "categories": [
      "Action",
      "Comedy",
      "Romance",
      "Thriller"
    ],
    "cast": [
      "Katheryn Winnick",
      "Michael Daniel Cassady",
      "Tom Selleck",
      "Ashton Kutcher"
    ],
    "subtitles": []
  },
  {
    "source": "Knocked.Up.2007.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2007,
    "title": "Knocked Up",
    "runtime": 129,
    "rating": 6.9,
    "description": "When Alison Scott is promoted in E. Television, she goes to a night-club to celebrate with her older married sister Debbie. Alison meets the pothead reckless Ben Stone and while having a small talk with Ben, Debbie's husband Pete calls her to tell that their daughter has chicken pox. Debbie leaves the place but Alison stays with Ben, drinking and dancing along all night; completely wasted, they end up having a one night stand. Ben does not use a condom and eight weeks later, Alison discovers that she is pregnant. She calls Ben and they decide to try to stay together and have the baby. However, Ben needs to grow up first to raise a family of his own.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "categories": [
      "Action",
      "Comedy",
      "Drama",
      "Romance"
    ],
    "cast": [
      "Jessica Alba",
      "Tim Bagley",
      "Paul Rudd",
      "James Franco"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Kung.Fu.Panda.2008.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2008,
    "title": "Kung Fu Panda",
    "runtime": 92,
    "rating": 7.6,
    "description": "It's the story about a lazy, irreverent slacker panda, named Po, who is the biggest fan of Kung Fu around...which doesn't exactly come in handy while working every day in his family's noodle shop. Unexpectedly chosen to fulfill an ancient prophecy, Po's dreams become reality when he joins the world of Kung Fu and studies alongside his idols, the legendary Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- under the leadership of their guru, Master Shifu. But before they know it, the vengeful and treacherous snow leopard Tai Lung is headed their way, and it's up to Po to defend everyone from the oncoming threat. Can he turn his dreams of becoming a Kung Fu master into reality? Po puts his heart - and his girth - into the task, and the unlikely hero ultimately finds that his greatest weaknesses turn out to be his greatest strengths.—Anthony Pereyra {hypersonic91@yahoo.com}",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Thriller"
    ],
    "cast": [
      "Jackie Chan",
      "Angelina Jolie",
      "Jack Black",
      "Lucy Liu"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Life.As.We.Know.It.2010.1080p.x264.YIFY.mp4",
    "year": 2010,
    "title": "Life as We Know It",
    "runtime": 114,
    "rating": 6.5,
    "description": "Holly and Eric were set up on a blind date by their married friends Peter and Allison, but it didn't go well. After Peter and Allison are killed in an accident, Holly and Eric learn that they have been named as the guardian of their late friends' infant daughter Sophie, so they move into their house and try their best to honor their friends' wishes. But raising a child cramps their style--and they still don't exactly get along.—rcs0411@yahoo.com",
    "categories": [
      "Action",
      "Comedy",
      "Drama",
      "Romance"
    ],
    "cast": [
      "Rob Huebel",
      "Andrew Daly",
      "Jean Smart",
      "Hayes MacArthur"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Madagascar.2005.1080p.BrRip.x264.YIFY.mp4",
    "year": 2005,
    "title": "Madagascar",
    "runtime": 86,
    "rating": 6.9,
    "description": "Longing to roam free in the vast landscapes of Mother Africa, Marty, the bored and dejected zebra of the famous Central Park Zoo, escapes his prison on the night of his tenth birthday celebration. However, after a botched rescue attempt by Marty's companions--Alex, the content lion; Melman, the skittish giraffe, and Gloria, the resolute hippo--the friends will find themselves crated up and shipped off to a remote wildlife preserve, only to end up on the sandy shores of exotic Madagascar. At last, Marty's dream will come true; nevertheless, what does it really mean to be a truly wild animal?—Nick Riganas",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy"
    ],
    "cast": [
      "Ben Stiller",
      "Michael Bell",
      "Danny Mann",
      "Andy Richter"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Madagascar.3.Europes.Most.Wanted.2012.1080p.BRrip.x264.YIFY.mp4",
    "year": 2012,
    "title": "Madagascar 3: Europe's Most Wanted",
    "runtime": 93,
    "rating": 6.8,
    "description": "Alex, Marty, Gloria and Melman are still trying to get back to the Big Apple and their beloved Central Park zoo, but first they need to find the penguins. When they travel to Monte Carlo, they attract the attention of Animal Control after gate crashing a party and are joined by the penguins, King Julian and Co., and the monkeys. How do a lion, a zebra, a hippo, a giraffe, four penguins, two monkeys, and three lemurs travel through Europe without attracting attention and get back to New York? They join a traveling circus. Their attempts to get back to New York are consistently hampered by the Captain of Animal Control who wants to make Alex part of her collection. Once they make it back to New York, Marty, Alex, Gloria, and Melman realize that they want to be part of the traveling circus.—Anonymous",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family"
    ],
    "cast": [
      "Jessica Chastain",
      "Frank Welker",
      "Ben Stiller",
      "Danny Jacobs"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Madagascar.Escape.2.Africa.2008.1080p.BRrip.x264.YIFY.mp4",
    "year": 2008,
    "title": "Madagascar: Escape 2 Africa",
    "runtime": 89,
    "rating": 6.7,
    "description": "The sequel to 2005's \"Madagascar\", in which New York Zoo animals, Alex the Lion, Marty the Zebra, Melman the Giraffe and Gloria the Hippo, still stranded on Madagascar, start to leave the island. All of a sudden, they land in the wilderness of Africa, where Alex meets the rest of his family, but has trouble communicating with them after spending so much time at the Central Park Zoo.—rocknrollunderdawg",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family"
    ],
    "cast": [
      "Will.i.am",
      "Ben Stiller",
      "Danny Jacobs",
      "Andy Richter"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Masterminds.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Masterminds",
    "runtime": 95,
    "rating": 5.8,
    "description": "David Ghantt discovers the true meaning of adventure far beyond his wildest dreams. He is an uncomplicated man stuck in a monotonous life. Day in and day out he drives an armored vehicle, transporting millions of other people's money with no escape in sight. The only glimmer of excitement is his flirtatious work crush Kelly Campbell who soon lures him into the scheme of a lifetime. Along with a group of half-brained criminals led by Steve Chambers and an absurdly faulted heist plan, David manages the impossible and makes off with $17 million in cash...only problem is he foolishly hands the money over to this wild group of double crossers and has been set up to take the fall. With the bandits blowing the millions on lavish and ridiculous luxuries, they leave behind a glaring trail of evidence. Now on the lam and in over his head, David must dodge the authorities, evade a hilarious hit man, Mike McKinney, and try to turn the tables on the ones he trusted most.—Relativity",
    "categories": [
      "Action",
      "Biography",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "John Williams",
      "Owen Wilson",
      "Jason Sudeikis",
      "Zach Galifianakis"
    ],
    "subtitles": []
  },
  {
    "source": "Mean.Girls.2004.1080p.BrRip.x264.YIFY.mp4",
    "year": 2004,
    "title": "Mean Girls",
    "runtime": 97,
    "rating": 7.1,
    "description": "Lindsay Lohan stars as Cady Heron, a 16 year old homeschooled girl who not only makes the mistake of falling for Aaron Samuels (Jonathan Bennett), the ex-boyfriend of queenbee Regina George (Rachel McAdams), but also unintentionally joins The Plastics, led by Regina herself. Join Cady as she learns that high school life can and will be really tough.—Bash Cleesattel",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Amanda Seyfried",
      "Rachel McAdams",
      "Jonathan Bennett",
      "Lizzy Caplan"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Meg.2.The.Trench.2023.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2023,
    "title": "Meg 2: The Trench",
    "runtime": 116,
    "rating": 5,
    "description": "Get ready for the ultimate adrenaline rush this summer in \"Meg 2: The Trench,\" a literally larger-than-life thrill ride that supersizes the 2018 blockbuster and takes the action to higher heights and even greater depths with multiple massive Megs and so much more. Dive into uncharted waters with Jason Statham and global action icon Wu Jing as they lead a daring research team on an exploratory dive into the deepest depths of the ocean. Their voyage spirals into chaos when a malevolent mining operation threatens their mission and forces them into a high-stakes battle for survival. Pitted against colossal Megs and relentless environmental plunderers, our heroes must outrun, outsmart, and outswim their merciless predators in a pulse-pounding race against time. Immerse yourself in the most electrifying cinematic experience of the year with \"Meg 2: The Trench\" - where the depths of the ocean are matched only by the heights of sheer, unstoppable excitement.—Warner Bros. Pictures",
    "categories": [
      "Action",
      "Adventure",
      "Horror",
      "Sci-Fi",
      "Thriller"
    ],
    "cast": [
      "Jason Statham",
      "Whoopie Van Raam",
      "Richard Glover",
      "Wu Jing"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Mike.And.Dave.Need.Wedding.Dates.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Mike and Dave Need Wedding Dates",
    "runtime": 98,
    "rating": 6,
    "description": "Mike and Dave are young, adventurous, fun-loving brothers who tend to get out of control at family gatherings. When their sister Jeanie reveals her Hawaiian wedding plans, the rest of the Stangles insist that the brothers bring respectable dates. After placing an ad on Craigslist, the siblings decide to pick Tatiana and Alice, two charming and seemingly normal women. Once they arrive on the island, however, Mike and Dave realize that their companions are ready to get wild and party.",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Zac Efron",
      "Aubrey Plaza",
      "Sam Richardson",
      "Anna Kendrick"
    ],
    "subtitles": []
  },
  {
    "source": "Milf.2010.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2010,
    "title": "Milf",
    "runtime": 88,
    "rating": 3.8,
    "description": "Utterly disappointed by their relationship skills and the ongoing rejection from girls of their own age, a motley quartet of college slackers with raging hormones decide to set their sights on a relatively easier target: the typical sexy and more than willing to help, MILF. After all, mums do know best; however, when an overzealous member engages in a clandestine affair with an off-limits mother, lifelong friendships will be put to the test. Can the boys survive the betrayal?—Nick Riganas",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Robin Jones",
      "Christine Nguyen",
      "Michael Gaglio",
      "Molinee Green"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Minions.2015.1080p.BluRay.x264.YIFY.[YTS.AG].mp4",
    "year": 2015,
    "title": "Minions",
    "runtime": 91,
    "rating": 6.4,
    "description": "Ever since the dawn of time, the Minions have lived to serve the most despicable of masters. From the T-Rex to Napoleon, the easily distracted tribe has helped the biggest and the baddest of villains. Now, join protective leader Kevin, teenage rebel Stuart, and lovable little Bob on a global road trip. They'll earn a shot to work for a new boss, the world's first female supervillain, and try to save all of Minionkind from annihilation.—Universal Pictures",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Crime",
      "Family",
      "Sci-Fi"
    ],
    "cast": [
      "Sandra Bullock",
      "Marion Cotillard",
      "Hiroyuki Sanada",
      "Danny Mann"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Minions.The.Rise.Of.Gru.2022.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2022,
    "title": "Minions: The Rise of Gru",
    "runtime": 87,
    "rating": 6.5,
    "description": "In the heart of the 1970s, amidst a flurry of feathered hair and flared jeans, Gru (Steve Carell) is growing up in the suburbs. A fanboy of a supervillain supergroup known as the Vicious 6, Gru hatches a plan to become evil enough to join them. Luckily, he gets some mayhem-making back-up from his loyal followers, the Minions. Together, Kevin, Stuart, Bob, and Otto - a new Minion sporting braces and a desperate need to please - deploy their skills as they and Gru build their first lair, experiment with their first weapons, and pull off their first missions. When the Vicious 6 oust their leader, legendary fighter Wild Knuckles (Alan Arkin), Gru interviews to become their newest member. It doesn't go well (to say the least), and only gets worse after Gru outsmarts them and suddenly finds himself the mortal enemy of the apex of evil. On the run, Gru will turn to an unlikely source for guidance, Wild Knuckles, and discover that even bad guys need a little help from their friends.—Universal Pictures",
    "categories": [
      "Adventure",
      "Animation",
      "Comedy",
      "Crime",
      "Family",
      "Sci-Fi"
    ],
    "cast": [
      "Jean-Claude Van Damme",
      "Dolph Lundgren",
      "Michelle Yeoh",
      "Steve Carell"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Miss.March.2009.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2009,
    "title": "Miss March",
    "runtime": 90,
    "rating": 5,
    "description": "A young man awakens from a four-year coma to hear that his once virginal high-school sweetheart has since become a centerfold in one of the world's most famous men's magazines. He and his sex-crazed best friend decide to take a cross-country road trip in order to crash a party at the magazine's legendary mansion headquarters and win back the girl.—Anonymous",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "David Wells",
      "Seth Morris",
      "Bonita Friedericy",
      "Chris Gann"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Moana.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Moana",
    "runtime": 107,
    "rating": 7.6,
    "description": "Moana Waialiki is a sea voyaging enthusiast and the only daughter of a chief in a long line of navigators. When her island's fishermen can't catch any fish and the crops fail, she learns that the demigod Maui caused the blight by stealing the heart of the goddess, Te Fiti. The only way to heal the island is to persuade Maui to return Te Fiti's heart, so Moana sets off on an epic journey across the Pacific. The film is based on stories from Polynesian mythology.—Anonymous",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Musical",
      "Thriller"
    ],
    "cast": [
      "Dwayne Johnson",
      "Phillipa Soo",
      "Alan Tudyk",
      "Auli'i Cravalho"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Monsters.Inc.2001.1080p.BrRip.x264.YIFY.mp4",
    "year": 2001,
    "title": "Monsters, Inc.",
    "runtime": 92,
    "rating": 8.1,
    "description": "A city of monsters with no humans called Monstropolis centers around the city's power company, Monsters, Inc. The lovable, confident, tough, furry blue behemoth-like giant monster named James P. Sullivan (better known as Sulley) and his wisecracking best friend, short, green cyclops monster Mike Wazowski, discover what happens when the real world interacts with theirs in the form of a 2-year-old baby girl dubbed \"Boo,\" who accidentally sneaks into the monster world with Sulley one night. And now it's up to Sulley and Mike to send Boo back in her door before anybody finds out, especially two evil villains such as Sulley's main rival as a scarer, chameleon-like Randall (a monster that Boo is very afraid of), who possesses the ability to change the color of his skin, and Mike and Sulley's boss Mr. Waternoose, the chairman and chief executive officer of Monsters, Inc.—Anthony Pereyra {hypersonic91@yahoo.com}",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Horror"
    ],
    "cast": [
      "Frank Welker",
      "Steve Buscemi",
      "Michael Bell",
      "Danny Mann"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Monsters.University.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "Monsters University",
    "runtime": 104,
    "rating": 7.2,
    "description": "Mike Wazowski (Billy Crystal) and James P. \"Sully\" Sullivan (John Goodman) are an inseparable pair, but that wasn't always the case. From the moment these two mismatched monsters met, they couldn't stand each other. This movie unlocks the door to how Mike and Sully overcame their differences and became the best of friends.—Disney/Pixar",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Drama",
      "Family",
      "Fantasy",
      "Horror",
      "Sci-Fi"
    ],
    "cast": [
      "Bobby Moynihan",
      "Aubrey Plaza",
      "Nathan Fillion",
      "Julia Sweeney"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Mr..Peabody.and.Sherman.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "Mr. Peabody & Sherman",
    "runtime": 92,
    "rating": 6.7,
    "description": "Mr. Peabody is a business titan, inventor, scientist, gourmand, two-time Olympic medalist and genius...who also happens to be a dog. Using his most ingenious invention, the WABAC machine, Mr. Peabody and his adopted boy Sherman hurtle back in time to experience world-changing events first-hand and interact with some of the greatest characters of all time. But when Sherman breaks the rules of time travel, our two heroes find themselves in a race to repair history and save the future, while Mr. Peabody may face his biggest challenge yet - being a parent.—Juan Diaz",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Drama",
      "Family",
      "Fantasy",
      "History",
      "Sci-Fi"
    ],
    "cast": [
      "Leslie Mann",
      "Scott Menville",
      "Stanley Tucci",
      "Al Rodrigo"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Mr.Beans.Holiday.2007.1080p.BRrip.x264.GAZ.mp4",
    "year": 2007,
    "title": "Mr. Bean's Holiday",
    "runtime": 90,
    "rating": 6.4,
    "description": "Mr. Bean enters a church raffle and wins a vacation trip to France as well as a camcorder. After boarding a Eurostar train and arriving in Paris, the French language proves a barrier for Bean, as he struggles to get across the city to catch a train to the south of France from the Gare de Lyon. Taking time to order a meal, he finds the consumption of a seafood platter to be a challenge. Just before catching his train, he asks Emil, a Russian film director on his way to be a judge at the Cannes Film festival to use his camcorder to record his boarding, but accidentally causes Emil being left behind at the station. Bean attempts to cheer up the director's son Stepan as the train continues south but matters are made more hectic by the fact that Emil has reported his son to have been kidnapped and Bean losing his wallet and essential travel documents at a pay phone where he and Stepan attempt to contact Emil. Heading in the direction of Cannes, Bean finds himself in the cast and disrupting the flow of a commercial being shot by the egotistical director Carson Clay. He and Stepan finally hitch a ride with the young and vivacious actress Sabine who is heading to Cannes to attend the premiere of Clay's film, in which she appears. After Bean sneaks into the showing, his camcorder images are destined to enliven the proceedings.—Brian Greenhalgh",
    "categories": [
      "Action",
      "Comedy",
      "Family"
    ],
    "cast": [
      "Willem Dafoe",
      "Rowan Atkinson",
      "Karel Roden",
      "Catherine Hosmalin"
    ],
    "subtitles": []
  },
  {
    "source": "Mr.Right.2015.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2015,
    "title": "Mr. Right",
    "runtime": 95,
    "rating": 6.3,
    "description": "After going through a painful break-up, a woman meets a man who appears to be perfect for her. However, as their relationship develops, she learns that he is a former hit-man. Their new, but genuine, relationship is tested even further as they try to save each other, from his dark past which has come back to haunt him.—Anonymous",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Romance"
    ],
    "cast": [
      "Tim Roth",
      "Anna Kendrick",
      "Sam Rockwell",
      "Jimmy Gonzales"
    ],
    "subtitles": []
  },
  {
    "source": "Murder.Mystery.2019.1080p.WEBRip.x264-[YTS.LT].mp4",
    "year": 2019,
    "title": "Murder Mystery",
    "runtime": 97,
    "rating": 6.1,
    "description": "When an NYC cop (Adam Sandler) finally takes his wife (Jennifer Aniston) on a long promised European trip, a chance meeting on the flight gets them invited to an intimate family gathering on the Super Yacht of elderly billionaire Malcolm Quince. When Quince is murdered, they become the prime suspects in a modern day whodunit.—Netflix",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Mystery",
      "Romance"
    ],
    "cast": [
      "Jennifer Aniston",
      "Helena Marie",
      "Simon Sinn",
      "Jackie Sandler"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Neighbors.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "Neighbors",
    "runtime": 97,
    "rating": 6.3,
    "description": "Kelly and Mac are settling down in a quiet neighborhood with their newborn child, until the frat brothers move into the house next door. Teddy is the President, and Pete is his right hand man, and they're quick to accept friendship when Kelly and Mac introduce themselves as the neighbors. Night after night, Mac asks Teddy to lower the fraternity's noise, even accepting the invitation to the party one evening. When Teddy goes back on his word to keep the partying down, Mac calls the police to deal with the problem. The police quickly blame Mac for their presence, and the war begins. As the family feuds with the frat brothers, things get hilariously dangerous and the fraternity ends up on thin ice with their college. After receiving their final warning and being placed on probation, Mac and Kelly pull a prank so ingenious that Teddy and Pete are forced to respond. All hell breaks loose, from Robert DeNiro parties to Christopher Mintz-Plasse having sex in the bushes, this comedy shows how things can go really wrong really quickly when a family and a frat house become neighbors.—Mayor_G",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Zac Efron",
      "Rose Byrne",
      "Dave Franco",
      "Andy Samberg"
    ],
    "subtitles": []
  },
  {
    "source": "No.Hard.Feelings.2023.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2023,
    "title": "No Hard Feelings",
    "runtime": 103,
    "rating": 6.3,
    "description": "Maddie thinks she's found the answer to her financial troubles when she discovers an intriguing job listing: wealthy helicopter parents looking for someone to \"date\" their introverted 19-year-old son, Percy, and bring him out of his shell before he leaves for college. But awkward Percy proves to be more of a challenge than she expected, and time is running out before she loses it all.—Official synopsis",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Kyle Mooney",
      "Jennifer Lawrence",
      "Scott MacArthur",
      "Zahn McClarnon"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "No.Strings.Attached.2011.1080p.BrRip.x264.YIFY.mp4",
    "year": 2011,
    "title": "No Strings Attached",
    "runtime": 108,
    "rating": 6.2,
    "description": "Occasionally in the 15 years since summer camp, Adam and Emma cross paths. When he discovers that an ex-girlfriend is living with his dad, he gets drunk, calls every woman in his cell phone contact list, and ends up passed out naked in her living room. By this time, she's a medical resident in L.A. and he's a gopher on a \"Glee\"-like TV series, hoping to be a writer. She guards her emotions (calling her father's funeral \"a thing\"), so after a quick shag in the moments she has before leaving for the hospital, she asks if he wants a no-strings-attached, sex-only relationship, without romance or complications. A prescription for fun or for disaster?—",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Natalie Portman",
      "Ashton Kutcher",
      "Ophelia Lovibond",
      "Tim Matheson"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Nobody.2.2025.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2025,
    "title": "Nobody 2",
    "runtime": 89,
    "rating": 6.3,
    "description": "Former assassin Hutch Mansell takes his family on a nostalgic vacation to a small-town theme park, only to be pulled back into violence when they clash with a corrupt operator, a crooked sheriff, and a ruthless crime boss.",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Thriller"
    ],
    "cast": [
      "Connie Nielsen",
      "Paisley Cadorath",
      "Sharon Stone",
      "Christopher Lloyd"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Ocean_s.Eight.2018.1080p.BluRay.x264-[YTS.AM].mp4",
    "year": 2018,
    "title": "Ocean's Eight",
    "runtime": 110,
    "rating": 6.3,
    "description": "Following her release from prison, Debbie Ocean, younger sister of the late Danny Ocean, meets with her former partner-in-crime Lou to convince her to join a heist that she planned while serving her sentence. Debbie and Lou assemble the rest of their team: Rose Weil, a disgraced fashion designer who is deeply in debt with the IRS; Amita, a jewelry maker and friend of Debbie's who is eager to move out of her mother's house and start her own life; Nine Ball, a computer hacker; Constance, a street hustler and pickpocket; and Tammy, a profiteer and another friend of Debbie's who has been secretly selling stolen goods out of her family's suburban home. Debbie plans to steal the Toussaint, a $150 million Cartier necklace, from the Met Gala in three-and-a-half weeks, and use Met Gala co-host Daphne Kluger, a famous actress known for her long neck, as an unwitting mule who will wear the necklace into the gala.—mediaknite",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Thriller"
    ],
    "cast": [
      "Dakota Fanning",
      "Anne Hathaway",
      "Sandra Bullock",
      "Amy Robach"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Office.Christmas.Party.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Office Christmas Party",
    "runtime": 105,
    "rating": 5.9,
    "description": "When the CEO (Jennifer Aniston) tries to close her hard-partying brother's branch, he (T.J. Miller) and his Chief Technical Officer (Jason Bateman) must rally their co-workers and host an epic office Christmas party in an effort to impress a potential client and close a sale that will save their jobs.",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Jason Bateman",
      "Jamie Chung",
      "Sam Richardson",
      "Vanessa Bayer"
    ],
    "subtitles": []
  },
  {
    "source": "Old.School.2003.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2003,
    "title": "Old School",
    "runtime": 88,
    "rating": 7,
    "description": "Mitch, Frank and Beanie are disillusioned with their personal lives beginning when Mitch's nymphomaniac girlfriend, Heidi, cheats on him, then former party animal Frank gets married, but unwilling to let go of his wild life, and Beanie is a family man seeking to reclaim his wild and crazy youth. Beanie suggests that they form their own fraternity in Mitch's new house on a college campus to re-live their glory days by bringing together a variety of misfit college students, losers, middle-aged and elderly retirees as their new friends and later try to avoid being evicted by the new Dean of Students, Pritchard, whom still holds a personal grudge against all three of them.—matt-282",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Elisha Cuthbert",
      "Roger Jackson",
      "Sarah Shahi",
      "Jeremy Piven"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Pils.Adventures.2021.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2021,
    "title": "Pil's Adventures",
    "runtime": 89,
    "rating": 6.1,
    "description": "Pil is a spunky vagabond girl living in the medieval city of Foggyborough. One day, while sneaking into the castle, Pil witnesses the sinister Regent Tristain casting a spell on Roland, the heir to the throne. Pil realizes it is now up to her to find a way to reverse the spell and save the prince's life. This daring adventure will turn the entire kingdom upside down and teach Pil that nobility can be found in all of us.",
    "categories": [
      "Adventure",
      "Animation",
      "Family",
      "Fantasy"
    ],
    "cast": [
      "Carlos Mencia",
      "Dalila Bela",
      "Eleanor Noble",
      "Richard Dumont"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Pineapple.Express.UNRATED.2008.1080p.BrRip.x264.YIFY.mp4",
    "year": 2008,
    "title": "Pineapple Express",
    "runtime": 111,
    "rating": 6.9,
    "description": "Lazy court-process clerk and stoner Dale Denton has only one reason to visit his equally lazy dealer Saul Silver: to purchase weed, specifically, a rare new strain called Pineapple Express. But when Dale becomes the only witness to a murder by a crooked cop and the city's most dangerous drug lord, he panics and dumps his roach of Pineapple Express at the scene. Dale now has another reason to visit Saul: to find out if the weed is so rare that it can be traced back to him--and it is. As Dale and Saul run for their lives, they quickly discover that they're not suffering from weed-fueled paranoia: incredibly, the bad guys really are hot on their trail and trying to figure out the fastest way to kill them both. All aboard the Pineapple Express.—Anonymous",
    "categories": [
      "Action",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Nora Dunn",
      "James Franco",
      "James Remar",
      "Amber Heard"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Pirates.of.the.Caribbean.At.Worlds.End.2007.1080p.BrRip.x264.Deceit.YIFY.mp4",
    "year": 2007,
    "title": "Pirates of the Caribbean: At World's End",
    "runtime": 169,
    "rating": 7.1,
    "description": "After losing Jack Sparrow to the locker of Davy Jones, the team of Will Turner, Elizabeth Swan and Captain Barbossa make their final alliances with the pirate world to take on the forces of Lord Cutler Beckett and his crew, including Davy Jones, who he now has control over. It's not going to be easy, as they must rescue Sparrow, convince all the pirate lords to join them and defeats Beckett, whilst each individual pirate has their own route which they wish to follow.—Film_Fan",
    "categories": [
      "Action",
      "Adventure",
      "Family",
      "Fantasy"
    ],
    "cast": [
      "Johnny Depp",
      "Keira Knightley",
      "Bill Nighy",
      "Tom Hollander"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Pirates.of.the.Caribbean.Curse.of.the.Black.Pearl.2003.1080p.BrRip.x264.Deceit.YIFY.mp4",
    "year": 2003,
    "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
    "runtime": 143,
    "rating": 8.1,
    "description": "This swash-buckling tale follows the quest of Captain Jack Sparrow, a savvy pirate, and Will Turner, a resourceful blacksmith, as they search for Elizabeth Swann. Elizabeth, the daughter of the governor and the love of Will's life, has been kidnapped by the feared Captain Barbossa. Little do they know, but the fierce and clever Barbossa has been cursed. He, along with his large crew, are under an ancient curse, doomed for eternity to neither live, nor die. That is, unless a blood sacrifice is made.—the lexster",
    "categories": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "cast": [
      "Johnny Depp",
      "Keira Knightley",
      "Zoe Saldana",
      "Orlando Bloom"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Pirates.of.the.Caribbean.Dead.Mans.Chest.2006.1080p.BrRip.x264.Deceit.YIFY.mp4",
    "year": 2006,
    "title": "Pirates of the Caribbean: Dead Man's Chest",
    "runtime": 151,
    "rating": 7.4,
    "description": "Once again we're plunged into the world of sword fights and \"savvy\" pirates. Captain Jack Sparrow is reminded he owes a debt to Davy Jones, who captains the flying Dutchman, a ghostly ship, with a crew from hell. Facing the \"locker\" Jack must find the heart of Davy Jones but to save himself he must get the help of quick-witted Will Turner and Elizabeth Swann. If that's not complicated enough, Will and Elizabeth are sentenced to hang, unless Will can get Lord Cutler Beckett Jack's compass. Will is forced to join another crazy adventure with Jack.—kate Archie",
    "categories": [
      "Action",
      "Adventure",
      "Crime",
      "Family",
      "Fantasy",
      "History"
    ],
    "cast": [
      "Johnny Depp",
      "Keira Knightley",
      "Bill Nighy",
      "Tom Hollander"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Pirates.Of.The.Caribbean.Dead.Men.Tell.No.Tales.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "Pirates of the Caribbean: Dead Men Tell No Tales",
    "runtime": 129,
    "rating": 6.5,
    "description": "Captain Jack Sparrow (Johnny Depp) finds the winds of ill-fortune blowing even more strongly when deadly ghost pirates led by his old nemesis, the terrifying Captain Salazar (Javier Bardem), escape from the Devil's Triangle, determined to kill every pirate at sea...including him. Captain Jack's only hope of survival lies in seeking out the legendary Trident of Poseidon, a powerful artifact that bestows upon its possessor total control over the seas.—ahmetkozan",
    "categories": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "cast": [
      "Johnny Depp",
      "Keira Knightley",
      "Jacob Elordi",
      "Javier Bardem"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Pirates.of.the.Caribbean.On.Stranger.Tides.2011.1080p.BrRip.x264.Deceit.YIFY.mp4",
    "year": 2011,
    "title": "Pirates of the Caribbean: On Stranger Tides",
    "runtime": 136,
    "rating": 6.6,
    "description": "Captain Jack Sparrow (Johnny Depp) crosses paths with a woman from his past, Angelica (Penélope Cruz), and he's not sure if it's love, or if she's a ruthless con artist who's using him to find the fabled Fountain of Youth. When she forces him aboard the Queen Anne's Revenge, the ship of the formidable pirate Blackbeard (Ian McShane), Jack finds himself on an unexpected adventure in which he doesn't know who to fear more: Blackbeard or the woman from his past.—ahmetkozan",
    "categories": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "cast": [
      "Johnny Depp",
      "Penélope Cruz",
      "Sam Claflin",
      "Ian McShane"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Puss.In.Boots.2011.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2011,
    "title": "Puss in Boots",
    "runtime": 90,
    "rating": 6.6,
    "description": "Years before meeting Shrek and Donkey, the adorable but tricky Puss in Boots must clear his name from all charges making him a wanted fugitive. While trying to steal magic beans from infamous criminals Jack and Jill, the hero crosses paths with his female match, Kitty Softpaws, who leads Puss to his old friend, but now enemy, Humpty Dumpty. Memories of friendship and betrayal enlarges Puss's doubt, but he eventually agrees to help the egg get the magic beans. Together, the three plan to steal the beans, get to the Giant's castle, nab the golden goose, and clear Puss's name.—Mr. Top Hat",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Mystery",
      "Romance"
    ],
    "cast": [
      "Salma Hayek",
      "Antonio Banderas",
      "Jossara Jinaro",
      "Zach Galifianakis"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Puss.In.Boots.The.Last.Wish.2022.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2022,
    "title": "Puss in Boots: The Last Wish",
    "runtime": 102,
    "rating": 7.8,
    "description": "Sadly, Puss in Boots, the undaunted Spanish lover and hero, is now down to the last of his nine lives, a decade after the events of Puss in Boots (2011). And as if that weren't enough, the unstoppable bounty hunter known as The Big Bad Wolf is after him. To restore all of his precious lives and escape an inglorious fate, Puss must pluck up his courage to embark on a dangerous quest into the Dark Forest to find the legendary Wishing Star. However, Puss isn't the only one seeking the map to the magical star. As the daring outlaw puts his skills to good use to stay one step ahead of formidable adversaries determined to get their hands on it, a crucial question arises: Does he have what it takes to face his most skilled and terrifying opponent and get his life back on track?—Nick Riganas",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Mystery",
      "Romance"
    ],
    "cast": [
      "Florence Pugh",
      "Salma Hayek",
      "Olivia Colman",
      "Antonio Banderas"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "R.I.P.D2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "R.I.P.D.",
    "runtime": 96,
    "rating": 5.6,
    "description": "In Boston, the dirty cop Nick hides gold that he has stolen from drug-dealers with his partner Hayes in the backyard of his house. However, on the next morning, Nick tells Hayes that he will deliver the evidence to the police since he loves his wife Julia and he could not face her acting that way. Nick and Hayes are assigned to a raid against a dangerous gang and unexpectedly Hayes kills Nick. Nick is drawn by a tunnel and based on his previous experience in the police department, he is assigned in the afterlife by the Proctor to join the Rest in Peace Department that protects the living world from the undead and work with the old-fashioned agent Roy. Roy and Nick accidentally find that Hayes in plotting a scheme to revert the sense of the tunnel to the afterlife and bring the Apocalypse to Earth.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Crime",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Kevin Bacon",
      "Ryan Reynolds",
      "Jeff Bridges",
      "Mike O'Malley"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Red.Notice.2021.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2021,
    "title": "Red Notice",
    "runtime": 118,
    "rating": 6.3,
    "description": "When an Interpol-issued Red Notice--the highest-level warrant to hunt and capture the world's most wanted--goes out, the FBI's top profiler, John Hartley (Dwayne Johnson), is on the case. His global pursuit lands him smack-dab in the middle of a daring heist where he's forced to partner with the world's greatest art thief, Nolan Booth (Ryan Reynolds), in order to catch the world's most wanted art thief, \"The Bishop\" (Gal Gadot). The high-flying adventure that ensues takes the trio around the world, across the dance floor, trapped in a secluded prison, into the jungle and, worst of all for them, constantly into one another's company.—Netflix",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Crime",
      "Thriller"
    ],
    "cast": [
      "Dwayne Johnson",
      "Gal Gadot",
      "Ryan Reynolds",
      "Ed Sheeran"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Ride.Along.2.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Ride Along 2",
    "runtime": 102,
    "rating": 5.9,
    "description": "The RIDE ALONG 2 sequel picks up about a year after our heroes' last adventure. Plans for a quick trip to Miami go bad. With the wedding upcoming, James reluctantly takes Ben with him to Miami to follow up on a lead connected to a drug ring case he's been trying to crack. In Miami, they meet Maya, a no-BS homicide detective who lets them know Miami is her turf. They also encounter AJ, a shady cocky computer hacker who reveals evidence that implicates a well-respected local businessman, the wealthy Antonio Pope. Pope harbors a vicious streak and rules South Florida's drug trade. If Ben and James can convince the authorities that Pope is a brutal crime boss they'll stop his spree. If they fail, well there may not be a wedding after all.",
    "categories": [
      "Action",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Glen Powell",
      "Kevin Hart",
      "Dwyane Wade",
      "Carlos Gómez"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Ride.Along.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "Ride Along",
    "runtime": 99,
    "rating": 6.1,
    "description": "Ben must prove he is good enough to date cop James' sister, so he volunteers to go on a \"Ride Along\" with him to show that he is not weak and will do whatever he must to get James' approval. But along the way, he runs into some obstacles that he must somehow overcome, and he finds very funny ways.—kcquail",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Romance"
    ],
    "cast": [
      "Kevin Hart",
      "Jay Pharoah",
      "Laurence Fishburne",
      "John Leguizamo"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Rough.Night.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "Rough Night",
    "runtime": 101,
    "rating": 5.2,
    "description": "Five best friends from college reunite 10 years later for a wild bachelorette weekend in Miami. Their hard partying takes a hilariously dark turn when they accidentally kill a male stripper. Amidst the craziness of trying to cover it up, they're ultimately brought closer together when it matters most.",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Thriller"
    ],
    "cast": [
      "Scarlett Johansson",
      "Demi Moore",
      "Paul W. Downs",
      "Enrique Murciano"
    ],
    "subtitles": []
  },
  {
    "source": "Safe.Haven.2013.1080p.BRrip.x264.GAZ.mp4",
    "year": 2013,
    "title": "Safe Haven",
    "runtime": 115,
    "rating": 6.7,
    "description": "When a mysterious young woman named Katie appears in the small North Carolina town of Southport, her sudden arrival raises questions about her past. Beautiful, self-effacing Katie seems determined to avoid forming personal ties until a series of events draws her into two reluctant relationships: one with Alex, a widowed store owner with a kind heart and two young children; and another with her plainspoken single neighbor Jo. Despite her reservations, Katie begins to let down her guard, putting down roots in the close-knit community and becoming increasingly attached to Alex and his family. But even as Katie begins to fall in love, she struggles with the dark, haunting, terrifying secret that set her on a shattering journey across the country to the sheltered oasis of Southport. With Jo's empathetic, stubborn support, Katie eventually realizes that she must choose between a life of transient safety and one of riskier rewards . . . and that in the darkest hour, love is the only true safe haven.—Nicholas Sparks",
    "categories": [
      "Action",
      "Drama",
      "Romance",
      "Thriller"
    ],
    "cast": [
      "Cobie Smulders",
      "Mike Pniewski",
      "Josh Duhamel",
      "Cullen Moss"
    ],
    "subtitles": []
  },
  {
    "source": "Scary.Movie.2.2001.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2001,
    "title": "Scary Movie 2",
    "runtime": 83,
    "rating": 5.4,
    "description": "A group of teens including Cindy Campbell (Anna Faris) and Brenda Meeks (Regina Hall) are invited to spend a night in Hell House. Professor Oldman (Tim Curry) has convinced them it is for a school project, but the night won't go past quietly. Master Kane (Richard Moll) is long dead, but still plans on enjoying himself, especially with Alex Monday (Tori Spelling). When things really start getting bad, the gang must work together to find a way to capture this ghostly menace.—Film_Fan",
    "categories": [
      "Action",
      "Comedy",
      "Horror"
    ],
    "cast": [
      "Tim Curry",
      "Marlon Wayans",
      "Richard Moll",
      "Anna Faris"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Scary.Movie.2000.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2000,
    "title": "Scary Movie",
    "runtime": 88,
    "rating": 6.3,
    "description": "A group of teenagers including Cindy Campbell and Bobby Prinze, accidentally hit a man when driving, and dispose of the body, but now they are being stalked by a very recognisable masked killer. The victim count increases, whilst Cindy must survive the carnage that has she has seen in so many films before.—simon",
    "categories": [
      "Action",
      "Comedy",
      "Mystery"
    ],
    "cast": [
      "Marlon Wayans",
      "Anna Faris",
      "Regina Hall",
      "Lochlyn Munro"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Scary.MoVie.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "Scary Movie 5",
    "runtime": 86,
    "rating": 3.6,
    "description": "Happily-married couple Dan and Jody begin to notice some bizarre activity once they bring their lost nieces and nephew home. But when the chaos expands into Jody's job as a ballet dancer and Dan's career as an Ape researcher, they realize their family is being stalked by a nefarious demon. Together, with the advice of a psychic and the aid of numerous surveillance cameras, they must figure out how to get rid of it before it's too late.—Dimension Films",
    "categories": [
      "Action",
      "Comedy",
      "Horror"
    ],
    "cast": [
      "Audrina Patridge",
      "Kate Walsh",
      "Darrell Hammond",
      "Tyler Posey"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Scary.Movie.3.2003.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2003,
    "title": "Scary Movie 3",
    "runtime": 84,
    "rating": 5.6,
    "description": "A mysterious killer video tape is circulating around. One look at this tape and you have seven days left to live. News Reporter Cindy Campbell (Faris) witnesses this video tape and tries to work out a way to prevent her death. But this is not the only mystery to appear. Crop circles have been appearing in the local farm of Tom (Sheen) and George (Rex). With help from Aunt Shaneequa (Latifah), Cindy suspects that the aliens may be linked with the killer tape and must now work out both mysteries before it's the end of the world.—Film_Fan",
    "categories": [
      "Action",
      "Comedy",
      "Horror"
    ],
    "cast": [
      "Kevin Hart",
      "Anna Faris",
      "D.L. Hughley",
      "Leslie Nielsen"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Scary.Movie.4.2006.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2006,
    "title": "Scary Movie 4",
    "runtime": 83,
    "rating": 5.1,
    "description": "The unemployed Cindy Campbell is hired to work in a cursed house as caretaker of an old lady and meets the ghost of a boy. Meanwhile, the teenager son Robbie and the young daughter Rachel of his next door neighbor and crane operator Tom Ryan are spending the weekend with their loser father. Cindy and Tom meet and fall in love for each other, but when Giant Tripods invade Earth, Tom escapes with Robbie and Rachel; Cindy travels to a village, trying to find the answer to a riddle to save the world; and the president of USA organizes the defense of the planet in UN under his intelligence and leadership.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "categories": [
      "Action",
      "Comedy",
      "Horror"
    ],
    "cast": [
      "Tomoko Sato",
      "Kevin Hart",
      "Anna Faris",
      "Leslie Nielsen"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Scott.Pilgrim.vs.the.World.2010.Bluray.1080p.x264.YIFY.mp4",
    "year": 2010,
    "title": "Scott Pilgrim vs. the World",
    "runtime": 112,
    "rating": 7.5,
    "description": "Scott Pilgrim plays in a band which aspires to success. He dates Knives Chau, a high-school girl five years younger, and he hasn't recovered from being dumped by his former girlfriend, now a success with her own band. When Scott falls for Ramona Flowers, he has trouble breaking up with Knives and tries to romance Ramona. As if juggling two women wasn't enough, Ramona comes with baggage: seven ex-lovers, with each of whom Scott must do battle to the death in order to win Ramona.—Jim Beaver",
    "categories": [
      "Action",
      "Comedy",
      "Fantasy",
      "Romance"
    ],
    "cast": [
      "Chris Evans",
      "Aubrey Plaza",
      "Mary Elizabeth Winstead",
      "Anna Kendrick"
    ],
    "subtitles": []
  },
  {
    "source": "Secretary.2002.1080p.BluRay.x264-[YTS.AM].mp4",
    "year": 2002,
    "title": "Secretary",
    "runtime": 107,
    "rating": 6.9,
    "description": "An emotionally fragile woman recently released from a mental hospital for self mutilation goes to school to gain secretarial skills to gain employment. She has an alcoholic father and a co-dependent mother who are clueless as to who she really is which a tormented soul who really wants to find something with which she can find success. She is a great secretary and finds a job with a unique, old fashioned, but off center in charge boss with a somewhat sadistic sexual proclivity. She grows and evolves and so does he.—kateann1027",
    "categories": [
      "Action",
      "Comedy",
      "Drama",
      "Romance"
    ],
    "cast": [
      "James Spader",
      "Sabrina Grdevich",
      "Jeremy Davies",
      "Ezra Buzzington"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Set.It.Up.2018.1080p.WEBRip.x264-[YTS.AM].mp4",
    "year": 2018,
    "title": "Set It Up",
    "runtime": 105,
    "rating": 6.5,
    "description": "Two young assistants in New York City realize they can make their lives easier by setting up their workaholic bosses to date. While trying to perpetuate this romantic ruse between their nightmare bosses, the assistants realize they themselves might actually be right for each other.",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Glen Powell",
      "Lucy Liu",
      "Zoey Deutch",
      "Jaboukie Young-White"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Sex.Drive.2008.1080p.BluRay.x264.YIFY.mp4",
    "year": 2008,
    "title": "Sex Drive",
    "runtime": 109,
    "rating": 6.5,
    "description": "Ian, a high-school senior in suburban Chicago, is plagued by being a virgin. Online he's inflated his resume, met Ms. Tasty, and agreed to drive to Knoxville, where she promises sex. He steals his homophobic macho brother's GTO and heads south with his two best friends, Lance and Felicia. Every young woman who meets Lance, including Felicia, is attracted to him as he practices his aptly learned \"Pick-Up Artist\" skills. Ian, on the other hand, is a decent guy who wouldn't mind if his friendship with Felicia became a romance. By the time they get to Knoxville, they have encountered a jealous boyfriend, a menacing hitchhiker, jailbirds, carjackers, an Amish community, and Ian's better judgment.—",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "James Marsden",
      "Seth Green",
      "Scott Klace",
      "Giovanni Rodriguez"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Sex.Tape.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "Sex Tape",
    "runtime": 94,
    "rating": 5.1,
    "description": "When Jay (Jason Segel) and Annie (Cameron Diaz) first got together, their romantic connection was intense - but ten years and two kids later, the flame of their love needs a spark. To kick things up a notch, they decide - why not? - to make a video of themselves trying out every position in The Joy of Sex in one marathon three-hour session. It seems like a great idea - until they discover that their most private video is no longer private. With their reputations on the line, they know they're just one click away from being laid bare to the world... but as their race to reclaim their video leads to a night they'll never forget, they'll find that their video will expose even more than they bargained for.—Sony Pictures Entertainment",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Jack Black",
      "Nancy Lenehan",
      "Artemis Pebdani",
      "Rob Lowe"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Shaun.Of.The.Dead.2004.REMASTERED.REPACK.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2004,
    "title": "Shaun of the Dead",
    "runtime": 99,
    "rating": 7.8,
    "description": "Shaun (Simon Pegg) doesn't have a very good day, so he decides to turn his life around by getting his ex to take him back, but he times it for right in the middle of what may be a zombie apocalypse. But for him, it's an opportunity to show everyone he knows how useful he is by saving them all. All he has to do is survive, and get his ex back.—Infest0125",
    "categories": [
      "Action",
      "Comedy",
      "Horror"
    ],
    "cast": [
      "Bill Nighy",
      "Rob Brydon",
      "Martin Freeman",
      "Matt Lucas"
    ],
    "subtitles": []
  },
  {
    "source": "Shazam!.2019.1080p.BluRay.x264-[YTS.LT].mp4",
    "year": 2019,
    "title": "Shazam!",
    "runtime": 132,
    "rating": 7,
    "description": "In Philadelphia, Billy Batson is an abandoned child who is proving a nuisance to Child Services and the authorities with his stubborn search for his lost mother. However, in his latest foster home, Billy makes a new friend, Freddy, and finds himself selected by the Wizard Shazam to be his new champion. Now endowed with the ability to instantly become an adult superhero by speaking the wizard's name, Billy gleefully explores his new powers with Freddy. However, Billy soon learns that he has a deadly enemy, Dr. Thaddeus Sivana, who was previously rejected by the wizard and has accepted the power of the Seven Deadly Sins instead. Now pursued by this mad scientist for his own power as well, Billy must face up to the responsibilities of his calling while learning the power of a special magic with his true family that Sivana can never understand.—Kenneth Chisholm (kchishol@rogers.com)",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Fantasy"
    ],
    "cast": [
      "Adam Brody",
      "Seth Green",
      "Djimon Hounsou",
      "Stephannie Hawkins"
    ],
    "subtitles": []
  },
  {
    "source": "Shes.Out.of.My.League.2010.1080p.BluRay.x264.YIFY.mp4",
    "year": 2010,
    "title": "She's Out of My League",
    "runtime": 104,
    "rating": 6.4,
    "description": "Kirk is an average Joe who works as a TSA agent at the Pittsburgh airport with his friends. The status quo of his fairly monotonous life ends when he meets Molly, a smart, kind and gorgeous blonde. Because she's way out of his league (she's a hard 10 and he is but a 5), Kirk knows there's no way on earth she's ever going to fall for him. Or is there...?—Marco van Hoof",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Lindsay Sloane",
      "Krysten Ritter",
      "Alice Eve",
      "Andrew Daly"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Shrek.2.2004.1080p.BluRay.x264.YIFY.mp4",
    "year": 2004,
    "title": "Shrek 2",
    "runtime": 93,
    "rating": 7.4,
    "description": "Shrek (Mike Myers) has rescued Princess Fiona (Cameron Diaz), got married, and now is time to meet the parents. Shrek, Fiona, and Donkey (Eddie Murphy) set off to Far, Far Away to meet Fiona's mother and father. But not everyone is happy. Shrek and King Harold (John Cleese) find it hard to get along, and there's tension in the marriage. It's not just the family who are unhappy. Prince Charming (Rupert Everett) returns from a failed attempt at rescuing Fiona, and works alongside his mother, the Fairy Godmother (Jennifer Saunders), to try and find a way to get Shrek away from Fiona.—Film_Fan",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Romance"
    ],
    "cast": [
      "Marcelo Tubert",
      "Antonio Banderas",
      "Eddie Murphy",
      "Danny Mann"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Shrek.2001.1080p.BluRay.x264.YIFY.mp4",
    "year": 2001,
    "title": "Shrek",
    "runtime": 90,
    "rating": 7.9,
    "description": "When a green ogre named Shrek discovers his swamp has been 'swamped' with all sorts of fairytale creatures by the scheming Lord Farquaad, Shrek sets out with a very loud donkey by his side to 'persuade' Farquaad to give Shrek his swamp back. Instead, a deal is made. Farquaad, who wants to become the King, sends Shrek to rescue Princess Fiona, who is awaiting her true love in a tower guarded by a fire-breathing dragon. But once they head back with Fiona, it starts to become apparent that not only does Shrek, an ugly ogre, begin to fall in love with the lovely princess, but Fiona is also hiding a huge secret.—Film_Fan",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Romance"
    ],
    "cast": [
      "Frank Welker",
      "John Lithgow",
      "Eddie Murphy",
      "Vincent Cassel"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Shrek.4.2010.1080p.BluRay.x264.YIFY.mp4",
    "year": 2010,
    "title": "Shrek Forever After",
    "runtime": 0,
    "rating": 6.3,
    "description": "The once hideous ogre Shrek (Mike Myers) is now living a good life with wife Fiona (Cameron Diaz) and his three children. But he soon has a meltdown in front of them and his friends during his kids' birthday party. He suddenly wants to be a real ogre like he was before he ever met Fiona. So he turns to devious dealmaker Rumpelstiltskin (Walt Dohrn) for help. At first, Shrek lives the life he once lost and everything is good. But he soon finds out that he has been set up by Rumpelstiltskin, who now rules the land with an iron fist. Teaming with friends Donkey (Eddie Murphy), Fiona, and Puss in Boots (Antonio Banderas), Shrek is in for the fight of his life as he tries to get his life back before time runs out.—Blazer346",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Romance"
    ],
    "cast": [
      "Frank Welker",
      "Antonio Banderas",
      "Eddie Murphy",
      "Jon Hamm"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Shrek.The.Third.2007.1080p.HDDVD.x264.YIFY.mp4",
    "year": 2007,
    "title": "Shrek the Third",
    "runtime": 93,
    "rating": 6.1,
    "description": "When King Harold (John Cleese) of Far, Far Away dies, the clumsy Shrek (Mike Myers) becomes the immediate successor of the throne. However, Shrek decides to find the legitimate heir Artie (Justin Timberlake) in a distant kingdom with his friends Donkey (Eddie Murphy) and Puss in Boots (Antonio Banderas) to be able return to his beloved house in the swamp with the pregnant Fiona (Cameron Diaz). Meanwhile, the envious and ambitious Prince Charming (Rupert Everett) joins the villains of the fairytales plotting a coup d'état to become the new King.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Romance"
    ],
    "cast": [
      "Frank Welker",
      "Ian McShane",
      "Antonio Banderas",
      "Eddie Murphy"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Shutter.Island.2010.1080p.BluRay.x264.YIFY.mp4",
    "year": 2010,
    "title": "Shutter Island",
    "runtime": 138,
    "rating": 8.2,
    "description": "In 1954, up-and-coming U.S. marshal Teddy Daniels is assigned to investigate the disappearance of a patient from Boston's Shutter Island Ashecliffe Hospital. He's been pushing for an assignment on the island for personal reasons, but before long he thinks he's been brought there as part of a twisted plot by hospital doctors whose radical treatments range from unethical to illegal to downright sinister. Teddy's shrewd investigating skills soon provide a promising lead, but the hospital refuses him access to records he suspects would break the case wide open. As a hurricane cuts off communication with the mainland, more dangerous criminals \"escape\" in the confusion, and the puzzling, improbable clues multiply, Teddy begins to doubt everything - his memory, his partner, even his own sanity.—alfiehitchie",
    "categories": [
      "Action",
      "Drama",
      "Mystery",
      "Thriller"
    ],
    "cast": [
      "Leonardo DiCaprio",
      "Mark Ruffalo",
      "Christopher Denham",
      "Ben Kingsley"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Sixteen.Candles.1984.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 1984,
    "title": "Sixteen Candles",
    "runtime": 93,
    "rating": 7,
    "description": "Samantha's life is going downhill fast. The 16-year-old has a crush on the most popular boy in school, and the geekiest boy in school has a crush on her. Her sister is getting married, and with all the excitement the rest of her family forgets her birthday. Add to all this two sets of horrendously embarrassing grandparents, a foreign-exchange student named Long Duk Dong, and behold the makings of a hilarious journey into young-womanhood.—Rick Munoz",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Joan Cusack",
      "Paul Dooley",
      "Molly Ringwald",
      "John Cusack"
    ],
    "subtitles": []
  },
  {
    "source": "Sleeping.With.Other.People.2015.1080p.BluRay.x264.[YTS.AG].mp4",
    "year": 2015,
    "title": "Sleeping with Other People",
    "runtime": 101,
    "rating": 6.5,
    "description": "In 2002 Elaine \"Lainey\" Dalton (Alison Brie) causes a scene in a dorm. Taking pity on her as she is about to be kicked out by security, Jake Harper (Jason Sudeikis) claims her as his guest. He learns that Lainey was there in order to lose her virginity to her T.A. Matt (Adam Scott) who Jake thinks is the most boring guy in the world. Lainey eventually realizes that Jake is also a virgin. The two sleep together.In the present Lainey breaks up with her long-term boyfriend Sam (Adam Brody) after telling him she has been cheating on him 16 times. Lainey hates that Sam interrupts her every time she says anything, and never lets her complete a sentence. Sam believes that Lainey cheated on him with his brother, which Lainey denies.\nLainey is a kindergarten teacher, but was aiming to go to medical school when she was in college.On the advice of her therapist, she attends a love addicts meeting where she runs into Jake who is there because of his inability to be involved in committed relationships. Jake has just been dumped by his girlfriend Hannah (Margarita Levieva) as he cheated on her with her best friend.\nLainey, who has been having an off-and-on-again relationship with Matt the entire time (Matt was the guy with whom Lainey cheated on Sam) learns that Matt is engaged. Matt is engaged to Emma (Katherine Waterston). Lainey still has sex with Matt.On the advice of a friend Kara (Natasha Lyonne) Lainey contacts Jake. Jake & his business partner Xander (Jason Mantzoukas) has just sold their online advertising firm to a company owned by Paula (Amanda Peet). With the sale, Jake becomes Paula's full-time employee. Paula is divorced and has a kid. Jake is interested in Paula, but she is not.Lainey and Jake go on one date (it was a double date with Xander and his wife Naomi (Andrea Savage)) where they confess their sexual problems to one another. At the end of the date Jake confesses that he wants to sleep with her. Lainey decides that the two of them should just be friends and Jake agrees with the code-word \"mousetrap\" to be used to deflate sexual tension between them.The two hang out more and more and eventually become best friends. Lainey still gets unnerved whenever she runs into Matt anywhere in town. She uses Jake to unload her emotional baggage about Matt and she is unable to move on from him. Lainey also helps Jake understand why women respond the way they do, after he becomes emotionally unavailable after his numerous one-night stands.However, they begin to be mistaken for a couple by strangers and their friends begin to think they are in a relationship as well. Jake finds that Lainey has not had an orgasm for a year, since she stopped having sex with Matt. Jake teaches her to how to reach an orgasm by masturbating the right way.Jake learns that Lainey is going to re-enroll in medical school and possibly move to Michigan. Jake admits that he has feelings for Lainey, and he knows that he doesn't have the right to ask her to stay back and not go to Michigan.\nHe brings her to the birthday party of Xander's child where she meets a man called Chris Smith (Marc Blucas) and begins seeing him to Jake's consternation. Jake, deciding to move forward asks his boss, Paula on a date.A date with Chris Smith leads Lainey to run into Matt and his now pregnant wife. Lainey is shaken to her core and leaves. At the same time Jake has sex with Paula and calls her Lainey. After their nights out Jake and Lainey spend the night together where they realize that they are both in love with one another. They decide to do nothing about it. Jake knows that Lainey has been hurt by Matt.Lainey moves to Michigan and Jake devotes himself to Paula. Two months after Lainey has left, during brunch with Paula, Jake sees Matt and punches him in the face. Paula breaks up with him and Jake is arrested. He calls Lainey from the police station and confesses he is in love with her. She tells him she feels the same way.Sometime later Matt is suing Jake for emotional distress and refuses every settlement he offers. Lainey goes to see him and tells him she will tell his wife about them if he does not accept Jake's settlement. After leaving his office Lainey meets with Jake and the two rush off to be married.",
    "categories": [
      "Action",
      "Comedy",
      "Drama",
      "Romance"
    ],
    "cast": [
      "Adam Brody",
      "Billy Eichner",
      "Jason Sudeikis",
      "Amanda Peet"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Snatched.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "Snatched",
    "runtime": 90,
    "rating": 4.7,
    "description": "Freshly dumped by her musician boyfriend and fired from her job, all on the same day, suddenly, the rudderless thirtysomething, Emily Middleton, finds herself with two non-refundable tickets to Ecuador. Finding hard to swallow that she is about to lose the trip of a lifetime, Emily turns to the only person left to come with her: her idiosyncratic, phobic, and cat-loving mother, Linda. But, there, the dream holiday soon turns into an Equatorial nightmare when the mother-and-daughter duo ends up conned and abducted in broad daylight. Now, to stay alive, scaredy-cat Linda and impulsive Emily will need to set aside their differences, and like a fish out of water, navigate through dense jungle thickets. But, can they make it happen?—Nick Riganas",
    "categories": [
      "Action",
      "Adventure",
      "Comedy"
    ],
    "cast": [
      "Bashir Salahuddin",
      "Joan Cusack",
      "Raven Goodwin",
      "Tom Bateman"
    ],
    "subtitles": []
  },
  {
    "source": "Sonic.The.Hedgehog.2.2022.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2022,
    "title": "Sonic the Hedgehog 2",
    "runtime": 122,
    "rating": 6.5,
    "description": "After settling in Green Hills, Sonic is ready for more freedom, and Tom and Maddie agree to leave him home while they go on vacation. But, no sooner are they gone, when Dr. Robotnik comes back, this time with a new partner, Knuckles, in search for an emerald that has the power to both build and destroy civilizations. Sonic teams up with his own sidekick, Tails, and together they embark on a journey to find the emerald before it falls into the wrong hands. Being directed by Jeff Fowler, and starring Jim Carrey, James Marsden, and Ben Schwartz.",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Jim Carrey",
      "Idris Elba",
      "Scott Patey",
      "Paul Lazenby"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Sonic.The.Hedgehog.2020.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2020,
    "title": "Sonic the Hedgehog",
    "runtime": 99,
    "rating": 6.5,
    "description": "Based on the global blockbuster videogame franchise from Sega, SONIC THE HEDGEHOG tells the story of the world's speediest hedgehog as he embraces his new home on Earth. In this live-action adventure comedy, Sonic and his new best friend Tom (James Marsden) team up to defend the planet from the evil genius Dr. Robotnik (Jim Carrey) and his plans for world domination. The family-friendly film also stars Tika Sumpter and Ben Schwartz as the voice of Sonic.—Paramount Pictures",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Jim Carrey",
      "Neal McDonough",
      "Scott Patey",
      "James Marsden"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Spy.2015.1080p.BluRay.x264-[YTS.AM].mp4",
    "year": 2015,
    "title": "Spy",
    "runtime": 120,
    "rating": 7,
    "description": "Susan Cooper is an unassuming, deskbound CIA analyst--and the unsung hero behind the Agency's most dangerous missions. But when her partner falls off the grid and another top agent is compromised, she volunteers to go deep undercover to infiltrate the world of a deadly arms dealer and prevent a global crisis.—20th Century Fox",
    "categories": [
      "Action",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Jason Statham",
      "Morena Baccarin",
      "Jude Law",
      "Rose Byrne"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Table.19.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "Table 19",
    "runtime": 87,
    "rating": 5.8,
    "description": "Ex-maid of honor Eloise (Anna Kendrick) - having been relieved of her duties after being unceremoniously dumped by the best man via text - decides to hold her head up high and attend her oldest friend's wedding anyway. She finds herself seated at the 'random' table in the back of the ballroom with a disparate group of strangers, most of whom should have known to just send regrets (but not before sending something nice off the registry). As everyone's secrets are revealed, Eloise learns a thing or two from the denizens of Table 19. Friendships - and even a little romance - can happen under the most unlikely circumstances.—Fox Searchlight Pictures",
    "categories": [
      "Action",
      "Comedy",
      "Drama",
      "Romance"
    ],
    "cast": [
      "Chris Whitley",
      "Andrew Daly",
      "Anna Kendrick",
      "Tony Revolori"
    ],
    "subtitles": []
  },
  {
    "source": "Tangled.2010.1080p.BluRay.x264.YIFY.mp4",
    "year": 2010,
    "title": "Tangled",
    "runtime": 100,
    "rating": 7.7,
    "description": "After receiving the healing powers from a magical flower, the baby Princess Rapunzel is kidnapped from the palace in the middle of the night by Mother Gothel. Mother Gothel knows that the flower's magical powers are now growing within the golden hair of Rapunzel, and to stay young, she must lock Rapunzel in her hidden tower. Rapunzel is now a teenager and her hair has grown to a length of 70-feet. The beautiful Rapunzel has been in the tower her entire life, and she is curious of the outside world. One day, the bandit Flynn Ryder scales the tower and is taken captive by Rapunzel. Rapunzel strikes a deal with the charming thief to act as her guide to travel to the place where the floating lights come from that she has seen every year on her birthday. Rapunzel is about to have the most exciting and magnificent journey of her life.—Douglas Young (the-movie-guy)",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy",
      "Musical",
      "Romance"
    ],
    "cast": [
      "Frank Welker",
      "M.C. Gainey",
      "Ron Perlman",
      "Michael Bell"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Ted.2.2015.1080p.BluRay.x264.YIFY.[YTS.AG].mp4",
    "year": 2015,
    "title": "Ted 2",
    "runtime": 115,
    "rating": 6.3,
    "description": "Months after John's divorce, Ted and Tami-Lynn's marriage seems to be on the same road. To patch things up, Ted and Tami-Lynn plan to have a child with John's help, but their failed efforts backfire disastrously. Namely, Ted is declared property by the government, and he loses all of his civil rights. Now, Ted must fight a seemingly hopeless legal battle with an inexperienced young lawyer to regain his rightful legal status. Unfortunately, between Ted's drunken idiocies and sinister forces interested in this situation to exploit him, Ted's quest has all the odds against him.—Kenneth Chisholm (kchishol@rogers.com)",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Morgan Freeman",
      "Mark Wahlberg",
      "Liam Neeson",
      "Amanda Seyfried"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Ted.2012.BluRay.1080p.x264.YIFY.mp4",
    "year": 2012,
    "title": "Ted",
    "runtime": 106,
    "rating": 6.9,
    "description": "John makes a Christmas miracle happen by bringing his one and only friend to life, his teddy bear. The two grow up together and John must then choose to stay with his girlfriend or keep his friendship with his crude and extremely inappropriate teddy bear, Ted.—Anonymous",
    "categories": [
      "Action",
      "Animation",
      "Comedy",
      "Fantasy",
      "Romance"
    ],
    "cast": [
      "Mark Wahlberg",
      "Tom Skerritt",
      "Ryan Reynolds",
      "Mila Kunis"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Teenage.Mutant.Ninja.Turtles.Mutant.Mayhem.2023.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2023,
    "title": "Teenage Mutant Ninja Turtles: Mutant Mayhem",
    "runtime": 99,
    "rating": 7.2,
    "description": "After years of being sheltered from the human world, the Turtles set out to win the hearts of New Yorkers and be accepted as normal teenagers through heroic acts. But they soon get in over their heads when an army of mutants is unleashed upon them.—yusufpiskin",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Crime",
      "Family",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Jackie Chan",
      "Rose Byrne",
      "Natasia Demetriou",
      "Paul Rudd"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Tenet.2020.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2020,
    "title": "Tenet",
    "runtime": 150,
    "rating": 7.3,
    "description": "In a twilight world of international espionage, an unnamed CIA operative, known as The Protagonist, is recruited by a mysterious organization called Tenet to participate in a global assignment that unfolds beyond real time. The mission: prevent Andrei Sator, a renegade Russian oligarch with precognitive abilities, from starting World War III. The Protagonist will soon master the art of \"time inversion\" as a way of countering the threat that is to come.—jesusblack-91294",
    "categories": [
      "Action",
      "Adventure",
      "Sci-Fi",
      "Thriller"
    ],
    "cast": [
      "Michael Caine",
      "Robert Pattinson",
      "Himesh Patel",
      "Aaron Taylor-Johnson"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "That.Awkward.Moment.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "That Awkward Moment",
    "runtime": 94,
    "rating": 6.1,
    "description": "Jason has just been dumped, but he didn't even realize they were going out. Meanwhile, Mikey's wife has just asked him for a divorce, and perpetually single Daniel is still single. The three best friends are determined to stay single together and just have fun. But then Jason meets Ellie who just might be perfect for him, Daniel starts to realize that his gal pal Chelsea might be perfect for him, and Mikey has always thought that his wife was perfect for him. The boys are going to have to juggle their single life with their romantic entanglements and it's going to get awkward.—napierslogs",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Zac Efron",
      "Victor Slezak",
      "Imogen Poots",
      "Evelina Turen"
    ],
    "subtitles": []
  },
  {
    "source": "Thats.My.Boy.2012.BluRay.1080p.x264.YIFY.mp4",
    "year": 2012,
    "title": "That's My Boy",
    "runtime": 116,
    "rating": 5.6,
    "description": "While still in his teens, Donny (Adam Sandler) fathered son Todd (Andy Samberg) and raised him alone until Todd's 18th birthday. Now, after years apart, Donny suddenly shows up uninvited on the eve of Todd's wedding. Donny tries desperately to reconnect with Todd and is forced to deal with the results of his bad parenting skills.—Official site",
    "categories": [
      "Action",
      "Comedy",
      "Drama"
    ],
    "cast": [
      "J.D. Donaruma",
      "Jackie Sandler",
      "Susan Sarandon",
      "Andy Samberg"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.40-Year-Old.Virgin.2005.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2005,
    "title": "The 40-Year-Old Virgin",
    "runtime": 116,
    "rating": 7.1,
    "description": "Forty-year-old Andy, an electronics store shipping clerk, is a stereotypical geek, who plays video games and takes care of his collectible action figures. He has no real friends and spends most of his time away from work by himself. Despite having an interest in the opposite sex philosophically as witnessed by his constant and uncontrollable morning erections, he is still a virgin. He never planned not to have sex, but it became more and more difficult to have that first experience as he got older, to the point where, to him, it became a reality for his life. When his work colleagues find out, some mock and ridicule him, while a small group comprised of Dave, Jay and Cal take it upon themselves to help him get laid, despite each of three having their own relationship issue making them perhaps not the best people to provide advice or assistance. Andy also gets some unexpected suggestions from some standing on the sidelines of his life. Beyond that advice, Andy has to be the one to take the ultimate step to reality, he not only having no practical experience, but also no theoretical experience in that he doesn't even watch or have interest in porn or masturbate. Some of the advice he receives centers on the actual woman who should be his first time. Regardless of that advice, he decides that the woman he truly wants is Trish, a specialty retailer with a somewhat useless bricks and mortar outlet across the street from the electronics store. As Andy pursues then eventually falls for Trish, he has to decide how much of his true self he will divulge to her.—Huggo",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Kevin Hart",
      "Paul Rudd",
      "Leslie Mann",
      "Kat Dennings"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.A.Team.EXTENDED.2010.1080p.BrRip.x264.YIFY.mp4",
    "year": 2010,
    "title": "The A-Team",
    "runtime": 117,
    "rating": 6.7,
    "description": "Four American soldiers who are in Iraq are sent on a mission to recover plates for printing 100 dollar bills that were used to print a billion dollars. After doing the job and returning to the base their commanding officer is killed in an explosion and the plates are stolen by another operative. They would be court martialed and sent to different prisons. 6 months later, the leader, Hannibal Smith is visited by a CIA spook who tells him he knows where the man who took the plates is and wants him and his men to recover it. So he helps him escape and he breaks out the others and they go after the plates. But after doing it, they discover that the spook might not be ok. And a military intelligence officer who was involved with one of them is pursuing them.—rcs0411@yahoo.com",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Crime",
      "Thriller"
    ],
    "cast": [
      "Liam Neeson",
      "Patrick Wilson",
      "Jessica Biel",
      "Jon Hamm"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Batman.2022.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2022,
    "title": "The Batman",
    "runtime": 176,
    "rating": 7.8,
    "description": "Two years of nights have turned Bruce Wayne into a nocturnal animal. But as he continues to find his way as Gotham's dark knight Bruce is forced into a game of cat and mouse with his biggest threat so far, a manic killer known as \"The Riddler\" who is filled with rage and determined to expose the corrupt system whilst picking off all of Gotham's key political figures. Working with both established and new allies, Bruce must track down the killer and see him brought to justice, while investigating his father's true legacy and questioning the effect that he has had on Gotham so far as \"The Batman.\"—jc-15610",
    "categories": [
      "Action",
      "Crime",
      "Drama",
      "Mystery",
      "Thriller"
    ],
    "cast": [
      "Colin Farrell",
      "Robert Pattinson",
      "Paul Dano",
      "Todd Boyce"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Boss.Baby.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "The Boss Baby",
    "runtime": 97,
    "rating": 6.3,
    "description": "Seven-year-old Tim Templeton has always had an overactive imagination; after all, life has been all peaches and cream for the past seven years. And then, everything changed: an unexpected new brother arrived, stealing the show. As the siblings try to work things out, one day, Tim makes a shocking, eye-opening discovery. Is there more to the cute newcomer in a diaper than meets the eye? When a sneaky scheme involving the CEO of Puppy Co and the adults' love of babies and puppies threatens to change the world as we know it, Tim and the little one will have to join forces to thwart the sinister plan. However, the next pet convention is only two days away. Will the toothless but ruthless baby show everyone who's boss?—Nick Riganas",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Fantasy"
    ],
    "cast": [
      "Steve Buscemi",
      "Tobey Maguire",
      "Alec Baldwin",
      "Lisa Kudrow"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Change-Up.2011.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2011,
    "title": "The Change-Up",
    "runtime": 112,
    "rating": 6.3,
    "description": "Mitch (Ryan Reynolds) and Dave (Jason Bateman) grew up together and were inseparable best friends, but as the years have passed they've drifted apart. While Dave is an overworked lawyer, husband, and father of three, Mitch has remained a single, quasi-employed man-child who has never met a responsibility he liked. To Mitch, Dave has it all: beautiful wife Jamie (Leslie Mann), kids who adore him, and a high-paying job at a prestigious law firm. To Dave, Mitch's stress-free life without obligation or consequence would be a dream come true. Following a drunken night out together, Mitch and Dave's worlds are turned upside down when they wake up in each other's bodies and proceed to freak out. Despite the freedom from their normal routines and habits, the guys soon discover that each other's lives are nowhere near as rosy as they once seemed. Further complicating matters are Dave's sexy legal associate, Sabrina (Olivia Wilde) and Mitch's estranged father (Alan Arkin). With time not on their side, Mitch and Dave comically struggle to avoid completely destroying each other's lives before they can find a way to get their old ones back.—anonymous",
    "categories": [
      "Action",
      "Comedy",
      "Fantasy"
    ],
    "cast": [
      "Jason Bateman",
      "Roger Jackson",
      "Ryan Reynolds",
      "Timothy J. Richardson"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.DUFF.2015.1080p.BluRay.x264.YIFY.mp4",
    "year": 2015,
    "title": "The DUFF",
    "runtime": 101,
    "rating": 6.4,
    "description": "Bianca is a content high school senior whose world is shattered when she learns the student body knows her as 'The DUFF' (Designated Ugly Fat Friend) to her prettier, more popular friends. Now, despite the words of caution from her favorite teacher, she puts aside the potential distraction of her crush, Toby, and enlists Wesley, a slick but charming jock, to help reinvent herself. To save her senior year from turning into a total disaster, Bianca must find the confidence to overthrow the school's ruthless label maker Madison and remind everyone that no matter what people look or act like, we are all someone's DUFF.—CBS Films",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Danielle Lyn",
      "Robbie Amell",
      "Allison Janney",
      "Romany Malco"
    ],
    "subtitles": []
  },
  {
    "source": "The.English.Teacher.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "The English Teacher",
    "runtime": 93,
    "rating": 5.8,
    "description": "Linda Sinclair (Julianne Moore) is a forty-year-old unmarried high school English teacher in the small town of Kingston, Pennsylvania. She shares a small apartment with two Siamese cats and her rich collection of great literature. She maintains no close personal relationships aside from those she has with her favorite authors and stories. Her life is far less complicated than the dramas she devours on the page, and she likes it that way. But Linda's simple life turns an unexpected page when former star pupil Jason Sherwood (Michael Angarano) returns to Kingston after trying to make it as a playwright in New York. Now in his 20s, Jason is on the verge of abandoning art, pressured by his overbearing father, Dr. Tom Sherwood (Greg Kinnear), to face reality and go to law school. Linda can't stand the thought of Jason giving up on his dreams so she decides to mount his play - a dark, angst-ridden, ambitious work - as a Kingston High School production, with flamboyant drama teacher Carl Kapinas (Nathan Lane) directing. As Linda, now well out of her normal comfort zone, takes further risks in life and love, the stage is set for highly comic downfall. With the play, her reputation, and her teaching career on the line, Linda finds an unlikely ally in herself. Amidst the ruins of her formerly perfect life, can she find a way to her own unique storybook ending?—Cinedigm",
    "categories": [
      "Action",
      "Comedy",
      "Drama"
    ],
    "cast": [
      "Charlie Saxton",
      "Julianne Moore",
      "Norbert Leo Butz",
      "Lily Collins"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Fall.Guy.2024.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2024,
    "title": "The Fall Guy",
    "runtime": 126,
    "rating": 6.8,
    "description": "He's a stuntman, and like everyone in the stunt community, he gets blown up, shot, crashed, thrown through windows and dropped from the highest of heights, all for our entertainment. And now, fresh off an almost career-ending accident, this working-class hero has to track down a missing movie star, solve a conspiracy and try to win back the love of his life while still doing his day job. What could possibly go right?—The Fall Guy movie",
    "categories": [
      "Action",
      "Comedy",
      "Drama",
      "Romance"
    ],
    "cast": [
      "Emily Blunt",
      "Jason Momoa",
      "Ryan Gosling",
      "Hannah Waddingham"
    ],
    "subtitles": []
  },
  {
    "source": "The.Hangover.2009.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2009,
    "title": "The Hangover",
    "runtime": 100,
    "rating": 7.7,
    "description": "Angelenos Doug Billings and Tracy Garner are about to get married. Two days before the wedding, the four men in the wedding party - Doug, Doug's two best buddies Phil Wenneck and Stu Price, and Tracy's brother Alan Garner - hop into Tracy's father's beloved Mercedes convertible for a 24-hour stag party to Las Vegas. Phil, a married high school teacher, has the same maturity level as his students when he's with his pals. Stu, a dentist, is worried about everything, especially what his controlling girlfriend Melissa thinks. Because she disapproves of traditional male bonding rituals, Stu has to lie to her about the stag, he telling her that they are going on a wine tasting tour in the Napa Valley. Regardless, he intends on eventually marrying her, against the advice and wishes of his friends. And Alan seems to be unaware of what are considered the social graces of the western world. The morning after their arrival in Las Vegas, they awaken in their hotel suite each with the worst hangover. None remembers what happened in the past twelve or so hours. The suite is in shambles. And certain things are in the suite that shouldn't be, and certain things that should be in the suite are missing. Probably the most important in the latter category is Doug. As Phil, Stu and Alan try to find Doug using only what little pieces of information they have at hand, they go on a journey of discovery of how certain things got into the suite and what happened to the missing items. However they are on a race for time as if they can't find Doug in the next few hours, they are going to have to explain to Tracy why they are not yet back in Los Angeles. And even worse, they may not find Doug at all before the wedding.—Huggo",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Wayne Newton",
      "Zach Galifianakis",
      "Rachael Harris",
      "Bradley Cooper"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Hangover.Part.II.2011.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2011,
    "title": "The Hangover Part II",
    "runtime": 102,
    "rating": 6.5,
    "description": "Stu is getting married. Along with Doug, Phil, and his soon-to-be brother-in-law Teddy, he regretfully invites Alan to Thailand for the wedding. After a quiet night on the beach with a beer and toasting marshmallows by the camp fire, Stu, Alan and Phil wake up in a seedy apartment in Bangkok. Doug is back at the resort, but Teddy is missing, there's a monkey with a severed finger, Alan's head is shaved, Stu has a tattoo on his face, and they can't remember any of it. The wolf-pack retrace their steps through strip clubs, tattoo parlors and cocaine-dealing monkeys on the streets of Bangkok as they try and find Teddy before the wedding.—napierslogs",
    "categories": [
      "Action",
      "Comedy",
      "Mystery"
    ],
    "cast": [
      "Jamie Chung",
      "Zach Galifianakis",
      "Bradley Cooper",
      "Paul Giamatti"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Hangover.Part.III.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "The Hangover Part III",
    "runtime": 100,
    "rating": 5.9,
    "description": "In the aftermath of the death of Alan's father, the wolfpack decide to take Alan to get treated for his mental issues. But things start to go wrong on the way to the hospital as the wolfpack is assaulted and Doug is kidnapped. Now they must find Mr. Chow again in order to surrender him to the gangster who kidnapped Doug in order to save him.—HeWhoShallNotBeNamed",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Crime",
      "Drama",
      "Romance",
      "War"
    ],
    "cast": [
      "Jamie Chung",
      "Rob Mars",
      "Zach Galifianakis",
      "Bradley Cooper"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Heat.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "The Heat",
    "runtime": 117,
    "rating": 6.6,
    "description": "Sarah Ashburn, an FBI agent, is extremely ambitious and has her eye on a promotion, but she doesn't get along with her co-workers. She is sent to Boston to uncover the identity of an elusive drug lord, Mr. Larkin, by tracking down his proxy, Rojas, and is told that she'll have a good shot at the promotion if she finds Larkin. When she arrives in Boston, she learns that Larkin has been eliminating his competition and taking over their operations. She learns that Rojas is in Boston PD custody and goes to see him to ask him what he knows about Larkin, but is warned that the cop who arrested Rojas, Shannon Mullins, is very territorial, and she is not exactly sociable. When the two meet they don't get along. When Mullins learns why Ashburn is in Boston, she decides to find Larkin herself. Ashburn is told by her boss to work with Mullins, but it won't be easy because Ashburn does things by the book while Mullins does things her way.—rcs0411@yahoo.com",
    "categories": [
      "Action",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Sandra Bullock",
      "Marlon Wayans",
      "Joey McIntyre",
      "Zach Woods"
    ],
    "subtitles": []
  },
  {
    "source": "The.Hitmans.Wifes.Bodyguard.2021.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2021,
    "title": "Hitman's Wife's Bodyguard",
    "runtime": 100,
    "rating": 6.1,
    "description": "The world's most lethal odd couple - bodyguard Michael Bryce and hitman Darius Kincaid - are back on another life-threatening mission. Still unlicensed and under scrutiny, Bryce is forced into action by Darius's even more volatile wife, the infamous international con artist Sonia Kincaid. As Bryce is driven over the edge by his two most dangerous protectees, the trio get in over their heads in a global plot and soon find that they are all that stand between Europe and a vengeful and powerful madman. Joining in the fun and deadly mayhem is Morgan Freeman as - well, you'll have to see.—Lionsgate",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Romance",
      "Thriller"
    ],
    "cast": [
      "Gary Oldman",
      "Samuel L. Jackson",
      "Morgan Freeman",
      "Salma Hayek"
    ],
    "subtitles": []
  },
  {
    "source": "The.House.2017.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2017,
    "title": "The House",
    "runtime": 88,
    "rating": 5.6,
    "description": "Scott and Kate Johansson are elated to discover their daughter Alex has been accepted into bucknell university. However, the town college scholarship program refuses to fund any more tuitions. Out of options, the couple makes an executive decision to open an underground illegal casino in their friend Frank's basement. Unfortunately, the authorities soon become suspicious. Now what?!—Emperor Jake",
    "categories": [
      "Action",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Alexandra Daddario",
      "Rob Huebel",
      "Jeremy Renner",
      "Sam Richardson"
    ],
    "subtitles": []
  },
  {
    "source": "The.Hustle.2019.1080p.BluRay.x264-[YTS.LT].mp4",
    "year": 2019,
    "title": "The Hustle",
    "runtime": 93,
    "rating": 5.5,
    "description": "In this remake of 1988's \"Dirty Rotten Scoundrels,\" 2 con-women hustle in a small French Riviera town - one for small amounts from average men, and one for higher amounts wealthier men. They bet on what looks like an easy target. Winner gets $500K from him, and the loser leaves town forever.—Asher Zeiger",
    "categories": [
      "Action",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Anne Hathaway",
      "Hannah Waddingham",
      "Dean Norris",
      "Nicholas Woodeson"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Incredibles.2004.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2004,
    "title": "The Incredibles",
    "runtime": 115,
    "rating": 8,
    "description": "Bob Parr (A.K.A. Mr. Incredible), and his wife Helen (A.K.A. Elastigirl), are the world's greatest famous crime-fighting superheroes in Metroville, always saving lives and battling evil on a daily basis. But 15 years later, they have been forced to adopt civilian identities and retreat to the suburbs where they have no choice but to retire as superheroes to live a \"normal life\" with their three children Violet, Dash and Jack-Jack, who were born with secret superpowers. Itching to get back into action, Bob gets his chance when a mysterious communication summons him to a remote island for a top-secret assignment. He soon discovers that it will take a super family effort to rescue the world from total destruction.—Anthony Pereyra {hypersonic91@yahoo.com}",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Family"
    ],
    "cast": [
      "Samuel L. Jackson",
      "Olivia Hack",
      "Michael Bell",
      "Rick Miller"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Interview.2014.1080p.BluRay.x264.YIFY.mp4",
    "year": 2014,
    "title": "The Interview",
    "runtime": 112,
    "rating": 6.5,
    "description": "In the action-comedy The Interview, Dave Skylark (James Franco) and his producer Aaron Rapoport (Seth Rogen) run the popular celebrity tabloid TV show \"Skylark Tonight.\" When they discover that North Korean dictator Kim Jong-un is a fan of the show, they land an interview with him in an attempt to legitimize themselves as journalists. As Dave and Aaron prepare to travel to Pyongyang, their plans change when the CIA recruits them, perhaps the two least-qualified men imaginable, to assassinate Kim Jong-un.—Sony Pictures Entertainment",
    "categories": [
      "Action",
      "Adventure",
      "Comedy"
    ],
    "cast": [
      "Emma Stone",
      "James Franco",
      "Joseph Gordon-Levitt",
      "Seth Rogen"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Lost.City.2022.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2022,
    "title": "The Lost City",
    "runtime": 112,
    "rating": 6.1,
    "description": "Reclusive author Loretta Sage writes about exotic places in her popular adventure novels that feature a handsome cover model named Alan. While on tour promoting her new book with Alan, Loretta gets kidnapped by an eccentric billionaire who hopes she can lead him to an ancient city's lost treasure from her latest story. Determined to prove he can be a hero in real life and not just on the pages of her books, Alan sets off to rescue her.—Anonymous",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Brad Pitt",
      "Sandra Bullock",
      "Channing Tatum",
      "Daniel Radcliffe"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Lucky.One.2012.1080p.BluRay.X264.YIFY.mp4",
    "year": 2012,
    "title": "The Lucky One",
    "runtime": 101,
    "rating": 6.4,
    "description": "Logan is a marine serving in Iraq. While there, he finds a photo of a girl with \"keep safe\" written on the back. He is admiring it when his unit is attacked. He survives and credits the photo for saving him. He tries to find the owner but can't, assuming he was killed. When he goes back to the States, he finds it difficult to adjust and is still haunted by what happened. Analyzing the photo, he finds in the background a landmark that tells him she is in Louisiana. He then goes there and finds her. He learns her name is Beth. He tries to tell her what happened but can't get the words out. She assumes he's there to apply for the job they advertised looking for someone to help at her family's business, a dog kennel. He says yes but at first she gets an uneasy feeling from him but her grandmother decides to give him a chance. It isn't long that he makes a connection with her son. He then discovers that it was her brother who had the picture only he doesn't remember him. He sees that her brother's death has a profound effect on her. Eventually they get close which makes her grandmother happy but not her ex who is a deputy sheriff who's always threatening to take their son away from her.—rcs0411@yahoo.com",
    "categories": [
      "Action",
      "Drama",
      "Horror",
      "Mystery",
      "Romance",
      "War"
    ],
    "cast": [
      "Zac Efron",
      "Ritchie Montgomery",
      "Adam LeFevre",
      "Jay R. Ferguson"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Meg.2018.1080p.BluRay.x264-[YTS.AM].mp4",
    "year": 2018,
    "title": "The Meg",
    "runtime": 113,
    "rating": 5.7,
    "description": "Five years ago, expert sea diver and Naval Captain Jonas Taylor encountered an unknown danger in the unexplored recesses of the Mariana Trench that forced him to abort his mission and abandon half his crew. Though the tragic incident earned him a dismissal from service, what ultimately cost him his career, his marriage and any semblance of honor was his unsupported and incredulous claims of what caused it - an attack on his vessel by a mammoth, 70-foot sea creature, believed to be extinct for more than a million years. But when a submersible lies sunk and disabled at the bottom of the ocean - carrying his ex-wife among the team onboard - he is the one who gets the call. Whether a shot at redemption or a suicide mission, Jonas must confront his fears and risk his own life and the lives of everyone trapped below on a single question: Could the Carcharodon Megalodon - the largest marine predator that ever existed - still be alive - and on the hunt?—Warner Brothers",
    "categories": [
      "Action",
      "Horror",
      "Sci-Fi",
      "Thriller"
    ],
    "cast": [
      "Jason Statham",
      "Winston Chao",
      "Jessica McNamee",
      "Robert Taylor"
    ],
    "subtitles": [
      "en",
      "si"
    ]
  },
  {
    "source": "The.Nice.Guys.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "The Nice Guys",
    "runtime": 116,
    "rating": 7.4,
    "description": "In 1977 Los Angeles, single father and licensed PI Holland March (Gosling) is hired to investigate the apparent suicide of famous porn star Misty Mountains. As the trail leads him to track down a girl named Amelia (Qualley), he encounters less-licensed and less-hands-off private eye Jackson Healey (Russell Crowe) and his brass knuckles, both hired by the young hippie. However, the situation takes a turn for the worse when Amelia vanishes and it becomes apparent that March wasn't the only interested party. As both men are forced to team up, they need to take on a world filled with eccentric goons, strippers dressed as mermaids, and even a possible government conspiracy.—@onecriticalgeek",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Drama",
      "Mystery",
      "Thriller"
    ],
    "cast": [
      "Robert Downey Jr.",
      "Ryan Gosling",
      "Margaret Qualley",
      "Russell Crowe"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Other.Guys.1080p.BrRip.x264.YIFY.mp4",
    "year": 2010,
    "title": "The Other Guys",
    "runtime": 107,
    "rating": 6.7,
    "description": "Terry Hoitz's past mistakes in the line of duty and Allen Gamble's reluctance to take risks have landed them the roles of the \"Other Guys\", disgraced New York City police detectives relegated to filling out paperwork for cocky hero cops Danson and Highsmith. The mismatched duo must look past their differences when they take on a high-profile investigation of shady capitalist David Ershon and attempt to fill the shoes of the notoriously reckless officers they idolize.—The Massie Twins",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Thriller"
    ],
    "cast": [
      "Samuel L. Jackson",
      "Mark Wahlberg",
      "Rob Huebel",
      "Lindsay Sloane"
    ],
    "subtitles": []
  },
  {
    "source": "The.Out-Laws.2023.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2023,
    "title": "The Out-Laws",
    "runtime": 95,
    "rating": 5.4,
    "description": "Owen Browning (Adam DeVine) is a young bank manager about to marry Parker McDermott (Nina Dobrev), whose estranged parents contact her to come to the wedding. He's excited he's finally going to meet them, as she's concerned they can be a bit much.Owen's parents Neil (Richard Kind) and Margie (Julie Hagerty) are difficult. Owen calls to tell them the good news about Parker's parents attending the wedding. He first has to hear about an odd nickel allergy of a guest, then they show their ignorance of Parker's profession as a yoga instructor, believing it involves a stripper pole. Rather than being happy about the news that the other in-laws are coming, they criticize them for being absent in Parker's life.At the bank, Owen has to free an employee who's been played upon by being locked in the vault. So, he shows and talks about how state-of-the-art their bank's security system is. They point out their rival bank's vault security is considered the best in the state. Owen also points out all vaults have an emergency escape latch.Out at dinner with his parents, they talk about the soon appearance of Parker's parents. Meanwhile, Owen talks with the storage space facility where Parker's parents rent a locker as he's hoping to access photos of the Parkers for a wedding photo montage. His call inadvertently alerts the crime boss Rehan (Poorna Jagannathan) to their return, when the storage space manager tells Rehan about Owen inquiring about the McDermott's locker.The following night, the McDermotts let themselves into their home while Parker is still out leading a yoga class and scare Owen. They insist he calls them Billy (Pierce Brosnan) and Lilly (Ellen Barkin). Owen and Parker tell Billy and Lilly that they met at Parker's yoga class due to Owen's hip issues. He went to her class for a year and a half before Parker finally asked him out.\nThe next day, Owen takes off work to spend the day with the in-laws. They pick the agenda, so they go skydiving, get tattoos, and drink. The McDermotts are adventure freaks while Owen is a totally laid back, peace loving, normal guy.The next day, an infamous full-costumed pair of criminals called the \"Ghost Bandits\" hold up the bank. As the robbery occurs during his wedding week, specific indicators such as the male's cologne, flashbacks to the bar, and what he told Lilly the previous day lead Owen to believe that the robbers might be his future in-laws. Owen had told Lilly about all the codes and the security measures to break into the vault.\nUnknown to Owen, Rehan had met Billy at the bar the previous night. Billy had told Owen that he knows nothing.FBI special agent Roger Oldham (Michael Rooker) questions Owen as the bank manager with his in-laws behind him. Not able to say anything, Parker insists they leave once he breaks out in tears. Oldham has dedicated most of his career chasing the Ghost Bandits and he's convinced they are behind the robbery.\nOwen know that if the McDermotts robbed the bank, then he did too, as he told Lilly the codes.Trying to enlist his parents' help in outing the McDermotts, Owen tells them his suspicions. They do ask direct inappropriate questions at dinner, but Billy and Lilly expertly redirect the conversation. Parker later asks Owen, but she thinks his theory is crazy.The next day, Owen follows his in-laws to Rehan's and hears her threaten to kill Parker if they don't get her $5,000,000 more before the wedding. Billy had just paid Rehan $ 1 million, as that was the amount that Billy and Lilly stole from her. But Rehan wants the $ 5 million as penalties and interest. She gives them till end of the week to come up with the cash.\nOldham stops Owen on the highway, finds planted evidence in the trunk (burner phones, voice modulators which makes it look like Owen robbed his own bank), and spills it on his in-laws. Oldham puts a wire on him, hoping to get the McDermotts to confess. Instead, Rehan shows up with her henchmen and takes Parker hostage as insurance. Disgusted, Owen joins forces with his in-laws.\nMcDermotts say that Rehan was their partner. She would choose the banks. But she started losing it and they were afraid that they would find out about Parker. So, at the last heist, they took the money and ran.\nOwen says that he knows everything about banks and can help them rob $ 5 million in 2 days.They first choose Victory Union Bank to rob as the bank manager is lazy. However, they lose most of the cash through a comedy of errors. They are able to steal the money from the armored car which was taking the cash from the bank, but the security kicks in and due to Owen's ineptitude, their getaway car is disabled. Owen eventually gets into the armored car, and rescues Billy and Lilly. But the cash was in their getaway car. They are pursued by the police, but Owen drives through a cemetery. The armored car smashes through the headstones, but the cop cars are not able to.So, then they focus on Atlas Reserve. Owen goes in, asking it's manager Phoebe King (Lauren Lapkus) how he can better equip his bank. Phoebe is the best bank manager in the business and every inch of her bank is triple secured. Phoebe's arrogance kicks in, so she shows him all of the safeguards with him. Just as the safe open, the McDermotts create a diversion out front while Owen locks himself in and then uses the emergency escape latch to escape with the money.At the ransom drop, Rehan is pleasantly surprised that Owen brought the money, but will kill them anyway. He miraculously guns them down as the McDermotts distract the cops so Owen can sneak back into the vault with the money.As the McDermotts turn themselves in and help Oldham with his ex, he lets them go briefly to Owen and Parker's wedding reception.\nDuring the credits, Owen slips a paperclip into a piece of cake for his new in-laws to use to get free of their handcuffs.",
    "categories": [
      "Action",
      "Comedy",
      "Crime",
      "Romance"
    ],
    "cast": [
      "Nina Dobrev",
      "Jackie Sandler",
      "Pierce Brosnan",
      "Betsy Sodaro"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Proposal.2009.1080p.BrRip.x264.YIFY.mp4",
    "year": 2009,
    "title": "The Proposal",
    "runtime": 108,
    "rating": 6.8,
    "description": "For three years, Andrew Paxton has slaved as the assistant to Margaret Tate, hard-driving editor at a New York publisher. When Margaret, a Canadian, faces deportation for an expired visa, she hatches a scheme to marry Andrew, and he agrees if she will promise him a promotion. A skeptical INS agent vows to test the couple about each other the next Monday. Andrew had plans to fly home that weekend for his grandma's 90th, so Margaret goes with him--to Sitka, Alaska, where Mom, Dad, and Grandma await. Family dynamics take over: tensions between Andrew and his dad, an ex-girlfriend, Andrew's dislike of Margaret, and Margaret's past color the next few days, with the INS ready to charge Andrew with fraud.—",
    "categories": [
      "Action",
      "Comedy",
      "Drama",
      "Romance"
    ],
    "cast": [
      "Sandra Bullock",
      "Aasif Mandvi",
      "Ryan Reynolds",
      "Malin Akerman"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "The.Sitter.UNRATED.2011.1080p.BrRip.x264.YIFY.mp4",
    "year": 2011,
    "title": "The Sitter",
    "runtime": 81,
    "rating": 5.6,
    "description": "Noah is not your typical entertain-the-kids-no-matter-how-boring-it-is kind of sitter. He's reluctant to take a sitting gig; he'd rather, well, be doing anything else, especially if it involves slacking. When Noah is watching the neighbor's kid he gets a booty call from his girlfriend in the city. To hook up with her, Noah takes to the streets, but his urban adventure spins out of control as he finds himself on the run from a maniacal drug lord.—20th Century publicity",
    "categories": [
      "Action",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Samira Wiley",
      "James Franco",
      "Jackie Hoffman",
      "Sam Rockwell"
    ],
    "subtitles": []
  },
  {
    "source": "The.Wedding.Ringer.2015.1080p.BluRay.x264.YIFY.mp4",
    "year": 2015,
    "title": "The Wedding Ringer",
    "runtime": 101,
    "rating": 6.6,
    "description": "Doug Harris (Josh Gad) is a lovable but socially awkward groom-to-be with a problem: he has no best man. With less than two weeks to go until he marries the girl of his dreams (Kaley Cuoco-Sweeting), Doug is referred to Jimmy Callahan (Kevin Hart), owner and CEO of Best Man, Inc., a company that provides flattering best men for socially challenged guys in need. What ensues is a hilarious wedding charade as they try to pull off the big con, and an unexpected budding bromance between Doug and his fake best man Jimmy.—Sony Pictures Entertainment",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Whitney Cummings",
      "Alan Ritchson",
      "Kevin Hart",
      "Kaley Cuoco"
    ],
    "subtitles": []
  },
  {
    "source": "The.World_s.End.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "The World's End",
    "runtime": 109,
    "rating": 6.9,
    "description": "20 years after attempting an epic pub crawl, five childhood friends reunite when one of them becomes hell bent on trying the drinking marathon again. They are convinced to stage an encore by mate Gary King, a 40-year old man trapped at the cigarette end of his teens, who drags his reluctant pals to their home town and once again attempts to reach the fabled pub, The World's End. As they attempt to reconcile the past and present, they realize the real struggle is for the future, not just theirs but humankind's. Reaching The World's End is the least of their worries.—Production",
    "categories": [
      "Action",
      "Comedy",
      "Sci-Fi"
    ],
    "cast": [
      "Rosamund Pike",
      "Jenny Bede",
      "Pierce Brosnan",
      "Bill Nighy"
    ],
    "subtitles": []
  },
  {
    "source": "Theres.Something.About.Mary.EXTENDED.CUT.1998.1080p.BrRip.x264.YIFY.mp4",
    "year": 1998,
    "title": "There's Something About Mary",
    "runtime": 119,
    "rating": 7.1,
    "description": "Ted was a geek in high school, who was going to go to the prom with one of the most popular girls in school, Mary. The prom date never happened, because Ted had a very unusual accident. Thirteen years later he realizes he is still in love with Mary, so he hires a private investigator to track her down. That investigator discovers he too may be in love with Mary, so he gives Ted some false information to keep him away from her. But soon Ted finds himself back into Mary's life, as we watch one funny scene after another.—Justin Sharp",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Ben Stiller",
      "Keith David",
      "Matt Dillon",
      "Cameron Diaz"
    ],
    "subtitles": []
  },
  {
    "source": "This.Is.the.End.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "This Is the End",
    "runtime": 107,
    "rating": 6.6,
    "description": "All Jay Baruchel expected coming to LA was a fun time with Seth Rogen with all the wild partying to have both by themselves and at James Franco's housewarming party. Suddenly, the Rapture hits and the Biblical Apocalypse has begun. Now, Jay and Seth are desperately sheltering in James' house for rescue along with a few other friends. Together, they must band together to attempt to survive the end of the world, only for Jay to find that they are all too dumb and superficial to do it until they discover the only way out.—Kenneth Chisholm (kchishol@rogers.com)",
    "categories": [
      "Action",
      "Comedy",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Emma Watson",
      "Kevin Hart",
      "Channing Tatum",
      "Paul Rudd"
    ],
    "subtitles": []
  },
  {
    "source": "Thor.2011.1080p.BrRip.x264.YIFYHI.mp4",
    "year": 2011,
    "title": "Thor",
    "runtime": 115,
    "rating": 7,
    "description": "The warrior Thor (Chris Hemsworth) is cast out of the fantastic realm of Asgard by his father Odin (Sir Anthony Hopkins) for his arrogance and sent to Earth to live amongst humans. Falling in love with scientist Jane Foster (Natalie Portman) teaches Thor much-needed lessons, and his new-found strength comes into play as a villain from his homeland sends dark forces toward Earth.",
    "categories": [
      "Action",
      "Adventure",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Samuel L. Jackson",
      "Idris Elba",
      "Anthony Hopkins",
      "Jeremy Renner"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Thor.Love.And.Thunder.2022.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2022,
    "title": "Thor: Love and Thunder",
    "runtime": 118,
    "rating": 6.1,
    "description": "Thor's retirement is interrupted by a galactic killer known as Gorr the God Butcher, who seeks the extinction of the gods. To combat the threat, Thor enlists the help of King Valkyrie, Korg and ex-girlfriend Jane Foster, who - to Thor's surprise - inexplicably wields his magical hammer, Mjolnir, as the Mighty Thor. Together, they embark upon a harrowing cosmic adventure to uncover the mystery of the God Butcher's vengeance and stop him before it's too late.",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Fantasy",
      "Romance",
      "Sci-Fi"
    ],
    "cast": [
      "Vin Diesel",
      "Matt Damon",
      "Idris Elba",
      "Christian Bale"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Thor.The.Dark.World.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "Thor: The Dark World",
    "runtime": 112,
    "rating": 6.7,
    "description": "Thousands of years ago, a race of beings known as Dark Elves tried to send the universe into darkness by using a weapon known as the Aether. Warriors from Asgard stopped them, but their leader Malekith (Christopher Eccleston) escaped to wait for another opportunity. The warriors find the Aether, and since it cannot be destroyed, they try to hide it. In the present day, Jane Foster (Natalie Portman) awaits the return of Thor (Chris Hemsworth), although it has been two years since they last saw once another. In the meantime, Thor has been trying to bring peace to the nine realms. Jane discovers an anomaly similar to the one that brought Thor to Earth. She goes to investigate, finds a wormhole, and is sucked into it. Back on Asgard, Thor wishes to return to Earth, but his father, Odin (Sir Anthony Hopkins), refuses to let him. Thor learns from Heimdall (Idris Elba), who can see into all of the realms, that Jane disappeared. Thor then returns to Earth just as Jane reappears. However, when some Policemen try to arrest her, an unknown energy repulses them. Thor then brings Jane to Asgard to find out what happened to her. When the energy is released again, they discover that when Jane disappeared, she crossed paths with the Aether and it entered her. Malekith, upon sensing that the time to strike is now, seeks out the Aether. He attacks Asgard and Thor's mother Frigga (Rene Russo) is killed protecting Jane. Odin wants to keep Jane on Asgard so that Malekith will come. Thor disagrees with his plan, so with his cohorts, he decides to take Jane away. He enlists the aid of his brother, Loki (Tom Hiddleston). Unfortunately, Loki's motivations remain unknown.—rcs0411@yahoo.com",
    "categories": [
      "Action",
      "Adventure",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Chris Evans",
      "Idris Elba",
      "Anthony Hopkins",
      "Natalie Portman"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Thunder.Force.2021.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2021,
    "title": "Thunder Force",
    "runtime": 106,
    "rating": 4.6,
    "description": "In a world terrorized by super-villains, one woman has developed the process to give superpowers to regular people. But when scientist Emily Stanton accidentally imbues her estranged best-friend with incredible abilities, the two women must become the first superhero team. Now, it is up to Thunder Force to battle the super-powered Miscreants and save Chicago from the clutches of The King.—Macroplanet",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Fantasy",
      "Sci-Fi"
    ],
    "cast": [
      "Jason Bateman",
      "Chris TC Edge",
      "Pom Klementieff",
      "Bobby Cannavale"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Tower.Heist.2011.1080p.BluRay.x264.YIFY.mp4",
    "year": 2011,
    "title": "Tower Heist",
    "runtime": 0,
    "rating": 6.2,
    "description": "Manager of a high-rise condo, Josh Kovaks' a good relationship with the tenants; especially financier, Arthur Shaw. When Shaw's arrested for fraud. Josh thinks it's a misunderstanding that can be resolved, but later he learns that the employees' pension fund - which he asked Shaw to handle - is gone. When one of the employees tries to kill himself, Josh's views of Shaw change. He goes to see him and loses his temper - and his job. An FBI agent tells him Shaw might just walk, and recovering the fund is unlikely. She tells him it's been rumored that Shaw has $20 million lying around if he needs it in a hurry. Josh thinks he knows where it is. Josh, along with 2 other (fired) employees, a(n evicted) tenant, and an (criminal) acquaintance, they set out to get into Shaw's, and get the money.—rcs0411@yahoo.com",
    "categories": [
      "Action",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Ben Stiller",
      "Téa Leoni",
      "Michael Peña",
      "Desmin Borges"
    ],
    "subtitles": []
  },
  {
    "source": "Turbo.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "Turbo",
    "runtime": 96,
    "rating": 6.4,
    "description": "After a freak accident infuses him with the power of super-speed, Turbo kicks into overdrive and embarks on an extraordinary journey to achieve the seemingly impossible: competing in the world's fastest race, the Indianapolis 500. With the help of his tricked-out streetwise snail crew, this ultimate underdog puts his heart and shell on the line to prove that no dream is too big, and no dreamer too small.—DreamWorks Animation",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Family",
      "Sci-Fi",
      "Sport"
    ],
    "cast": [
      "Samuel L. Jackson",
      "Luis Guzmán",
      "Ryan Reynolds",
      "Michael Peña"
    ],
    "subtitles": []
  },
  {
    "source": "Vacation.2015.1080p.BluRay.x264.YIFY.[YTS.AG].mp4",
    "year": 2015,
    "title": "Vacation",
    "runtime": 99,
    "rating": 6.2,
    "description": "Rusty Griswold plans a cross-country road trip with his wife and two sons in a bid to revive the lost ties between them. However, their trip turns into a series of mishaps, leading to altercations.",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Family"
    ],
    "cast": [],
    "subtitles": []
  },
  {
    "source": "Vacation.Friends.2021.1080p.WEBRip.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2021,
    "title": "Vacation Friends",
    "runtime": 103,
    "rating": 6.3,
    "description": "In this raw and raunchy comedy, straight-laced Marcus and Emily (Lil Rel Howery, Yvonne Orji) are befriended by wild, thrill-seeking partiers Ron and Kyla (John Cena, Meredith Hagner) at a resort in Mexico. Living in the moment, the usually level-headed couple lets loose to enjoy a week of uninhibited fun and debauchery with their new \"vacation friends.\" Months after their walk on the wild side, Marcus and Emily are horrified when Ron and Kyla show up uninvited at their wedding, creating chaos and proving that what happens on vacation, doesn't necessarily stay on vacation.—20th Century Studios",
    "categories": [
      "Adventure",
      "Comedy"
    ],
    "cast": [
      "Barry Rothbart",
      "Chris TC Edge",
      "John Cena",
      "Andrew Bachelor"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Venom.2018.1080p.BluRay.x264-[YTS.AM].mp4",
    "year": 2018,
    "title": "Venom",
    "runtime": 112,
    "rating": 6.6,
    "description": "After a faulty interview with the Life Foundation ruins his career, former reporter Eddie Brock's life is in pieces. Six months later, he comes across the Life Foundation again, and he comes into contact with an alien symbiote and becomes Venom, a parasitic antihero.",
    "categories": [
      "Action",
      "Adventure",
      "Sci-Fi",
      "Thriller"
    ],
    "cast": [
      "Tom Hardy",
      "Woody Harrelson",
      "Mac Brandt",
      "William W. Barbour"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Venom.Let.There.Be.Carnage.2021.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2021,
    "title": "Venom: Let There Be Carnage",
    "runtime": 97,
    "rating": 5.9,
    "description": "Eddie Brock struggles to adjust to his new life as the host of the alien symbiote Venom, which grants him super-human abilities in order to be a lethal vigilante. Brock attempts to reignite his career by interviewing serial killer Cletus Kasady, who becomes the host of the symbiote Carnage and escapes prison after a failed execution.—archit_a",
    "categories": [
      "Action",
      "Adventure",
      "Sci-Fi",
      "Thriller"
    ],
    "cast": [
      "Tom Hardy",
      "Tom Holland",
      "Woody Harrelson",
      "J.K. Simmons"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "WALL-E.2008.1080p.BrRip.x264.YIFY.mp4",
    "year": 2008,
    "title": "WALL·E",
    "runtime": 98,
    "rating": 8.4,
    "description": "In a distant, but not so unrealistic, future where mankind has abandoned earth because it has become covered with trash from products sold by the powerful multi-national Buy N Large corporation, WALL-E, a garbage collecting robot has been left to clean up the mess. Mesmerized with trinkets of Earth's history and show tunes, WALL-E is alone on Earth except for a sprightly pet cockroach. One day, EVE, a sleek (and dangerous) reconnaissance robot, is sent to Earth to find proof that life is once again sustainable. WALL-E falls in love with EVE. WALL-E rescues EVE from a dust storm and shows her a living plant he found amongst the rubble. Consistent with her \"directive\", EVE takes the plant and automatically enters a deactivated state except for a blinking green beacon. WALL-E, doesn't understand what has happened to his new friend, but, true to his love, he protects her from wind, rain, and lightning, even as she is unresponsive. One day a massive ship comes to reclaim EVE, but WALL-E, out of love or loneliness, hitches a ride on the outside of the ship to rescue EVE. The ship arrives back at a large space cruise ship, which is carrying all of the humans who evacuated Earth 700 years earlier. The people of Earth ride around this space resort on hovering chairs which give them a constant feed of TV and video chatting. They drink all of their meals through a straw out of laziness and/or bone loss, and are all so fat that they can barely move. When the auto-pilot computer, acting on hastily-given instructions sent many centuries before, tries to prevent the people of Earth from returning by stealing the plant, WALL-E, EVE, the portly captain, and a band of broken robots stage a mutiny.",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Family",
      "Romance",
      "Sci-Fi"
    ],
    "cast": [
      "Charles Fleischer",
      "Sigourney Weaver",
      "Mr. Lawrence",
      "Michael Crawford"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "War.Dogs.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "War Dogs",
    "runtime": 114,
    "rating": 7.1,
    "description": "In 2005, David Packouz lives in Miami, Florida, working as a massage therapist and living with his girlfriend Iz. Desiring an additional source of income, David spends his life savings on high-quality Egyptian cotton sheets, planning to sell them to Miami retirement homes, but this venture fails to produce results. At a funeral for a friend, David runs into his high school best friend Efraim Diveroli, who had moved to Los Angeles some years prior to work with his uncle selling guns. Efraim has left his uncle and formed his own company, AEY, which fills orders for arms placed by the US government due to the ongoing war in Iraq. David's life takes another turn when his girlfriend informs him that she is pregnant. Efraim offers him a job at AEY, and even though David and Iz both vehemently oppose the war, David eventually agrees, telling his girlfriend that he has begun selling his cotton sheets to the US government through Efraim's contacts.",
    "categories": [
      "Action",
      "Biography",
      "Comedy",
      "Crime",
      "Drama",
      "War"
    ],
    "cast": [
      "Ana de Armas",
      "Stoney Westmoreland",
      "Miles Teller",
      "Bradley Cooper"
    ],
    "subtitles": []
  },
  {
    "source": "We_re.the.Millers.2013.1080p.BluRay.x264.YIFY.mp4",
    "year": 2013,
    "title": "We're the Millers",
    "runtime": 110,
    "rating": 7,
    "description": "After being robbed of a week's take, small-time pot dealer David is forced by his boss to go to Mexico to pick up a load of marijuana. In order to improve his odds of making it past the border, David asks the broke stripper Rose and two local teenagers to join him and pretend they're on a family holiday.—Peter Brandt Nielsen",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Crime"
    ],
    "cast": [
      "Luis Guzmán",
      "Emma Roberts",
      "Sam Richardson",
      "Matthew Willig"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "When.We.First.Met.2018.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2018,
    "title": "When We First Met",
    "runtime": 97,
    "rating": 6.4,
    "description": "Noah thinks he has the perfect first night with Avery, the girl of his dreams, but he gets relegated to the friend zone. He spends the next three years wondering what went wrong--until he gets the unexpected chance to travel back in time and change that night--and his fate--over and over again.",
    "categories": [
      "Action",
      "Comedy",
      "Fantasy",
      "Romance"
    ],
    "cast": [
      "Alexandra Daddario",
      "Robbie Amell",
      "Andrew Bachelor",
      "Shelley Hennig"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Why.Him.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Why Him?",
    "runtime": 111,
    "rating": 6.2,
    "description": "Over the holidays, Ned, an overprotective but loving dad and his family visit his daughter at Stanford, where he meets his biggest nightmare: her well-meaning but socially awkward Silicon Valley millionaire boyfriend, Laird. The rivalry develops,and Ned's panic level goes through the roof when he finds himself lost in this glamorous high-tech world and learns that Laird is about to pop the question.—20th Century Fox",
    "categories": [
      "Action",
      "Comedy"
    ],
    "cast": [
      "Kaley Cuoco",
      "James Franco",
      "Zoey Deutch",
      "Mary Pat Gleason"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Zack.and.Miri.Make.a.Porno.2008.1080p.BluRay.x264.YIFY.mp4",
    "year": 2008,
    "title": "Zack and Miri Make a Porno",
    "runtime": 101,
    "rating": 6.5,
    "description": "Zack and Miri are two lifelong platonic friends who make an adult film to pay the rent of their apartment. With their friend Delaney, the couple set out for auditionees for their porn film, but in the process of filming, they realize they feel more for each other than they had before.—Fashionisto",
    "categories": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "cast": [
      "Justin Long",
      "Robert Roldan",
      "Seth Rogen",
      "Tisha Campbell-Martin"
    ],
    "subtitles": [
      "en"
    ]
  },
  {
    "source": "Zombieland.2009.1080p.BluRay.x264.AAC5.1-[YTS.MX].mp4",
    "year": 2009,
    "title": "Zombieland",
    "runtime": 0,
    "rating": 7.5,
    "description": "Searching for family. In the early twenty-first century, zombies have taken over America. A shy and college student in Texas has survived by following his 30 rules: like \"look in the back seat,\" \"double-tap,\" \"avoid public restrooms.\" He decides to travel to Ohio to see if his parents are alive. He gets a ride with a savage, brutal zombie-killer headed for Florida, and soon they confront a young woman whose sister has been bitten by a zombie and wants to be put out of her suffering. The sisters were headed to an LA park with atractions they've heard is without a zombie.—",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Fantasy",
      "Horror",
      "Sci-Fi"
    ],
    "cast": [
      "Emma Stone",
      "Rhett Reese",
      "Woody Harrelson",
      "Jesse Eisenberg"
    ],
    "subtitles": []
  },
  {
    "source": "Zombieland.Double.Tap.2019.1080p.BluRay.x264-[YTS.LT].mp4",
    "year": 2019,
    "title": "Zombieland: Double Tap",
    "runtime": 99,
    "rating": 6.7,
    "description": "One long decade after the post-apocalyptic events in Zombieland (2009), the resilient quartet of survivors--the tough-as-nails zombie exterminator, Tallahassee; his rule-making comrade, Columbus; the free-spirited huntress, Wichita, and her younger sister, Little Rock--find themselves in the bosom of a now-derelict White House. However, in a rabid world still overrun by multitudes of walking dead and mutated strains of evolved animated corpses, a premeditated separation will send the team back to square one, searching, once more, for the promised land. Now, all hope rests on Babylon: an entirely organic commune of blissful vegetarian pacifists who love to party. Is this the end of the road?—Nick Riganas",
    "categories": [
      "Action",
      "Adventure",
      "Comedy",
      "Horror"
    ],
    "cast": [
      "Emma Stone",
      "Woody Harrelson",
      "Jesse Eisenberg",
      "Zoey Deutch"
    ],
    "subtitles": []
  },
  {
    "source": "Zootopia.2016.1080p.BluRay.x264-[YTS.AG].mp4",
    "year": 2016,
    "title": "Zootopia",
    "runtime": 108,
    "rating": 8,
    "description": "From the largest elephant to the smallest shrew, the city of Zootopia is a mammal metropolis where various animals live and thrive. When Judy Hopps becomes the first rabbit to join the police force, she quickly learns how tough it is to enforce the law. Determined to prove herself, Judy jumps at the opportunity to solve a mysterious case. Unfortunately, that means working with Nick Wilde, a wily fox who makes her job even harder.—Jwelch5742",
    "categories": [
      "Action",
      "Adventure",
      "Animation",
      "Comedy",
      "Crime",
      "Family",
      "Mystery"
    ],
    "cast": [
      "Idris Elba",
      "Kristen Bell",
      "Jason Bateman",
      "Jesse Corti"
    ],
    "subtitles": [
      "en"
    ]
  }
]